{"Job ID": "69873112", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.ESSENTIAL DUTIES AND RESPONSIBILITIESClient/Stakeholder ManagementProvide superior customer service to meet on-site client’s expectations\nAct as an Ambassador for the JLL and Philips brands supporting and promoting client experience on site and act as the trusted partner for Philips\nBe visibly engaged in the workplace and act as the firs point of contact for issues and troubleshooting.Procurement & Vendor ManagementAssist in the management of all contractors on site to ensure they perform to the required standards (including inspection of vendors’ works).\nAttend monthly vendor meetings\nMonitor and maintain office, badge, tea and coffee consumables stock.\nOversee and order stationery when necessary.Finance ManagementAssist in financial processes to ensure that all financial management requirements are completed in a timely and accurate manner\nWork with JLL vendors to resolve invoice issues in a timely manner and report solutions to finance teams\nUse account tooling to record & report on spend and ensure spend with vendors remains in line with budget expectations and present figures at monthly meetings\nEnsure prompt and accurate management of purchase orders in JDE including creation of Purchase request forms and completion of goods receiving processesHealth & Safety ManagementEnsure all JLL contractor management processes are performed including but not limited to securing RAMS from vendors, spot checks, permits and site orientations.\nAssist in carrying out safety procedures when needed and having knowledge of emergency evacuation procedures as well as general Health & Safety.\nCompletion of GEMBA walks and JLL HSSE inspections and reports.\nReporting all good catches, near misses and incidents on the appropriate platformSite Operations ManagementCoordination of on-site JLL activities – arrange for contractors to attend locations responsible as per our service agreements.\nAssist in the implementation of Industry Best Practice operations\nConduct site inspections, GEMBA walks and assessments to ensure all building procedures and performance measures are always maintained.\nSeek ways to constantly reduce costs and improve operational standards\nEnsure premises are always maintained by vendors in neat and good working condition\nAttend appropriate meetings with JLL management and colleaguesReception supportSupport with reception cover greeting, assisting, and directing candidates, new hires, visitors, and general public to the right person in the company.\nReceive, direct and relay telephone, email, and other queries.\nMaintain the visitor sign-in book - and vendors - and a general filing system of correspondence, contacts, and deliveries.\nAssist with travel arrangements for Philips staffRisk ManagementFollow established escalation procedures and incident reporting procedures\nAdhere to JLL’s business conduct by ensuring compliance with the firm’s guidelines, procedures, and strategies\nAchieve Key Performance Indicators and Service Level Agreement targets\nAssist in all needed reporting (client and JLL internal)SecurityManagement of all the access of the building\nSupport creation of the entrance/access badge for new employees (or renewals). \nBack up for the visitor badges (in case reception is closed)\nDemonstrate a permanent high level of security awareness and emergency evacuation procedures.\nIssue badge access or print badge for employees/loaner, new hires, vendors, and visitors, maintaining record of sameMailManage incoming and outgoing mail / parcels / packages (transportation, check-in, material filing).\nEnsure the sorting, processing, and transmission of incoming mail, whether it is paper or dematerialized\nReceive registered mail, sign acknowledgements of receipt and forward them to the appropriate person, to the departments concerned.ADDITIONAL DUTIES AND RESPONSIBILITESSupport the wider JLL & Philips team.\nAs front-line employee, act as an ambassador of the IFM program.\nEnsure accurate and detailed hand over is planned & passed on (for tasks for which being responsible), if absent from the business.\nAttend all meetings as requiredAny other reasonable activity that is requestedSkillsFluency in local language and high/intermediate level in English language with excellent verbal & written communication skills.\nProficient with the use of Microsoft suite.\nKnowledge of local occupational health and safety requirements, critical facilities and vendor management for specialized services is advantageous\nUnderstanding of basic technical aspects of property (Computer Room Air-conditioning, Chiller system, Fire Protection system, Mechanical & Electrical system, BMS system) is advantageous\nProblem-solving skills – capacity to deal with ambiguity and solve complex problems effectively\nThe ability to effectively deal with stressful situations\nThe ability to work independentlyCompetenciesStrong Client and Customer Focus & Relationship Management\nSelf-motivated; confident & energetic\nFlexible – able to adapt to rapidly changing situations\nGoal-oriented – able to focus on meeting all performance targetsExperiencePrior experience in facilities, property management, hospitality or related field (preferred)QualificationsHospitality or Hotel Management/Vocational /education\nFacilities managementLocation:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}