{"Job ID": "69872829", "Description": "TasksSenior Engineer or Senior Technical Lead – ECU Architecture – AUTOSAR ClassicWe are all in for change – Are you too?The world is changing. The question is what will be our contribution to the outcome? At Mercedes-Benz, interdisciplinary teams are developing the mobility of tomorrow. You are welcome to join us. Together, we will create new connected ways to move around our globe. Think, try, and thrive with us in collaborative work environments that spark game-changing concepts. Innovative solutions by and for the people.Mercedes-Benz is aiming to take the lead in digital experience and electric drive with ambitious product development targets and accelerated introduction of new technology. In the area of car software and digital experience, Mercedes-Benz has announced its own proprietary MB.OS operating system that will be developed in-house. It will allow Mercedes-Benz to centralize control of all the vehicles’ domains and its consumer interfaces. Proprietary software development will allow greater speed and more frequent updates, and will be designed around scalable architectures that will control future development costs.It is in the area of car software development that Mercedes-Benz Research and Development India (MBRDI), headquartered in Bengaluru, is looking to hire a Senior Engineer or Senior Technical Lead for Electronic Control Unit (ECU) Architecture – AUTOSAR Classic.Responsibilities1.In this role, together with other team members, you will conceive and design future architecture and software of ECUs, their mapping to heterogeneous multi-core SoCs and the seamless integration of ECUs into future vehicle architecture.2.You will create modern and flexible software design for complex microcontroller (mC) & System on Chip (SoC) ECUs with AUTOSAR Classic, AUTOSAR Adaptive and other technologies.3.You will contribute to ECU design decisions across different feature verticals to ensure robust ECU software development & delivery.4.You will understand AUTOSAR requirements, ECU specific features and derive SW Architecture.5.You will search for complex fault patterns, together with team members, using test bench and in-car testing, and integrate lessons learned into future concepts.6.You will have opportunities to solve complex cross-functional technical problems.Necessary QualificationsBachelor of Engineering in Computer Science, Electrical & Electronics, Electronics & Communication or related field.\nMinimum four years of relevant industry experience.\nExperience in real-time and safety relevant automotive embedded systems.Rich experience in AUTOSAR with different vendor stacks (e.g., Vector, EB, etc.), tools and methodologies.\nHands on experience in AUTOSAR stack integration, preferably Vector’s.\nStrong experience in various communication protocols – Ethernet, CAN, LIN and FlexRay.\nGood working experience in various microcontrollers.\nStrong embedded C or C++ programming & debugging skills.\nExperience in developing and deploying custom APIs and SDKs (abstraction layers).\nExperience in embedded operating systems (POSIX and OSEK).\nExperience with time/data triggered frameworks for robotic / automotive applications (e.g. ROS2)\nThorough understanding of automotive functional safety and security.\nSignificant and extensive experience in software system architecture design, software implementation design, analysis, trouble-shooting and testing.Strong technical background to perform engineering calculations, simulations and analysis, as well as strong communication skills to explain technical issues clearly and effectively.\nAbility to read, understand and create diagrams, charts and schematics, as well as software architecture, software design and software development documents and test specifications.\nExperience in working with customers on design goals, technical strategies and requirements.\nAbility to anticipate roadblocks, diagnose problems and generate effective solutions.\nKnowledge of standard tools and methodologies such as fish bone, fault tree, etc., to guide activities.\nKnowledge of automotive software development life cycle.\nWell versed in UML/SysML design skills using Enterprise Architect, PREEVision or IBM Rhapsody.\nExperience in ASPICE, CMMI or equivalent software development process maps.\nExperience in practicing Agile.\nEffective analytical and conceptual skills to derive adequate solutions for technical problems.\nHigh initiative towards driving development and innovation.\nPro-active and self-motivated.\nExcellent planning and organization, and time management skills.\nExcellent behaviors and outlook.Preferred Qualifications1.Experience in AUTOSAR Adaptive, Service Oriented Architecture (SOA) and Signal to Service concepts.2.Experience in SoC architecture and low level software components for SoCs, e.g., IPC, synchronization, life-cycle management, etc.3.Experience in automotive ECU virtualization technologies, e.g. hypervisor.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}