{
    "Job ID": "69872907",
    "Description": "HSE Senior Manager\n Would you like to implement strategies to improve the safety of our workforce?\n Are you excited by the prospect of working for industry leader in Health and Safety?\n Join our HSE Team\n Our people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.Partner with the best\n As a Health and Safety Manager, you will be ensuring the well-being of our workforce and compliance to regulatory standards. You will build relationships with cross-functional teams and customers to ensure requirements are met. You will provide solutions and help to develop your team and continuous improvement of our HSE.As a As a Health, Safety, and Environment (HSE) Manager, you will be responsible for:\n Supporting HSE for the Bently Nevada product line India and Eastern hemisphere operations, including but not limited to:\n\nImplementing strategy and tactics to meet business HSE expectations through programs, risk mitigation projects, communication, and training.\n\nImplementing HSE priorities, metrics, goals, and requirements to complete the integration process and operational ownership of EHS\n\nIntroducing and firmly establishing programs, tools, and training to ensure compliance with legal requirements, implementation of Baker Hughes HSE Management System (MS).\n\nCoordinating/collaborating with other functional leaders and people leaders ensuring expeditious and sustainable program implementation with continuous improvement\n\nProviding technical expertise and compliance support to HSE professionals, ensure compliance with applicable regulations, standards, and practices, and assist in responding to significant incidents and government requests/notices\n\nInfluencing and mentoring facility leadership toward the strengthening of an Interdependent HSE Culture\n\nAbility to travel up to 20% of timeFuel your passion\n To be successful in this role you will:\n Have a Bachelor's degree from an accredited university or college.\n\nHave Minimum of 7-12 years of experience in Fixed Facilities/Services.\n\nHave substantial experience of working within the HSE discipline and framework\n\nDemonstrate experience of leading, mentoring and motivating large teams within a global matrix environment\n\nHave strong oral and written communication skills.\n\nHave strong interpersonal and leadership skills.Work in a way that works for you\n We recognise that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too. In this role, we can offer the following flexible working patterns:\n Occasionally working remotely from home or any other work location\n\nWorking flexible hours - flexing the times when you work in the day to help you fit in everything in and work when you are the most productiveWorking with us\n Our people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.\n The Good Stuff\n Our inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. We prioritize rewarding those who embrace change with a package that reflects how much we value their input. Join us, and you can expect:\n Contemporary work-life balance policies and wellbeing activities\n\nComprehensive private medical care options\n\nSafety net of life insurance and disability programs\n\nTailored financial programs\n\nAdditional elected or voluntary benefitsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}