{"Job ID": "69875718", "Description": "Who are Inchcape? At Inchcape, our vision is to have a connected world, in which our customers trade successfully and make better decisions in every port, everywhere. We use technology and our global network to help our partners connect to a smoother, smarter ocean.  Inchcape combines its worldwide infrastructure with local expertise through our global network of over 250 proprietary offices, across 70 countries and a team of more than 3,000 committed professionals. Our diverse global customer base includes owners and charterers in the oil, cruise, container, and bulk commodity sectors as well as naval, government, and intergovernmental organizations.  We have an ambitious growth model and a career here is certainly going to be a rewarding one that will allow you to bring your skills & experience. We embrace change and are open to new thinking and pushing for positive change in our industry.  \n We have an exciting opportunity for a Finance Manager in our Mumbai team. The role is an essential part of the Managed Services team for ISS, responsible for financial accounting and reporting across the  Global Hub in the UK and VSC Hub in MumbaiThe role will cover:\n• Accountable for financial statements and accounting\n• Business partnering with the management team\n• Management of cash flow with the Finance Operations team. In particular receivables and sub-agent funding.\n• Manage accounting processes with the team in the shared service team.\n• Compliance with globally standardized processes for financial reporting\n• Recognition of revenue in line with IFRS principles\n• Revenue / Cost matching in monthly management reporting\n• Adherence to Group Finance Policies as laid down in the Finance Manual\n• Assist in managing Customer accounts and maintaining up-to-date statements.\n• Preparation of analytical reports on Hub performance and track financial KPIKey Accountabilities:Financial Accounting & Reporting (40%)\n• Ensure timely completion of reporting for the Managed Services\n• Support the preparation and review of all monthly Actuals reporting (P&L and Balance Sheet) ensuring it is compliant with IFRS and Group accounting policies.\n• Ensure the completeness and accuracy of all management reporting in Hyperion\n• Ensure the accuracy of foreign currency accounting transactions in the system in accordance with the Group Finance Manual\n• Support the development of new system developments, to drive improved compliance and efficiency.\n• Have in-depth knowledge of the reporting systems (Hyperion & Unit4Financial) to be able to advise end users on reporting requirements through the system.\n• Support the review of new IFRS requirements and/or regulatory issues and recommend how the business should prepare to meet them.\n• Support the rollout of a robust Financial Accounting and Reporting control environment that adheres to the Inchcape Group policies and embeds best practices across the business.\n• Ensure bank reconciliations are performed to reflect the correct position of the Global client contracts\nBusiness partnering (20%)\n• Provide best-in-class technical accounting advice to the team through constant guidance and optimization of process\n• Support the identification and mitigation of accounting risks across the Group.\n• Support the business by educating and advising them on how to use the accounting systems.\n• Support ad hoc analysis as required by the Global teams, including Treasury, Tax, IT, Internal Audit, Legal and HR.\nExternal Audit (20%)\n• Support the group audit process by providing the required documents\n• Support the team with guidance in preparing reconciliations and other work papers, including providing support to the Global Finance & Consolidation team.\nFinance team development (20%)\nBe an active part of the senior finance team for Managed Services and support the Hub operations Develop the team of GL accountants into a professional, high-performing function.Knowledge, Experience, and Skills:\nEssential:\n• Excellent knowledge of IFRS and statutory accounting\n• Experience as a financial manager heading a team.\n• Experience in financial risk management and enforcing control environment.\n• Experience in working in a multi-national, multi-cultural organization.\n• Excellent communication skills and a good command of the English language (oral and written)\n• Experience in working on a group consolidation system.Desirable: Good to have but not mandatory\n• Knowledge of the shipping industry\n• Knowledge of Hyperion Financial Management system\n• Knowledge of Unit4 Financial system\n• Experience in project management\n• Experience in managing a teamEducation and Professional Qualifications:\nEssential:\n• University degree in finance, accountancy, business\n• Qualified and Registered Chartered Accountant (ACA /ACCA / CPA (or equivalent)Other Requirements:Essential:\n• Access to hi-speed reliable internet connectivity from home (during remote working)Why Inchcape Shipping Services? We believe in building a diverse and high-performing workforce, that works together to provide our customers with the exceptional service they deserve. To reach the highest standards we depend on our people, their welfare, training, and expertise. We realize the value of our staff and know that your unique experiences, skills, and passions will help you to build a rich and rewarding career in our dynamic industry. Our values are at the centre of everything we do and the successful candidate will be expected to demonstrate and fully adopt these: Global Perspective - we connect the world and see the bigger picture. The Power of People - we rely on the strength of local agent knowledge and relationships. Progress - we adopt new thinking and push for positive change in our industry. In return, we will offer you: A diverse range of benefits, depending on your geographical location. Globally as a minimum, you will receive:  A retirement savings plan  Life assurance  \nHoliday starting at 22 days  \nHealthcare  \nCompetitive salary  \nEmployee Assistance Programme  Career development and progression opportunities \nValues Award celebration events \nTeam building days Plus, much more! If you think that you have the right skills, knowledge, and attitude to join our team, then we invite you to apply by simply clicking at the top of this advert!  #ISSthebiggerpicture  Appointment to this role will be subject to satisfactory references and possession of a valid Right to Work documentation depending upon your geographical location. Inchcape is an Equal Employment Opportunity Employer and equality, diversity, and inclusion are at the center of everything we do. We recognize that our customers, colleagues, contractors, and other partners are central to our success and that we work in a diverse society. We acknowledge not only our legal but also our moral responsibility to ensure all groups have equality of opportunity. #LI-MB1Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}