{"Job ID": "69873838", "Description": "Who are we?Trimble Transportation is a division of Trimble Inc., a leading provider of technology solutions for various industries. Trimble Transportation focuses specifically on providing technology and software solutions to the transportation and logistics industry.Trimble Transportation offers a range of solutions designed to improve operational efficiency, enhance safety, and optimize resources for fleet management, transportation logistics, and supply chain management. These solutions leverage advanced technologies such as GPS, telematics, cloud computing, and data analytics to enable better decision-making and streamline processes in the transportation industry.Who are we looking for?We are looking for a Lead Software Development Engineer in Test to develop and execute manual and automated tests to ensure product quality. The SDET responsibilities include test case development, designing and implementing automated UI / API tests for web applications. The responsibilities will also include monitoring all stages of software development to identify and resolve system malfunctions to meet quality standards. The candidate is also expected to strike a balance between Indian and US time zones to ensure attending team meetings, addressing production issues, etc.Responsibilities:As a member of the core team, you will participate in and be responsible for the full life cycle of software development activities including new product releases, upgrades, functional enhancements, defect resolution, and performance improvements.Regularly and proactively communicate status, risks, and other issues related to projects that are under development\nBuild and manage a team of SDETs delivering test automation and workflow improvement\nCoach, mentor and grow SDETs \nCollaborate with other Senior SDET Leads on solving common pain points that impact multiple projects\nResponsible for end-to-end Quality Assurance of one or more product lines, making quick and reliable software releases\nShares responsibility for delivering all Product goals with the Development team\nDrive Test Automation and Test Efficiency Effectiveness Goals\nIncludes setting up and improving best practices & processes for testing & automation\nResponsible for hiring and mentoring QA team members\nInterfaces with internal and external stakeholders as needed in understanding, prioritization, and resolution of product requirements and issues, and to deliver new capabilities and support existing capabilities on the product over multiple product releases and feature areas\nSupport risk management and mitigation plans during a crisis\nManage QA Processes for the Testing and Automation Team\nResearch and stay informed about the latest best practices in Software Engineering\nCollaborate with cross-functional teams to define and document test requirements and test cases.\nIdentify and advocate for appropriate test tools, methodologies, and best practices.Qualifications:5+ Years working experience as a SDET Engineer.\nBachelor’s degree in computer science, software engineering or related field.\nDemonstrated knowledge of both black-box and white-box testing techniques\nDemonstrated knowledge in creating framework / enhancing the framework \nHaving knowledge in Design Patterns and SOLID principles\nExperience owning test approach (e.g. schedule, staffing, plans, etc.) to a moderate/large area\nKnowledge of mobile operating systems such as iOS and Android\nWell-versed in the Continuous integration and deployment (CICD)process\nExperience with version control tools like GIT /BitBucket\nShould have hands on experience in creating automation scripts for mobile using Appium/Selenium/WebDriver.io\nExperience with one or more general purpose programming languages like Java, JavaScript. \nAbility to comprehend and communicate effectively with management, other engineers, and internal and external customers.\nMust be self-motivated and able to work independently and effectively in a team environment\nAbility to read, analyze, and interpret complex technical documents, diagrams, data models, and process documents.\nCustomer focused with excellent follow through on commitments.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}