{"Job ID": "69875699", "Description": "Responsibilities:Understand requirement and translate that to product features.\nParticipate in Scrum meetings and express the work done and the plan clearly. Participate in scrum ceremonies and clearly communicate.\nDevelop applications using Front end, middleware, and database related technologies.\nShould be hands in developing and implementing best practices and write smart piece of code.\nCoding standard should be followed, and the code should be highly performant.\nShould be able to write unit test cases using any of the frameworks and should be completely automated.\nShould have strong exposure in REST API design and principles and adhere to RAML/Swagger or Open API specification\nShould be able to do impact analysis and document the design of the components.\nShould be able to develop reusable components using proper design patterns as listed by lead/architect so that it is extensible.The Role offers:An outstanding opportunity to re-imagine, redesign, and apply technology to add value to the business and operations.\nAn end-to-end project exposure across multiple technical stack and cloud platform\nAn individual who has passion to learn and adapt to new technologies quickly and scale to next level easily.\nHigh visibility, opportunity to interact with multiple groups within the organization, technology vendors and implementation partners.Essential Skills:In-depth knowledge in C#, ASP.NET MVC, Azure App Development, Azure Integration Services, SQL Server 2017, ASP.Net 5.0, Java Script\nHands-on-experience in .Net Core 3.x, EF Core, Webapi core\nHands-on-experience in RESTful Http services design\nHands-on-experience in developing Microservices and docker.\n4+ years in using Azure PaaS, Azure Integration and Messaging (Logic Apps, Service Bus, Event Grid) Azure Batch, Azure Functions, Azure Automation, API Management\n4+ years in Docker, Azure container, AKS, Azure DevOps – Pipeline\n4+ Years in Azure SQL DB, Redis Cache, Azure Monitor\n4+ years of experience with SQL Server or Postgre SQL writing stored procedures, performance tuning and identifying deadlocks, transactions and data locking/blocking scenarios\nGood communication and unit testing knowledge using NUnit,Xunit etc\nFamiliar with Continuous Integration methodologies and tools, including Jenkins\nGood to have: Docker, Containerization_Cloud, Kubernetes_CloudEssential Qualification:MCA/equivalent master’s in computers is a must.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}