{"Job ID": "69873604", "Description": "At Emirates, we believe in connecting the world, to and through, our global hub in Dubai; and in constantly innovating to ensure our customers ‘Fly Better’. Our Product team makes this possible by creating products that are innovative, efficient and a game changer in the aviation world. Do you want to play a part in that journey and own technical products used by stakeholders and customers across the world? Join us in cosmopolitan Dubai as a Product Owner and make your mark on the aviation world by taking our products to the next level. As a Product Owner, you are the bridge between the engineering teams and your stakeholders. You will help to define the vision of the products we create; drive the planning, prioritisation and execution of backlogs and deliver new features that support our strategic goals. What You’ll Do - Support the Technical Product Manager and Stakeholders driving the roadmap, based on insights, and champion this across your engineering teams - Drive product development through your engineering and scrum teams - Write user stories, prioritise backlogs, manage release activities and support sprint ceremonies - Define detailed use cases, product requirements, and technical specs needed to support roadmap initiatives. - Set product objectives, define success metrics and deliver business outcomes, ensuring KPIs and targets are met - Continuously innovate and iterate as you deliver your roadmap in order to provide the best product and solutions possible - Ensure effective collaboration across a diverse range of teams and stakeholders to balance the needs and priorities of the business and our customers. - Work cross-functionally with engineering, delivery, architecture, and business partners - Deliver world class user journeys that our customers value - Be a part of our Product community, focusing on collaboration and identifying opportunities of improvement and growthJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}