{
    "Job ID": "69873359",
    "Description": "Lear, a global automotive technology leader in Seating and E-Systems, enables superior in-vehicle experiences for consumers around the world. Our diverse team of talented employees in 37 countries is driven by a commitment to innovation, operational excellence, and sustainability. Lear is Making every drive better™ by providing the technology for safer, smarter, and more comfortable journeys. Lear, headquartered in Southfield, Michigan, serves every major automaker in the world and ranks #186 on the Fortune 500. Further information about Lear is available at lear.com, or follow us on Twitter @LearCorporationYour missions:- Follow-up and regular checks of the workforce- Follow-up and Update of Personnel files- Follow-up of direct staff contracts with ANAPEC- Follow-up and Preparation of Indirect & Salaried Contracts.- Prepare reports and presentations for (internal disciplinary audit; absenteeism..)- Provide orientations for new employees by sharing onboarding packages and explaining company policies- Preparation and follow-up of all the requests of the administrative certificates: Work certificates, leave, CNSS, Visa ...- Daily monitoring of the schedule for the Direct staff, and the test periods for Salaried and Indirects.- Payroll Treatment- Organization of motivation activities for employees- Transport & timing optimization- Contributes to the implementation of company policies and advises line management on personnel practices issues, within the specialization.- Provides administrative support to the function. Runs reports for different departments such as Headcount, Absenteeism, etc.To be successful for this role:- Preferably Bac+5 minimum in Human Ressources/BS Administration/Management, with an experience of a year or less in a similar position- Ability to work in a high-tempo environment and interact with team members over a wide scope of the organization.Language Skills:- Good communication skills in both French and English.Location : - KenitraLear Corporation is an Equal Opportunity Employer, committed to a diverse workplace.Applicants must submit their resumes for consideration using our applicant tracking system. Due to the high volume of applications received, only candidates selected for interviews will be contacted. Unsolicited resumes from search firms or employment agencies, or similar, will not be paid a fee and will become the property of Lear Corporation.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kenitra, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}