{
    "Job ID": "69870093",
    "Description": "Job DescriptionRole Purpose:This is a vital and highly dynamic role reporting to the Senior Project Manager - Communities Off-site Professional & Support Facilities. Such facilities can range from those considering entire accommodation solutions for communities of professional and/or craft workers through to, for example, first response, fire and medical facilities.The primary purpose always to act as a focal point, in which the PM will oversee the planning, design, procurement and implementation of said facilities associated with THE LINE, generally outside of the Development Area. The PM shall be responsible for providing solutions which consider health safety and wellbeing a key value alongside cost, quality, speed of deployment and sustainability. Furthermore, given the scale of the accommodation developments requirements for THE LINE the PM shall consider those factors affecting the supply chain and work closely with designers, suppliers/constructors and operators, working closely with the procurement team in the implementation of solutions with key considerations being that of region and cultures in an important dynamic in planning and prioritizing KSA national registered contractors.Being part of the fulfilling the 2030 vision which is explicitly linked to the development of vibrant leisure and hospitality sectors with improving the quality of life and providing services for Saudis gives further underlying purpose to this role.Key Responsibilities:To hold health, safety and wellbeing (HSW) as a key value and participate in the creation, development, and implementation of HSW strategies;\nDeputize for the Senior Projects Manager Communities Off-site Professional & Support Facilities,  in their absence.\nResponsibility for the timely and cost-effective delivery of client projects, meeting business and environmental objectives;\nLeadership of sometimes cross functional, multi-disciplinary teams, providing direction across the functions to ensure delivery of NEOM Projects Client projects;\nLine management of Assistant Project & Site Implementation Manager;\nInfluencing and supporting client project delivery through effective and proportionate planning, monitoring, controlling and reporting of performance;\nEnsuring a risk management system is embedded in project decision making and championing the risk management process;\nManaging change and the associated follow-on activities, whilst ensuring compliance with all relevant safety, environmental and management procedures;\nUnderstanding requirements – ensuring clarity of identification, definition and specification of projects, to align with NEOM Projects Client business needs and context;\nActively supporting the development of cost, schedule and reporting (weekly reports, monthly dashboards and reports, presentations, etc.) with the PMO to ensure the requirements are met;\nPromoting and fostering positive working relationships with internal and external stakeholders;\nDevelop and produce presentations and reports as required;\nCapturing and implementing lessons learned throughout the project lifecycle, supporting the development of best practice and governance at project and organizational levels.Knowledge, Skills, and Experience:Management experience in at least one of the following sectors; accommodation & facilities, transportation, water, energy, nuclear, healthcare, or built environment.\nEffective communicator, both written and orally, with excellent interpersonal skills; \nCollaborative working style and consulting behaviours; \nAbility to operate autonomously, skilled in developing and building relationships; \nExperience in the application of project management tools; \nAn understanding of planning techniques and tools, including P6 and Microsoft Project; \nExperience in application of a variety of contract forms; \nExperience of a variety of procurement mechanisms; \nAble to identify client requirements;\nAble to quickly learn and understand complex organisational structures and ways of working; \nHighly computer literate including Microsoft Office as a minimum and a willingness to learn new programs quickly; \nStrong organizational skills and attention to detail. Qualifications :[Necessary]Degree in an appropriate discipline\nMinimum ten (15) years’ experience working in a management environment.[Desirable]Member of the Association for Project Management (MAPM); \nProfessional Chartership e.g. ChPP, CMgr, CEng \nPRINCE2 Practitioner. Worker TypeJob TypeAt SNC-Lavalin, we seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences.  SNC-Lavalin cares about your privacy. SNC-Lavalin and other subsidiary or affiliated companies of SNC-Lavalin (referred to throughout as “SNC-Lavalin”) are committed to protecting your privacy. Please consult our Privacy Notice  on our Careers site to know more about how we collect, use and transfer your Personal Data.By submitting your personal information to SNC-Lavalin, you confirm that you have read and accept our Privacy Notice.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}