{
    "Job ID": "69873136",
    "Description": "The FRSS Global Data Governance Lead is a key position responsible for the development, framework buildout and oversight of a data governance program for data that FRSS owns and / or uses.  Given the importance of data in the end to end financial and risk reporting processes, the data governance lead is a strategic role that will partner with Finance Data Domain owner(s) on all issues related to identification of data quality issues, IMRs and remediation of data quality issues. Key responsibilities include but is not limited to:Plan, provide oversight, and drive adoption of data strategy for FRSS in partnership with Finance, Chief Data Office, and EO&T Data Governance Officer\nDevelop a Data Governance and management strategy, framework, tools, and implementation plan for data used or owned by FRSS reporting operations teams\nProvide guidance, direction, and oversight of FRSS compliance with Citi Data Management Policy, including things like CDE and IMR specific for FRSS reporting operations processes\nExercise governance over data related responsibilities for FRSS, e.g. when FRSS is report owner, report preparer, schedule owner, schedule preparer, or process owner, etc.\nImplement a framework to identify and escalate data quality issues, ensure root cause analysis is performed timely, and monitor resolutionMonitor execution of data strategy and data controls for data that FRSS reporting operations owns or uses.  Monitor that FRSS data related controls, documentation, and procedures comply with established framework to mitigate key risksThe incumbent will directly manage a team of data governance professionals in the execution of robust data strategy, governance, and compliance.  Additional duties as follows: Build a high performing team of Data Governance analysts with the required leadership, influence, and analytical skills (hire, train, manage, oversee, etc.)\nDevelop and implement monitoring and reporting requirements including metrics i.e. heat maps, dashboards, Senior Management packages, monitoring, etc.  Reporting will be provided to Senior members of FRSS, including head of FRSS, FRSS global Risk Control lead, Reporting Operations Managers, FRSS Center Heads, Finance, CDGO, and EO&T as appropriate\nEvaluate exposure of data quality deficiencies and ensure effective and timely control reporting and escalation\nPrepare clear, concise and accurate documentation, reports of work performed and other written materials; read, interpret, explain and apply critical thinking.\nEngage with senior management to report, escalate issues and review/present exceptions\nEnsure departmental processes and procedures are implemented and kept current.\nEnsure sufficient time zone coverage across North America, Costa Rica, Mumbai, and Manila to facilitate ongoing interaction with FRSS reporting operations teamsQualifications:The successful candidate will utilize an extensive, multi-disciplinary knowledge of data quality and data control concepts to implement a comprehensive data quality framework.  To qualify for this position, you must be a senior individual with a proven track record and have experience within the financial services industry and the following:Incumbent should have 10+ years of experience within the financial industry with data quality / data control background a+.\nBS Business, Finance or Risk degree required\n7+ years of management experience with proficiency in building teams.\nExperience in working with a variety of financial platforms, good technical expertise; ability to manage a complex portfolio in a dynamic and changing environment.\nKnowledge of data flows and working knowledge of financial institutions' products, businesses and functions; and reporting requirements\nExperience with program planning and implementation skills.\nProficient in risk and control analysis and audit concepts and skilled at analyzing root causes of problems and anticipating emerging issues.\nKnowledge of Citi Data Management Policy a +; Project/Program management experience a +Other Skills:Possess the ability to look at the big picture and is well versed in a ‘no surprise’ culture to be able to proactively engage stakeholders to mitigate risk.\nAbility to develop and produce monthly metrics and identify trends and themes from high volume information sources and synthesize reports for easy consumption of senior managers.\nAbility to establish and meet strict deadlines.\nExcellent organizational skills; strong vocal leadership; ability to drive strategic change and possess superb problem-solving skills.\nDemonstrate executive presence and organizational savvy.\nDemonstrate facilitation, and partnering skills.\nCandidate should be analytical, flexible, team-oriented, have good interpersonal, communication, and leadership skills with strong attention to detail and ability to multi-task.       \nThis individual must be an articulate and effective communicator, both written and verbal, with an energetic, charismatic and approachable style. Candidates must have effective persuasion skills, the ability to work effectively at the highest levels of the organization, and display influencing skills.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}