{"Job ID": "69872862", "Description": "Employee Digital and Service Experience (EDSE) is a best-in-class, global HR Shared Services organization of approximately 2000 people, that services the entire global population of JPMC, currently totaling over 258,000 employees worldwide, in 64 countries. EDSE provides vital services in the area of contact center (HR Answers), payroll, benefits administration, global data management (including records management and letters production), On/Off boarding employees, M&A and product enablement teams. Our efforts are focused on supporting the firm to achieve its strategic priorities by delivering a seamless employee experience through our people, processes, and technologies.The role will report to the US & APAC Payroll Lead in India.Job Responsibilities:Driving & Reporting on the Operational Governance for the Head of Payroll\nPrepare monthly and quarterly business review reports to be presented to regional and international stakeholders.\nUnderstand the project and change agenda’s and provide regular reporting to the head of Payroll.\nLead the change / project portfolio including tracking of status, updates and project risks\nSupport the project office on oversight and management of regional and international change agendas\nSupporting the Regional EDSE Leadership team and other key stakeholders in management and tracking of strategic goals\nCreate executive reports and dashboards for senior stakeholders\nAssist on all BAU reporting and analytics, for periodic reports and scorecards\nStrategize and govern pan-EDSE payroll roll-out of digital and non-digital solutions\nPromote intelligent automation on reports and dashboards where possible\nAbility to take on and track adhoc tasks as required including supporting the risk and control function in generating and managing the functions control processes\nAbility to understand project and change agenda’s, familiarity with project lifecycles.\nSetting up, facilitating, and/or participating in meetings with stakeholders and working groups. Outputs may include action or implementation plans, review decks, minutes, issues and monitoring of follow ups and communication.\nManage change / project activities including tracking of status, updates and project risks\nSupport the project office on oversight and management of regional and international change agendas\nBudget management – ability to build business case to support proposalsRequired Qualifications, Skills and Capabilities:Min 5 years in Business Management role with experience supporting executive teams.\n3 years in Project Co-ordination / Project Management Office role\nAbility to communicate well orally and in writing, and work in a cross-functional team\nWorking knowledge of SharePoint, Access and Tableau is an advantage\nGood Client Relationship skills;  ability to identify, build and maintain relationships\nBasic understanding of Risk and Control within a Corporate Human Resources Function\nMinimum 3 years in Human Resources\nDemonstrated project management skills with ability to deliver on commitments Highly motivated, results-oriented, and client-focused\nSolid knowledge of standard desktop applications:  MS Office, MS Project, PowerPoint, Excel and OutlookJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}