{
    "Job ID": "69873666",
    "Description": "Job Title:Job DescriptionConcentrix is a technology-enabled global business services company specializing in customer engagement and improving business performance. We partner with ambitious, progressive executives around the world to future-proof their business and stay ahead of the competition and customer expectations.Role and Key Responsibilities:Drive continuous improvement for Transaction Quality and Delivery\nManage Call Quality & Client related KPI’s.\nEvaluate effectiveness of TQ interventions\nCreate and maximize relationships with client partners.\nStrengthen Quality management processes / framework to improve quality delivery.\nAccurately capture SLA/SLO metrics, the reporting needs of each of the client and set up / customize processes to seamlessly meet client's expectation.\nConduct regular one-on-ones with direct reports to review individual performance, the performance of their team and offer on-going developmental coaching.\nCreate a positive work environment through employee engagement; resolve employee relation issues in a professional and timely manner.\nAbility to get out of the box ideas and Process improvement initiatives in the process.\nShould drive Process control & Compliance in addition to managing Audit requirements.\nProvide crisp and specific feedback to Front Line Recruitment Teams on the quality of new hires.\nProvide quality floor support, feedback, refresher.\nFacilitate Quality and Compliance team to perform various audits and follow ups based on observations highlighted.\nParticipate in cross functional meetings to review information received from operational support functions - Training, HR, Quality, WFM, TA. - and partner to define action plans that resolve issues and drive continuous improvement.\nImplement best practices and over-delivery for clients, drive consistent performance, evaluate staffing needs, with input from BD and Client and adjust meet changing requirements.\nAttend business reviews with the client.\nHandle a team of team leaders.Key skills & knowledge:Excellent communication skills, both written and verbal.  Ability to effectively present information to internal and external associates.\nMust have at least 4 years of experience in Quality domain in BPO, Travel background preferred.\nAdvanced Microsoft Office skills\nDemonstrated ability to lead team in organizing and prioritizing projects in a fast-paced and deadline-oriented business environment.\nAbility to interpret and analyze recruiting metrics and trends: retention, quality of hire, net throughput, etc.\nDemonstrated ability to mentor, coach and provide direction to a team of employees.\nDemonstrated ability to take initiative and ownership with focus on continuous improvement.\nDemonstrated ability to foster customer service disposition and sense of professionalism for self and team.\nSolid understanding of the organization's business operations and industry.  Demonstrated business acumen.\nDemonstrated talent with critical thinking; ability to comprehend, analyze, and interpret.\nExcellent attention to detail\nAbility to handle and maintain confidential information.Educational Qualification: GraduateDisclaimer: -'Neither Concentrix nor any authorized 3rd party who assist with our recruitment process, ever ask candidates for ‘recruitment’, ‘processing’ or any other kind of fees in exchange for offer letters from Concentrix. Offer letters and other recruiting correspondence from Concentrix are printed on Concentrix letter head with authentic signatures of appropriate Concentrix authorities.'Location:Language Requirements:Time Type:If you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California ResidentsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}