{"Job ID": "69873483", "Description": "Job Number 23168041 Job Category Rooms & Guest Services Operations Location Hyderabad Marriott Hotel & Convention Centre, Tank Bund Road, Opposite Hussain Sagar Lake, Hyderabad, Andhra Pradesh, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Entry level management position that is responsible for leading and assisting with the successful completion of daily shift requirements. Front office areas include Bell/Door Staff, Switchboard and Guest Services/Front Desk. Strives to ensure guest and employee satisfaction and achieve the operating budget. Assists in completing financial and administrative responsibilities. CANDIDATE PROFILE Education and Experience • High school diploma or GED; 2 years experience in the guest services, front desk, or related professional area. OR • 2-year degree from an accredited university in Hotel and Restaurant Management, Hospitality, Business Administration, or related major; no work experience required. CORE WORK ACTIVITIES Supporting Management of Front Desk Team • Utilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision making; demonstrates honesty/integrity; leads by example. • Encourages and building mutual trust, respect, and cooperation among team members. • Serves as a role model to demonstrate appropriate behaviors. • Supports all day-to-day operations. • Understands employee positions well enough to perform duties in employees' absence. • Coaches, counsels, and encourages employees. • Handles employee questions and concerns. • Supports all areas of the Front Office in the absence of the Front Office or Front Desk Manager. • Guides daily Front Desk shift operations. • Communicates performance expectations to employees in accordance with job descriptions for each position. Monitoring and Supporting Progress Toward Guest Services and Front Desk Goals • Manages day-to-day operations, ensuring the quality, standards and meeting the expectations of the customers on a daily basis. • Develops specific goals and plans to prioritize, organize, and accomplish your work. • Handles complaints, settling disputes, and resolving grievances and conflicts, or otherwise negotiating with others. • Participates in department meetings and continually communicates a clear and consistent message regarding the Front Desk goals to produce desired results. • Strives to improve service performance. • Supervises staffing levels to ensure that guest service, operational needs and financial objectives are met. • Trains staff on adherence to all credit policies and procedures to reduce bad debts and rebates. • Supervises same day selling procedures to maximize room revenue and property occupancy. • Understands the impact of Front Desk operations on the overall property financial goals and objectives. Ensuring Exceptional Customer Service • Provides services that are above and beyond for customer satisfaction and retention. • Improves service by communicating and assisting individuals to understand guest needs, providing guidance, feedback, and individual coaching when needed. • Sets a positive example for guest relations. • Empowers employees to provide excellent customer service within guidelines. • Handles guest problems and complaints seeking assistance from supervisor as necessary. • Interacts with guests to obtain feedback on product quality and service levels. Managing Projects and Policies • Implementing the customer recognition/service program, communicating and ensuring the process. • Assists in the review of comment cards and guest satisfaction results with employees. • Ensures employees have the proper supplies and uniforms. • Assists in the use of a guest information tracking system to ensure that a successful repeat guest recognition program is in use to recognize guest preferences and aid in problem resolution. Supporting Handling of Human Resource Activities • Identifying the developmental needs of others and coaching, mentoring, or otherwise helping others to improve their knowledge or skills. • Providing guidance and direction to subordinates, including setting performance standards and monitoring performance. • Provides feedback to individuals based on observation of service behaviors. • Participates in an ongoing employee recognition program. • Conducts training when appropriate. • Participates in the employee performance appraisal process. Additional Responsibilities • Provides information to supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person. • Analyzes information and evaluating results to choose the best solution and solve problems. • Informs and/or updating the executives, the peers, and the subordinates on relevant information in a timely manner. • Performs all duties at the Front Desk as necessary. • Understands the functions of the Bell Staff, Switchboard and Concierge/Guest Services operations. • Complies with loss prevention policies and procedures. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you. JW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}