{"Job ID": "69875836", "Description": "Responsibilities:Demonstrate knowledge of cloud architecture and implementation features (OS, multi-tenancy, virtualization, orchestration, scalability).\nAct as a Subject Matter Expert to the organization for cloud/On-prem end-to-end architecture, including/ any one of AWS, GCP, Azure and future providers, networking, provisioning, and management.\nCommunicate and provide thought leadership in Data strategy, Technologies, engineering to business and IT leadership teams and stakeholders.\nProviding a vital function bridging the gap between business and technology. In partnership with Product Owner(s), Stakeholders and other Subject Matter Experts, and work with technologies such as Cloud data warehousing, Data lakes, Analytical platforms and solutions. \nShould be able to define modern data eco system, considering current and futuristic data needs.\nWork closely with all business areas to capture BI (Business Intelligence, Data Analytics and Reporting) requirements based on business objectives, initiatives, challenges and questions.\nTranslate user stories into wireframe designs of the dashboards.\nProvide BI / reporting on all the identified KPI areas specified in the KPI requirements document by creating, developing and maintaining BI reports in visualization tools such as Microsoft Power BI. The dashboards will be updated and maintained by the various business teams (self service). \nShould be able to cover astatic design aspects in report/dashboard design.\nProvide advice on technical aspects of BI development and integration, including the operational and maintenance aspects of systems under development, and proposed system recovery procedures.\nEnsure that relevant technical strategies, policies, standards, and practices are applied correctly.\nSupport the Reporting & Analytics team to respond positively to proposed data initiatives, arising from the Information Governance Group, and provide the necessary support and expertise to deliver such initiatives.\nProvide ongoing support and implementation of change for the ETL solution interfacing between the applications.\nApply enterprise data management practices and principles in ways of working.\nIdentify patterns, trends and insight through use of the appropriate tools.\nIdentify data quality issues through data profiling, analysis and stakeholder engagement.\nAnalyze data to provide insights for internal and external stakeholders  on improving the performance.The Role offers:Opportunity to join a global team to do meaningful work that contributes to global strategy and individual development. \nAn outstanding opportunity to re-imagine, redesign, and apply technology to add value to the business and operations.Essential Skills:Hands-on-experience in delivering business intelligence solutions.\nHands-on-experience with OLTP and OLAP database models.\nExpertise in end to end (data base + ETL /pipeline + Visualization Reporting) on one of the Cloud or Cloud Agnostic Azure: Synapse, ADF, HD Insights.\nExpertise in areas of data governance, advanced analytics on premise platform understanding covering one or more of the following skills Teradata, Cloudera, Netezza, Informatica, DataStage, SSIS, BODS, SAS, Business Objects, Cognos, MicroStrategy, WebFocus, Crystal.\nProgramming: Write computer programs and analyze large datasets to uncover answers to complex problems. \nFluent in relational database concepts and flat file processing concepts.\nMust be knowledgeable in software development lifecycles/methodologies i.e. agile.\nData storytelling: Communicate actionable insights using data, often for a non-technical audience.\nBusiness intuition: Connect with stakeholders to gain a full understanding of the problems they are looking to solve.\nAnalytical thinking. Find analytical solutions to abstract business issues.\nCritical thinking: Apply objective analysis of facts before concluding.\nInterpersonal skills: Communicate across a diverse audience across all levels of an organization.\nHas strong presentation and collaboration skills and can communicate all aspects of the job requirements, including the creation of formal documentation.\nStrong problem solving, time management and organizational skills.\nDatabase Technology: SQL Server, Netezza, Hadoop, Cloudera.\nETL Technology: SSIS, DataStage, Talend, CRON scripting, Perl.\nBI Technology: SSRS, SSAS, Tableau, MicroStrategy.\nCloud SaaS:  Snowflake, Databricks, Matillion, HVR, etc.\nFamiliarity in Data Engineering tools, data ops tools in On-prem and Cloud eco system.\nGood to have certifications in Togaf, PMP, CSM.Essential Qualification:BE or Btech in Computer Science, Engineering, or relevant field.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}