{"Job ID": "69873115", "Description": "The Model/Anlys/Valid Intmd Anlyst is a developing professional role. Deals with most problems independently and has some latitude to solve complex problems. Integrates in-depth specialty area knowledge with a solid understanding of industry standards and practices. Good understanding of how the team and area integrate with others in accomplishing the objectives of the subfunction/ job family. Applies analytical thinking and knowledge of data analysis tools and methodologies. Requires attention to detail when making judgments and recommendations based on the analysis of factual information. Typically deals with variable issues with potentially broader business impact. Applies professional judgment when interpreting data and results. Breaks down information in a systematic and communicable manner. Developed communication and diplomacy skills are required in order to exchange potentially complex/sensitive information.\nModerate but direct impact through close contact with the businesses' core activities. Quality and timeliness of service provided will affect the effectiveness of own team and other closely related teams.\nResponsibilities:\nDevelops, enhances, and validates the methods of measuring and analyzing risk, for all risk types including market, credit and operational. Also, may develop, validate and strategize uses of scoring models and scoring model related policies.\nSupports the design, development, delivery and maintenance of best-in-class Risk programs, policies and practices for Risk Management.\nReviews institutional or retail analytics and Models and other documents to ensure compliance with various regulatory and legal requirements.\nIdentifies potential risks and escalates for further review.\nHandles preliminary investigations, assists with reconciliation procedures and prepares routine correspondence.\nCreates and maintains reports for control, tracking, and analysis purposes and ensures appropriate and secure retention of documents.\nWorks with more senior staff in investigating and responding to customer and operational complaints.\nInteracts and works with other areas within Risk Management, as necessary.\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.\nQualifications:\nUnderstanding of Loss Forecasting Models w.r.t CCAR/CECL/IFRS9\n2-5 years experience\nProficient in SAS, Microsoft Office with an emphasis on MS Excel\nConsistently demonstrates clear and concise written and verbal communication skills\nSelf-motivated and detail oriented\nDemonstraed project management and organizational skills and capability to handle multiple projects at one time\nEducation:\nBachelor’s/University degree or equivalent experience-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}