{
    "Job ID": "69875892",
    "Description": "Confiz is in search of an Azure Infrastructure Specialist to work closely with clients, designing and implementing Azure solutions, ensuring security and compliance, and optimizing infrastructure for peak performance and cost-efficiency. Elevate your career by promoting DevOps practices, conducting regular testing, and offering valuable training sessions to both clients and internal teams. Join us in shaping the future of Azure excellence!Key Responsibilities:Collaborate with clients to understand their business needs and goals.\nDevelop Azure cloud strategies and architecture designs that meet client requirements.\nProvide expertise on cloud adoption, migration, and integration strategies.\nDesign, implement, and manage Azure-based infrastructure solutions tailored to clients' needs.\nCreate and maintain Infrastructure as Code (IaC) templates using Azure Resource Manager (ARM) templates, Terraform, or other relevant tools.\nImplement robust security measures and compliance controls in Azure environments.\nEnsure adherence to industry standards and regulations, such as CIS and GDPR.\nAssess clients' existing on-premises or cloud environments for migration to Azure.\nOptimize Azure resources to improve cost-efficiency and performance.\nDevelop automation scripts and workflows for Azure infrastructure provisioning and management.\nPromote DevOps practices and CI/CD pipelines to enhance client projects.\nImplement monitoring and alerting solutions to proactively identify and resolve issues.\nProvide ongoing support and troubleshooting for Azure-related challenges.\nDesign and implement high availability and disaster recovery solutions for critical Azure workloads.\nConduct regular testing and documentation of DR plans.\nMaintain comprehensive documentation of Azure solutions, configurations, and best practices.\nOffer training and knowledge sharing sessions to clients and internal teams.Requirements:Bachelor's degree in computer science, information technology, or a related field (or equivalent work experience).\nExtensive experience as an Azure Cloud Consultant or similar role.\nMicrosoft Azure certifications (e.g., AZ-104, AZ-303, AZ-304) preferred.\nIn-depth knowledge of Azure cloud services, architecture, and security.\nProficiency in scripting and automation using PowerShell, Azure CLI, or other relevant tools.\nFamiliarity with Infrastructure as Code (IaC) principles and tools.\nWorking experience of On Premise to Cloud migrations\nStrong analytical, problem-solving, and communication skills.\nAbility to collaborate effectively with clients and cross-functional teams.We have an amazing team of 550+ individuals working on highly innovative enterprise projects & products. Our customer base includes fortune 5 retail and CPG companies, leading store chains, fast growth fintech and multiple Silicon Valley startups.What makes Confiz stand out is our focus on processes and culture. Confiz is ISO 9001:2015 certified. We have a vibrant culture of learning via collaboration and making workplace fun.People who work with us work with the cutting-edge technologies while contributing success to the company as well as to themselves. To know more about Confiz Limited, visit: https://web.facebook.com/lifeatconfizJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}