{"Job ID": "69873829", "Description": "Associate Manager-(2300017214)Job:OperationsPrimary Location:Asia-India-BangaloreSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 10:36:04 AMUnposting Date:OngoingThe Role ResponsibilitiesStrategyLiving Groups values and ensure adherence to the Groups GCOC. Work on handling financial reconciliation and investigation of CPBB customers wherever Standard Chartered provides service.BusinessUndertake processing and decision making as per the Department Operating Instructions (as related to area of responsibility) and within the timeliness and accuracy standards specified. Functioning as Responsible Person (as per Operational Risk Management and Assurance Model), to undertake periodic self-assessment on key controls to assess the proper functioning and adequacy of existing controls; to assist in coordinating, facilitating and promoting understanding of operational risk and in implementation and management of OR within the Unit.\nTo maintain all required controls and procedures as detailed in DOI.\nAdhere to Operational Risks plus Legal and Compliance requirements as instructed by Manager / Senior Manager / AVP, etc.\nMaintain a positive working relationship with personnel of other Units / Divisions of the Bank.ProcessesUphold the values of the Group and Company at all times.\nComply with all applicable rules / regulations and Company and Group Policies.\nContribute to efficient functioning of the Unit.\nContinuously improve in productivity to the standards prescribed for the process from time to time.\nFamiliarize with Group Operational Risk, Group Money Laundering Prevention and other Policy and Procedures to the extent applicable.\nEnsure team performs error free reconciliation and investigation as per procedures and DOIs / Reconciliation Policy using reports from various necessary applications.\nEffectively reducing the error rate and adherence to all controls and checks.\nHandle customer queries and correspondence (both internal and external) and maintain effective working relationships with all departments including IT / IS.\nEnsure effective follow ups and escalations, both internal and external, in resolving outstanding items and all process and system issues, strictly as per agreed SLA / matrices / DOI.\nAssist Manager / Senior Manager for process mapping and automation / improvement efforts.\nAssist Managers in testing and take over activities for new processes; Senior Managers in efforts towards achieving the same.\nMaintain and update site-specific process notes, and matrices covering authorised personnel for recon-related queries, escalation contacts, sending reports, mailing lists for all reports and broadcasts, etc.\nAssist Manager / Controls team in obtaining positive confirmation of the matrices at the frequency as specified in the DOI.\nEnsure adherence to all SLAs and proper updation of all logs such as time updation, system downtime and exceptions log.\nAssist in updation and implementation of Business Continuity Planning (BCP) documents and tests.\nUndertake any activity as may be advised by Line Manager, Senior Manager or Head, GBS in line with DOI.\nMaintain Learning Development Plan (LDP) and ensure participation in training programs organized within the department, by the concerned Training Team / OL.\nAct as authorized person for GBS archives and records with M/s Crown Archival Agency Follow up and maintain proper records of archived documents.\nEffective Cost Control of the Team + Unit as a whole and aim for reduction on an ongoing basis.\nReadiness for Audits - External / Internal.\nContribute to increasing productivity of the Team.\nWork to reduce System Downtime.\nContribute to projects at Department and Group level.\nWork to reduce Overtime in the Team.\nAssist updation of PRA.\nClean desk policy and 6s. Drive 6s within the department, in the process deriving results of efficiency through saving time, energy and cost.\nTo identify and report all exceptions on non compliance with standard controls.\nTo identify and report all weaknesses inherent in the standard controls.\nDelegation of authority as applicable will be issued depending on the Roles and responsibilities handled.People and TalentHandle people issues and ensure standards on group as adhered.Risk ManagementUndertake processing and decision making as per the Department Operating Instructions (as related to area of responsibility) and within the timeliness and accuracy standards specified. Functioning as Responsible Person (as per Operational Risk Management and Assurance Model), to undertake periodic self-assessment on key controls to assess the proper functioning and adequacy of existing controls; to assist in coordinating, facilitating and promoting understanding of operational risk and in implementation and management of OR within the Unit.GovernanceTo comply as per Operational Risk Management and Assurance Model.Regulatory and Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead the team to achieve the outcomes set out in the Bank’s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment].\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.Our Ideal Candidate3 - 5 years of experience with the following skillsPeopleJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}