{"Job ID": "69873055", "Description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.We welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!Job DescriptionAs a Software Engineer (SAP CRM / Web UI) and member of an Agile Capability Team, you will have the opportunity to design, develop and deploy leading edge SAP CRM based solutions that will deliver value to our customers. The team leverages multiple technologies including SAP CRM, SAP ECC, and SAP Fiori to deliver these new innovative solutions.Key Responsibilities:\n Business Requirements Analysis\nCollaborates with product owners and stakeholders to ensure understanding of business priorities\nCreates and executes required test scenarios/plans to ensure complete testing on all new and changed components\nHelps to create a culture of openness, honesty, and transparency\nCollaborates with capability team to build an agile culture in teams.\nIdentify design problems and devise usable solutions.\nBuilds strong relationships with technical and non-technical stakeholders across the organization\nDesign Mock-ups based on Business Requirements\nDevelop, test, debug, and implement SAP CRM applications by working closely with functional and testing teams\nPartner with functional team to understand business requirements and prepare technical design specifications for applications.\nProvide advanced problem-solving and technical support, including on-call support for SAP CRM Applications\nFollow established patterns, framework, and procedures to develop and enhance Fiori Applications\nAssist other SAP ABAP Developers as needed in relation to BOL web development and Fiori\nContribute ideas to improve utilization of SAP technologies and programming currently being used.\nParticipate in road map activities in the assessment of emerging technologies.\nEnsures that third-party applications and products are customized to deliver a consistent end-user experience\n Basic Qualifications:Bachelor’s Degree or equivalent relevant experience\n4+ years’ experience with SAP CRM development in a professional environment\nStrong English speaking and writing skills\nGood understanding of CRM configuration and app integration\nExperience in OData Service consumption on UI using GET, PUT, POST methods\nExtensive experience in ABAP Development\nExperience in SAP CRM Web UI configuration and customizing and BOL programming\"\nKnowledge of SAP Business Technology Platform (BTP) tools and deployment of application on BTP is a plus\nExcellent analytical and problem-solving skills for design, creation and testing of programs.Preferred Qualifications :Bachelor’s Degree in Computer Science, Engineering, or similar technical discipline\nExperience in systems development lifecycle\nExperience with Agile development methodologies\nIntellectual curiosity and the ability to question thought partners across functional areas.\nAbility to adapt quickly to new technologies and changing business requirements.\nSolid problem-solving skills, attention to detail, and critical thinking abilities\nExcellent understanding of business complexity and project interdependencies\nAbility to partner with multiple stakeholders and influence project decisions.\nStrong teamwork, customer service and organizational skillsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}