{
    "Job ID": "69873468",
    "Description": "Job Number 23167895 Job Category Reservations Location The Westin Hyderabad Mindspace, Raheja IT Park, Hitec City, Hyderabad, Telangana, India VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Management JOB SUMMARY Responsible for soliciting and managing of reservations sales-related opportunities. Manages and provides training and work assignments to Reservations Sales staff. Actively up-sells each business opportunity to maximize revenue opportunity. Achieves personal and team related revenue goals. Responsible for driving customer loyalty by delivering service excellence throughout each customer experience. Provides service to our customers in order to grow share of the account on behalf of the company. CANDIDATE PROFILE Education and Experience • High school diploma or GED; no work experience required. OR • 2-year degree from an accredited university in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 2 years experience in the sales and marketing, guest services, front desk, or related professional area. CORE WORK ACTIVITIES Understanding Markets & Maximizing Revenue • Identifies new reservations sales business to achieve personal and property revenue goals. • Understands the overall market, including competitors’ strengths and weaknesses, economic trends, supply and demand etc. and knows how to sell against them. • Closes the best opportunities for the property based on market conditions and property needs. • Monitors same day selling procedures to maximize room revenue and control property occupancy. • Gains understanding of the property’s primary target customer and service expectations; serves the customer by understanding their business, business issues and concerns, to offer better business solution. Conducting Daily Reservations Sales Activities • Responds to incoming reservations sales opportunities for the property that are outside parameters of the . • Uses negotiating skills and creative selling abilities to close on business and negotiate contracts. • Uses sales resources and administrative/support staff effectively. • Assists in monitoring group reservation forecast data. • Coordinates with sales and Convention Services to process rooming lists and reservation cards. • Executes and supports the operational aspects of business booked (e.g., generating proposal, writing contract, customer correspondence). • Assists with monitoring accuracy of reservation sales orders within tracking systems. • Tracks no-show reservations and processes charges as needed. • Checks daily arrivals to ensure all necessary billing instructions are applied to reservations. • Manages wait list and prioritizes order of wait list contacts to be made. • Prepares work and maintenance orders. Providing Exceptional Customer Service • Supports customer loyalty and property’s brand standards by delivering service excellence throughout each customer experience. • Services our customers in order to grow share of the account. • Provides excellent customer service consistent with the daily service basics of the brand. • Executes exemplary customer service to drive customer satisfaction and loyalty by assisting the customer and ensuring their satisfaction before and during their program/event. • Sets a positive example for guest relations. • Executes exemplary customer service to drive customer satisfaction and loyalty by assisting the customer and ensuring their satisfaction before and during their program/event. • Serves the customer by understanding their needs and recommending the appropriate features and services that best meet their needs and exceed their expectations, while building a relationship and loyalty to the company. • Handles guest complaints and disputes following the instant pacification procedures. Managing and Conducting Human Resource Activities • Monitors reservations sales agents while on phone calls. • Develops, implements and maintains a departmental orientation program for employees to receive the appropriate new hire training to successfully perform their job. • Utilizes all available on the job training tools for employees. • Creates monthly labor scheduling for team. Additional Responsibilities • Utilizes applicable intranet for resources and information. • Creates contracts as required. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. At Westin, we are committed to empowering guests to regain control and enhance their well-being when they need it most while traveling, ensuring they can be the best version of themselves. To achieve the brand mission of becoming the preeminent wellness brand in hospitality, we need passionate and engaged associates to bring the brand’s unique programming to life. We want our associates to embrace their own well-being practices both on and off property. You are the ideal Westin candidate if you are passionate; you are active and take pride in how you maintain your well-being; you are optimistic; you are adventurous. Be where you can do your best work, begin your purpose, belong to an amazing globalteam, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}