{"Job ID": "69873445", "Description": "MEDICAL SCIENCE LIAISONWe are looking for a Medical Science Liaison to be employed in Medical Department, based in Istanbul with the following qualifications;University degree from Medicine or Pharmacy.\n\nFluent in Turkish & English\n\nNo travel restriction, intensive travel is anticipated.\n\nStrong communication skills that include verbal, written and public presentations.\n\nAbility to comprehend and interpret clinical and pre-clinical data.Job DescriptionEngaging with key thought-leaders, Health Care Professional, Regional/local institutions and organizations in the territory through appropriate high level scientific interaction .\n\nTaking active role for training, research, publication, consultancy and other Medical Affairs initiatives.\n\nEnsuring effective two-way communication across multi-functional teams in carrying out Medical Affairs strategy.\n\nProviding comprehensive medical and scientific support in the company.\n\nTaking an active role as Sanofi' \"Scientific Ambassador”.What Sanofi Can Offer YouBenefits to enhance your life journey\n\nDevelopment opportunities to own your future\n\nAn open and inclusive environment where you can be yourself\n\nSocial activities and wellbeing programs to support your lifeWe chase the miracles of science to improve people’s lives.We are Sanofi, an innovative global healthcare company. We chase the miracles of science to improve people’s lives.  Our team, across some 100 countries, is dedicated to transforming the practice of medicine by working to make the impossible into the possible. We provide potentially life-changing treatment options and life-saving vaccine protection to millions of people globally, while putting sustainability and social responsibility at the center of our commitments.We are one of the largest pharmaceutical companies in Turkey, serving public health for with more than 1,600 employees. Adding value to local economy and development in Turkey, we offer a broad range of products including innovative therapeutic solutions, biotechnological pharmaceuticals, vaccines, and consumer healthcare products.Our factory in Lüleburgaz is one of the leading pharmaceutical manufacturing plants in Turkey. It is also among the top three Sanofi production sites worldwide in terms of its manufacturing capacity. Our manufacturing site, produces high-quality pharmaceuticals in many different forms in accordance with global health standards, and develops generic medicine at its on-site R&D Center.Pursue progress.Discover extraordinary. Better is out there. Better medications, better outcomes, better science. But progress doesn’t happen without people - people from different backgrounds, in different locations, doing different roles, all united by one thing: a desire to make miracles.So let’s be those people.Let’s explore more, and share a purpose, as well as our skills. Let’s reinvent healthcare, chase change, and embrace new ideas. Let’s take bigger risks and find better solutions for the people we help.Let’s pursue progress.And let’s discover extraordinary, together.At Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}