{"Job ID": "69872589", "Description": "Company overview: Caring for the world, one person at a time, encourages and unites the people. We welcome innovation—bringing ideas, products, and services to life to advance the health of the people around the world. We believe in collaboration, and that has led to breakthrough after breakthrough, from medical miracles that have changed lives, to the simple consumer products that make every single day a little better. Our over 125,000 employees in 60 countries are united in a common mission: To help people everywhere live longer, healthier, happier lives. In India, J&J operates as a single legal entity and consists of the 3 strategic business units: Consumer Products, Pharmaceuticals, and Medical Devices, which are independently handled and report to their respective Global business segmentsPHARMA: Janssen, the pharmaceutical division of Johnson & Johnson, is dedicated to addressing and solving some of the most important unmet medical needs of our time in India, in oncology, immunology, neurosciences & analgesia, dermatology, infectious diseases, and metabolic diseases in India. Driven by a strong commitment to health and well-being of patients, Janssen India brings innovative products, services, and solutions to people throughout the world. Janssen recognizes the impact of serious conditions on people’s lives and strives to empower people through disease awareness, education, and access to quality care in six therapeutic areas.Johnson & Johnson companies are equal opportunity employers - The Global Job Posting policy promotes the dedication to the advancement and development of our employees. We invite you to read this posting and apply if you are willing about the position and meet the requirements.Position Summary: You will be accountable in assigned territory, maintaining effective customer relations, mapping territory potential, cascading science behind brands with benefits of brands, and collaborating with Health Care Practitioners.Job Title: Associate District Manager\nDepartment: Sales\nJob Location: VIJAYAWADA\nReporting to: Area Business ManagerTherapy to Handle: Mass Markets .Job ResponsibilitiesDrives business growth by delivering on budgeted sales objectives while adhering to organizational policies and interest in implementing the role as per supervisory mentorship\nReviews and discusses their plans for the achievement of their territory's sales budget each month. Seeks ASM/RBM mentorship in formulating sales strategy.\nSchedules the frequency of calls to the doctors regarding company products. Rigorously adheres to coverage plan and frequency.\nMaps potential of the territory and relates it to market trends and competitors’ activities\nProfiles, assess potential, prepares target list, and enlists new doctors as per business requirement. Plans and prepares interventions to work with new doctors.\nAchieves daily call average for meetings with doctors and chemists\nBooks orders from the retailers/Distributors to ensure adequate availability to meet the market demand.\nEnsures Pre-call planning for an effective outcome from HCPs\nBuilds consistent, long-term relationships with Key Opinion Leaders/Key Business leaders by involving them in scientific engagements at regular intervals and through effective coverage at the right frequency\nIn consultation with medical affairs team, caries out and plans for conducting scientific activities team such as continuous medical education marketing campaigns from time-to-time service listed HCPs in prescribed territory\nCollects and submits stocks and sales statements and other required documents in a timely and accurate manner, Participates in RCPA (Retail Chemist Prescription Audit) to identify potential customers\nPrepares and sends daily reports electronically on their day-to-day activities mentioning in detail doctors’ and chemists’ call details and reports the same to Area Business Manager.\nUse Technology developments for effective field operations.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Vijayawada, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}