{"Job ID": "69873491", "Description": "JOB DESCRIPTIONProcurement Strategy & Insights Asst Manager – Procurement Market InsightsJob level:                       WL1DSchedule:                      Full timeLocation:                       IndiaFunction:                       Procurement, Supply ChainTravel:                             Yes, 10% of time based on needABOUT PROCUREMENTPart of the Supply Chain’s family, Procurement is responsible for over 30B Euro of material and services spend globally with more than 50,000 suppliers. Getting the right services and materials, sustainably sourced and ensuring responsible procurement is critical to ensuring our brands with purpose grow. Our teams work closely with the business to understand brand needs, bring supplier innovation to meet changing consumer needs and drive financial value for Unilever through competitive buying. We’re at the forefront of digital procurement, bringing new tools and analytics to drive data-based decisions.With over 1400 employees globally, we support a network of thousands of suppliers, more than 1.5 million smallholder farmers who in turn support communities of over 7 million people. Our strategy is ‘Procurement with Purpose’ and focuses on buying responsibly, buying better and growing together with partners around the world and we have an ambition that is based on three key drivers: Being Purpose-Led, Value-Driven and Future-Fit.Procurement’s has several hubs/locations for strategy & insights, purpose & partnerships, and the global sourcing teams, which integrate with the market teams around the globe.PROCUREMENT STRATEGY & INSIGHTSThe Procurement Strategy & Insights Team is a newly formed team, serving as the nerve centre of the Unilever global procurement organization, enabling the procurement organization to design and deliver step-change across value chains, operating processes and tools, and business models. With vision of Translating Knowledge & Data into Future Fit Procurement Strategy & Insights, this team is responsible for:  Sensing, incubating, and enabling innovative ideas, new business models, and transformation programs for disruptive value creation across procurement teams\nCreating and implementing standardized processes and data-driven decision making to ease operating effectiveness and drive better and faster outcomes\nDeveloping and enabling procurement strategies with respective network VPs and portfolio and market teams based on strategic insights\nIdentifying, scaling, and spreading best practices across the global procurement organization, within and across teams\nFacilitating rapid learning, capability development, and future-fit upskilling of our peopleMAIN JOB PURPOSEMember of Procurement Strategy & Insights – PMI (Procurement Market Insights) team. The goal of the role is to adopt Buying Competitiveness measurement with enriched data and robust mechanisms, as the main procurement KPI for business, and build world class competitor insights to empower competitive buying process. This will require the role to create new capabilities and way of working in the organization and to operationalize PMI providing structured Market Intel and measuring performance for ProcurementKEY INTERACTIONSThe Procurement Strategy & Insights Asst Manager will interface with the following stakeholders:UPLT members & PCLF\nFinance Directors for BG and BUs\nProcurement Finance VP and teams\nHead of Global Procurement Strategy & Insights\nBusiness Group Leadership teams, Business Group Procurement Director\nPortfolio procurement teams\nKey suppliers and agencies/partners, subscription providers\nIndustry and insights resources, data providersKEY ACCOUNTABILITIESDevelop and drive Procurement Market Insights (PMI) Program as one of the key Lighthouse programs, steered by Chief Procurement Officer.\nBe the independent source of Buying Competitiveness performance measurement, as the leading Procurement performance indicator for the Business.\nSit in BG/BU meetings and lead Buying Competitiveness agenda, provide insights and recommendations from competitor benchmarking and monitoring programs.\nDiscover value opportunities to improve Buying Competitiveness and convert into action plans.\nBuild PMI capabilities including material trade data master database to cover material and market as much as possible and build structured Market Intelligence/Research/Survey based on key materials in key markets covering key competitors, develop and model new methodologies to measure buying competitiveness in markets with limited transparency or availability of data.\nRun key programs under PMI that will be confidential in nature and report regularly on progress and budget usageLEADERSHIP BEHAVIORSHigh Growth mindset & Consumer Love\nPartnerships management with consultancies and data providers\nStrategic, Systemic Thinking & Entrepreneurial\nStrong influencing skills to stakeholders\nChange management and transformation mindset, hunger for new challenge and getting better\nGood data literacy, data modelling and analytical skills\nHigh Initiative, quick learner, and self-starterSKILLS & EXPERIENCE REQUIREDPreferred 5-8 years’ experience in Procurement, Market Research or external facing roles in Unilever / FMCG industry\nConsulting experience in Tier 1-2 consulting firms would be a plus\nStrong business and commercial acumen\nStrong data and statistics modelling and analysis skills with strong willingness to embrace new initiatives. Able to translate data into insights and input into digital tools\nAble to comfortably operate in Excel, powerpoint, Power BI and new analytical platforms\nSolutions oriented, results driven and a self-starter with the ability to also work in a team setting and can build relationships with internal and external stakeholders\nHas a good understanding of Agile principles, values, methodologies and practices that enable agility and approaches delivery with an iterative and incremental (test - do – learn) approach\nExperience of working in cross-functional teams within a matrix environment – both F2F and virtually\nPreferred location is AsiaJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}