{"Job ID": "69873331", "Description": "Lear, a global automotive technology leader in Seating and E-Systems, enables superior in-vehicle experiences for consumers around the world. Lear’s diverse team of talented employees in 37 countries is driven by a commitment to innovation, operational excellence, and sustainability. Lear is Making every drive better™ by providing the technology for safer, smarter, and more comfortable journeys. Lear, headquartered in Southfield, Michigan, serves every major automaker in the world and ranks 189 on the Fortune 500. Further information about Lear is available at lear.com or on Twitter @LearCorporation.Position overview:Our future production planner will analyze & prepare the production plan, manage and improve the production Planning & customer performance (spare part, serial, prototype), and maintain 100% customer satisfaction.Additional duties will include (but may not be limited to):Plans production in accordance with customer needs in terms of date and quantity and SDOH\nPredefined taking into consideration transport times.\nPlans on a system according to the needs and capacity of families\nParameterization of system references\nEstablishes the production schedule\nKanban Lot declarations\nProvide necessary information for Daily briefing\nMonitors the progress of production and adjustment of planning if necessary\nScheduling and launching of manufacturing orders\nComply with health, safety, and environmental rules according to the seven key elements and ISO 14001\nIt supports the activities of the environmental management systemRESPONSIBILITIES FOR THE QUALITY AND ENVIRONMENT SYSTEM Actively collaborate with all functions to achieve/maintain the following certifications.\nIATF 16949.\nISO  14001. :2015To be a success in this role you must have:Bac + 5 in Supply chain management or equivalent.\nMinimum one year of experience in a similar function\nSupply Chain Management\nProduction management\nKnowledge in Excel & Macro\nFrench/English: Advanced Level.Work location:Kenitra ES plant#LI-KE2Lear Corporation is an Equal Opportunity Employer, committed to a diverse workplace.Applicants must submit their resumes for consideration using our applicant tracking system. Due to the high volume of applications received, only candidates selected for interviews will be contacted. Unsolicited resumes from search firms or employment agencies, or similar, will not be paid a fee and will become the property of Lear Corporation.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kenitra, Morocco", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}