{"Job ID": "69875839", "Description": "Responsibilities:Understand requirement and translate that to product features.\nParticipate in Scrum meetings and express the work done and the plan clearly. Participate in scrum ceremonies and clearly communicate.\nLead an agile team and provide technical guidance. Participate in customer call and drive technical discussions\nWork on application design\nShould have microservices exposure and development of services and hosted in cloud\nDevelop applications using Front end, middleware, and database related technologies.\nShould be hands in developing and implementing best practices and write smart piece of code.\nCoding standard should be followed, and the code should be highly performant.\nShould be able to write unit test cases using any of the frameworks and should be completely automated.\nShould have strong exposure in REST API design and principles and adhere to RAML/Swagger or Open API specification\nShould be able to develop reusable components using proper design patterns as listed by lead/architect so that it is extensible.\nShould be able to use design patterns and implement the right solution.\nShould be able to do code review and implement automation wherever required to ease development process.The Role offers:An outstanding opportunity to re-imagine, redesign, and apply technology to add value to the business and operations.\nAn end-to-end project exposure across multiple technical stack and cloud platform\nAn individual who has passion to learn and adapt to new technologies quickly and scale to next level easily.\nHigh visibility, opportunity to interact with multiple groups within the organization, technology vendors and implementation partners.\nWork in high end and latest technologies\nWork in cloud platform like AWS ServicesEssential Skills:In-depth knowledge in core Java, REST, Hibernate, AWS App Development.\nHands-on-experience in spring boot\nHands-on-experience in developing Microservices and docker.\nHands-on-experience in serverless architecture and exposure using AWS Lambda/Azure Functions\nExpertise in using AWS PaaS services like storage, Queues, Database, security. It could be the following in AWS and Auzre\nHands-on-experience in working in any of the cloud platforms like Azure or AWS – App development Services, Integration Services, API Management. etc.\nAWS: SQS, SNS, Lambda, Step Function, API Gateway,  Dynamo DB, ECS, EC2, Load Balancer, Secrets manager\nHands-on-experience in RESTful Http services design\nExpertise in designing applications and applied design patterns\nHands-on-experience in Java script, JQuery, Bootstrap, Html 5, CSS3\nHands-on-experience with SQL Server, Postgre SQL writing stored procedures, performance tuning and identifying deadlocks, transactions and data locking/blocking scenarios\nGood communication and unit testing knowledge.\nWork experience in frameworks like JPA, Struts/Spring MVC, Spring Core, Spring AOP, and Spring Data\nFamiliar with Continuous Integration methodologies and tools, including Jenkins\nGood to have: Exposure to Docker Containerization_Cloud, Kubernetes_Cloud , UI FrameworksEssential Qualification:MCA/equivalent master’s in computers is a must.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}