{
    "Job ID": "69875345",
    "Description": "Some careers have more impact than others.If you’re looking for a career where you can make a real impression, join HSBC and discover how valued you’ll be.HSBC is one of the largest banking and financial services organizations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realize their ambitions.We are currently seeking an experienced professional to join our team in the role AVP Collections Ops. Principal responsibilities:The AVPO would be required to lead and manage the management teams to meet set performance targets as agreed with the business partners. \nManages increased spans of control and has direct oversight responsibility for a Region/Business/Country/Process, and /or is the senior collections manager  for the Global Function at a site level.\nAssigned/delegated responsibilities  and or authority from VP  over and above line management day to day responsibilities.\nLeads special projects/initiatives under direction of VP/Head of Ops Support or Head of Collections – GSC\nProvides training/mentoring for peers as as requested\nPerforms as acting VP as needed\nManages relationships and enages with Business Partner as primary Relationship Manager\nResponsible for ensuring all migrations of work into the GSC are successfully achieved with appropriate staff, equipment and office requirements being in place in accordance with agreed schedules and Service Level Agreements.\nResponsible for developing a climate in which creativity thrives and in which process quality and productivity are continuously improved.\nThe  AVPO is required to deliver the M3 responsibilities as outlied in the Collections Target Operating Model.\nEnsure agreed migrations / re-migrations are effectively implemented in liaison with the Project managers and business managers.\nMotivate and develop team members across sections including specific attention to individual development or action plans as required to achieve business objectives and manage future growth of GSC’s.\n Assistant Manager Operations are regularly briefed and made aware of individual/department performance achievements/targets.\nProvide strategic direction to Assistant Managers to improve delivery on agreed service level agreements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}