{"Job ID": "69873583", "Description": "Sanofi New Gen-Future Leaders ProgramSanofi New Gen Program is designed to discover and develop future Sanofi leaders through various experiences in different functions and business units.  Selection will be based on candidate’s openness for different experiences within Sanofi and also assessment results. Successful candidates will join the program as “Sanofi New Gen.”As a Sanofi New Gen, you will rotate in various functions within Sanofi for 3-6 months. Following the 18 months rotation program, you will land on your permanent position that matches your preference and your strong suits as per demonstrated skills. In addition to the comprehensive rotation program; your development will be supported with formal trainings and involvement in execution and management of projects.Requirements & QualificationsBachelor’s or Master’s Degree\n\nNew graduates or professionals with up to 2 years of experience are encouraged to applyOther required skillsExcellent command of both written and spoken English& Turkish\n\nAbility to quickly grasp various job functions and successfully add value\n\nBe involved in many different projects and manage / contribute to their success\n\nTry to offer improvements in department’s way of work, aiming to innovate and challenge current situation\n\nBased on observation in rotation departments, bring a project to life from scratch\n\nBuild a well-rounded set of capabilities that will take New Gen a step forward to be prepared for future leadership roles within the organization\n\nExcellent command of MS Office Programs\n\nStrong analytical and planning skills\n\nStrong communication and collaboration skills\n\nPassion for developing self through various experiences in different corporate functions\n\nCan-do attitude and passion for team-playTerms of EmploymentThis full-time position does not have people management responsibility.\n\nThere might be some travel required for this position.What Sanofi Can Offer YouDevelopment opportunities to own your future\n\nAn open and inclusive environment where you can be yourself\n\nSocial activities and wellbeing programs to support your life\n\nA unique journey with diverse functions and multicultural teamsWe chase the miracles of science to improve people’s lives.\nWe are Sanofi, an innovative global healthcare company. We chase the miracles of science to improve people’s lives. Our team, across some 100 countries, is dedicated to transforming the practice of medicine by working to make the impossible into the possible. We provide potentially life-changing treatment options and life-saving vaccine protection to millions of people globally, while putting sustainability and social responsibility at the center of our commitments. We are one of the largest pharmaceutical companies in Turkey, serving public health for with more than 1,600 employees. Adding value to local economy and development in Turkey, we offer a broad range of products including innovative therapeutic solutions, biotechnological pharmaceuticals, vaccines, and consumer healthcare products. Our factory in Lüleburgaz is one of the leading pharmaceutical manufacturing plants in Turkey. It is also among the top three Sanofi production sites worldwide in terms of its manufacturing capacity. Our manufacturing site produces high-quality pharmaceuticals in many different forms in accordance with global health standards, and develops generic medicine at its on-site R&D Center.\nPursue progress.\nDiscover extraordinary.\nBetter is out there. Better medications, better outcomes, better science. But progress doesn’t happen without people - people from different backgrounds, in different locations, doing different roles, all united by one thing: a desire to make miracles.\nSo let’s be those people.\nLet’s explore more, and share a purpose, as well as our skills. Let’s reinvent healthcare, chase change, and embrace new ideas. Let’s take bigger risks and find better solutions for the people we help.\nLet’s pursue progress.\nAnd let’s discover extraordinary, together.\nJoin a health journey partner.\nLife is a health journey, with its ups and downs, and its challenges. These can be big or small, lifelong or temporary. Everyone, from children to elderly people, face health challenges and needs, wherever they are. We at Sanofi, are dedicated to support people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.\nWith more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.\n Sanofi Turkey, one of the largest pharmaceutical companies in the country, serving public health for over 60 years with more than 1,800 employees, offers a broad range of products including innovative therapeutic solutions, biotechnological pharmaceuticals, vaccines and consumer healthcare products, adding value to local economy and development.\nOperating in the Turkish healthcare industry, Sanofi Turkey offers solutions in 16 main therapeutic areas with almost 275 different forms of products. Sanofi Lüleburgaz plant, the leading pharmaceutical manufacturing facility in Turkey, is also among the top three Sanofi production sites worldwide. Spread on a total area of approximately 50 football stadiums, the plant features state-of-the-art equipment and the latest innovations, producing highest quality pharmaceuticals in various forms in global healthcare standards and carrying out R&D activities.\nAt Sanofi, we provide a working environment in which we help people develop, cooperate with passion and care about patients and consumers.\nTHIS IS OUR SANOFI. DISCOVER YOURS\nAt Sanofi, diversity and inclusion are foundational to how we operate and embedded in our core values. We recognize the richness of diversity and inclusion, to have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.\n Come discover your Sanofi today!At Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}