{
    "Job ID": "69873027",
    "Description": "Executive AssistantAre you passionate about providing assistance and support?Do you enjoy being part of a successful team?Join our Baker Hughes Team!We develop and deploy technology to help meet the world’s demand for energy and to advance industry. We are guided by our purpose to take energy forward. Making it safer, cleaner, and more efficient for the people and the planet.Join us at Baker HughesAs a Executive Assistant, you will play an integral role in ensuring the success of our team. And do so through effective organization, prioritization and hands-on approach. By supporting our executive leadership team and managing the day-to-day functions to faciliate flawless operations.As an Executive Assistant, you will be responsible for:·Performing a variety of advanced administrative functions and support·Managing the flow of information, scheduling appointments, composing memos, creating presentations and maintaining up-to-date calendars for effective prioritization of tasks.·Coordinating logistics, domestic and international travel arrangements for the executive team to maximize time, efficiency and value.·Assisting with event management, helping to prepare for the meetings and accurately recording minutes from meetings.·Communicating with internal and external clients, coordinating internal documents submission.·Generating reports, handling multiple projects, preparing and monitoring the invoices and expense reports.Fuel your passionTo be successful in this role you will:·Have High School Diploma or equivalent and show solid experience providing executive-level support for top management.·Show ability to organize a daily workload by priorities and be able to meet deadlines in a fast-paced quickly changing environment.·Have advanced computer skills including MS Office software, knowledge of SAP is a plus.·Be highly organized, detail-oriented and discreet and be able to exercise tact and diplomacy.·Have basic accounting skills and be able to fluently speak and write in English.·Show a proactive approach to problem-solving with good decision-making skills and be a team player.Work in a way that works for youWe recognize that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too.Working with usOur people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.Working for youOur inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. We prioritize rewarding those who embrace change with a package that reflects how much we value their input. Join us, and you can expect:·Contemporary work-life balance policies and wellbeing activities·Comprehensive private medical care options·Safety net of life insurance and disability programs·Tailored financial programs·Additional elected or voluntary benefitsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}