{"Job ID": "69875332", "Description": "The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (COVID-19), we’re leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might have.Some careers open more doors than others.   If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.Wealth and Personal Banking (WPB) is our new global business combining Retail Banking and Wealth Management; and Global Private Banking, to become one of the world’s largest global wealth managers . Across Asia, where wealth pools are growing faster than in any other region, HSBC’s wealth revenues .  Our dedicated colleagues serve millions of customers worldwide across the entire spectrum of private wealth, ranging from personal banking individuals and families, through to business owners, investors and ultra-high-net-worth individuals.  We provide products and services such as bank accounts, credit cards, personal loans and mortgages, as well as asset management, insurance, wealth management and private banking that best suit our customers’ needs.If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.Role PurposeIn line with the TCF principles the organization has changed its approach from mere transaction processing outlets to need based sales. The PSE would be responsible for implementing TCF principles in his day to day dealing with the customers. The major function of this role is to ensure effective delivery of branch customer interface functions in the front office and teller areas in order to achieve a high level of customer satisfaction along with operational efficiency.Impact on the Business / FunctionContributes to improving productivity in the branch\nBranch hygiene standardsCustomers / StakeholdersEnsure positive customer experience and manage complaints / escalationsLeadership & TeamworkEstablish mutual respect and trust in dealing with othersOperational Effectiveness & ControlAdherence to overall operational standards set by the bank\nComply with the applicable laws, regulations, Group and local guidelines related to Sanctions and AML policy of HSBC while undertaking various day to day operations\nRemain alert and promptly report to the Sanctions Officer/ INM FCC office/ Line manager ( As applicable and required by  the AML and sanction Policy) if a customer is found to be engaging in sanction evasion activities or violations of AML policy or any other related procedures.\nUnderstand the legal responsibility to be vigilant for unusual activity and reporting of the unusual activities\nSupport the Country or Regional FCC AML Office/ AML Investigations by providing additional information when required\nResponsible for attending and successfully completing the AML and Sanctions related assigned training in the mandated timeframe\nUnderstanding the consequences of failing to attend or successfully complete the training as mandated by the AML Education Lead FCC; \nRequesting additional AML training that you deem necessary or appropriate to perform your jobs through your entity manager\nDemonstrate an understanding of PEP acceptance, prohibition, CDD & EDD guidelines in order to ensure that the INM RBWM is fully compliant with the PEP LoBP.\nUnderstand the relatively high reputational risk that arises from any perceived weaknesses in controls in respect of substantial cash deposits or withdrawals activity, wire transfer, monetary instruments and pouch and mail\nTo be aware and Identify high risk indicators for various products and Services offered by INM RBWM example Cash, insurance, credit cards products etc\nEnsure that all records are obtained in respect of INM RBWM customers or New to bank customer for any products and services provided by HSBC are as per the process laid down.\nMust ensure that the prescribed process is being followed while dealing with non HSBC customers request for monetary instruments and wire transfers\nEnsure Adherence to the regulatory guidelines and internal AML & Sanction Policy of HSBC, which includes pouch and mail, monetary instruments, cash services and payment transparency Line of Business Procedures\nTo be aware of AML risk posed by pouch and mail, Monetary instruments, cash services and wire transfer services and should undergo the mandatory training for the same\nNecessary remediation steps need to be undertaken in case if there is any breach or non-adherence to the policy laid down in the LoBP\nMust undertake necessary due diligence to ensure that the nature of the transaction is in sync with the customer profile, else raise it to line manager for further clarification\nThe staff must be aware of the scope of services of various products and services that are offered and those which are prohibited because of the guidelines laid down in the line of Business procedures and must ensure the same is communicated to customer in a effective and polite manner\nEnsure adequate due diligence is undertaken by the Individual/team to ensure that the nature of the various transactions of wire transfer, cash services, monetary instruments are in sync with customer profileJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}