{
    "Job ID": "69873579",
    "Description": "About the job The Modelling Analyst will be involved in projects from a modelling perspective. His/Her responsibilities will start from understanding project briefs from internal stakeholders, identify analytic solutions that will answer client questions, execute them error-free and deliver results on time. The work will be heavy on data analyses, statistical modelling, and finally presenting these from a business/non-technical point of view.  As the person grows in experience, the profile will require that he/she starts carrying out the above tasks independently, contributing to building relationships with internal stakeholders, and improving our analytical solutions through R&D (Research & Development) initiatives and value-added insights. Responsibilities Execute analyses error-free and on time. \n\nManage execution of multiple analyses within project \n\nCarry out multiple standard/non-standard analyses to help build quality and insightful proposals and final insights presentations. \n\nGain a detailed understanding and develop expertise in existing analytical solutions \n\nAlways look out and experiment with different techniques/methods to improve existing solutions Help in R&D studies by carrying out analyses as planned Qualifications Postgraduate in either of Statistics, Mathematics, Economics, or Operation Research fields \n\nExcellent, clear and confident communication.  Able to work collaboratively in a team and guide junior associates. \n\nThorough understanding and working knowledge of Statistical techniques. \n\nHands-on working knowledge and experience with statistical software like Python and R. \n\nProficiency in data processing/programming tools such as R/Python/SQL About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}