{
    "Job ID": "69873166",
    "Description": "About Four Seasons Hotels and Resorts:Four Seasons Hotels and Resorts is a global, luxury hospitality company. We manage over 120 hotels and resorts and 50 private residences in 47 countries around the world and growing.  Central to our Four Seasons employee experience and social impact programming is the company’s commitment to supporting cancer research, and the advancement of diversity, inclusion, equality and belonging at Four Seasons corporate offices and properties worldwide. At Four Seasons, we are powered by people and our culture enables everything we do.At Four Seasons, we believe in recognizing a familiar face, welcoming a new one and treating everyone we meet the way we would want to be treated ourselves. Whether you work with us, stay with us, live with us or discover with us, we believe our purpose is to create impressions that will stay with you for a lifetime. It comes from our belief that life is richer when we truly connect to the people and the world around us.The Role of Manager, Creative - EMEA:We currently have an opportunity for a Manager, Creative – EMEA, to join our Four Seasons Corporate Office team in Dubai!This role reports to the Vice President, Creative and will be responsible for driving creative initiatives that resonate with the region, and you will play a pivotal role in shaping the brand’s creative direction and ensuring consistent excellence across EMEA markets.Your key responsibilities will include:Regional Creative Strategy:Develop and execute regional creative strategies aligned with the brand’s global vision\nIntegrate brand messaging, aesthetics, and storytelling within the EMEA market\nAdapt creative concepts to resonate with local relevancy while maintaining brand integrityArt Direction and Design:Provide clear direction to deliver high-quality visual and written content across various mediums\nEnsure consistency and alignment with brand guidelines\nHands-on graphic design with elevated aesthetics and tasteTeam Leadership:Lead and inspire a small team of creatives, fostering a collaborative and innovative environment\nSupport the growth and development of team members\nManage regional external venders, agencies, individual talents, etc.Our Ideal Manager, Creative - EMEA candidate will have:A bachelor’s degree in graphic design, visual communications or a related field, strong understanding of design principles and aesthetics, a minimum of 8 years of experience in a creative development/management role with a focus on the EMEA region and the ability to demonstrate understanding of region cultural nuances, market trends, and consumer preferences.We are seeking talent with an analytical mindset with expertise in leveraging performance metrics and consumer insights to inform creative decisions, a strategic mindset with the ability to develop and executive creative strategies aligned with business objectives and regional requirements, a track record of managing creative projects from concept to execution, and budget management experience, including resource allocation and vendor management.This position requires strong proficiency in Adobe Creative Suite and other relevant design software, excellent communication and interpersonal skills, the ability to collaborate and influence stakeholders globally and regional, and importantly the ability to nurture and inspire teams to deliver outstanding results.Four Seasons Hotels and Resorts can offer what many hospitality professionals dream of; the opportunity to build a life-long career with global potential and a real sense of pride in work well done. We look for talent who share the Golden Rule – people who, by nature, believe in treating others as we would have them treat us.  As Four Seasons works towards phenomenal growth in the next decade, our most valuable partners continue to be our talent, with whom we have a strong relationship based on the Golden Rule. This relationship is made tangible by the awards received year after year by Four Seasons on a corporate level, as well as by our hotels, resorts, and residences around the world, making us an undisputed “employer of choice.”Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}