{"Job ID": "69874485", "Description": "We help the world see new possibilities and inspire change for better tomorrows. Our analytic solutions bridge content, data, and analytics to help business, people, and society become stronger, more resilient, and sustainable.We are looking for a strong and motivated software developer to work as part of a team developing and implementing innovative software solutions. You will work closely with a cross-functional team of developers, QA engineers, and product owners in a fast-paced and cutting-edge environment. You will use your deep technical knowledge and experience to build robust, efficient, and performant software applications. You will always find new challenges that excite you and keep you motivated. Responsibilities: Design and develop software applications supporting business objectives.Maintain, enhance, and support existing applications.\n\nAnalyze and debug applications in development and production environments and resolve production issues within the accepted timeframes \n\nLead design and architecture meetings.\n\nServe as a liaison to internal customers, research groups, and various business support areas.\n\nParticipate in code reviews.Perform thorough Unit/Integration Testing of assigned applications.\n\nWrite technical documentation and release notes for the applications. \n\nProvide technical guidance to junior programmers and other software engineers.Bachelor’s degree or equivalent in Computer Science or a related field \n\n8-10 years of proven experience in software development and system maintenance  \n\nExperience designing and developing elegant-yet-simple systems using best practices and design patterns \n\nSolid experience and understanding in the following technologies: NET Core, C#, ASPNET Web API, ASPNET MVC, Angular, Webpack module loader, NPM, JSON/XML, LINQ, Entity Framework, IoC frameworks, CI/CD, Redis \n\nSolid understanding of CSS syntax, HTML5 specs, browser shortcomings/differences, and polyfills Solid understanding of Bootstrap/Material CSS components and how/when to use each \n\nExperience working with AWS technologies like AWS Batch, Lambda, S3, SQS, etc. \n\nExcellent understanding of object-oriented design concepts and software development processes and methods \n\nSolid understanding of parallel programming, async/await, and the TPL library \n\nHighly experienced at leading teams, interacting with business partners or customers, and guiding project direction Superior organization skills, skilled at recognizing priorities and keeping the team focused on the most important features \n\nDeveloped software in the SCRUM environment using Agile methodologies \n\nAbility to effectively work on multiple projects simultaneously and effectively contend with competing priorities \n\nMust have strong troubleshooting, code optimization, and refactoring skills \n\nAbility to learn and adapt to continuously changing technology Must have a passion for development and the latest technologies \n\nExperienced at leading a team and mentoring junior developers  \n\nExperienced at translating high-level requirements into logical tasks and identifying the technical requirements for each task \n\nExperience working with internal customers, research groups, and various business support areas Nice to haves: Designer’s eye \n\nExperience with UX patterns and ability to design complex applications \n\nExperience with CSS pre-compilers (SASS, LESS) \n\nMulti-threaded programming experience in both procedural and functional paradigms Experience with client-side optimization (GZIP, sprites, minification, obfuscation, browser caching) #LI-AV1In 2022, Verisk received Great Place to Work® Certification for our outstanding workplace culture for the sixth year in a row and second-time certification in the UK, Spain, and India. We’re also one of the 38 companies on the UK’s Best Workplaces™ list and one of 18 companies on Spain’s Best Workplaces™ list.For over fifty years and through innovation, interpretation, and professional insight, Verisk has replaced uncertainty with precision to unlock opportunities that deliver significant and demonstrable impact. From our historic roots in risk assessment, we’ve grown to provide analytic insights that help transform industries focused on some of the world’s most critical areas. Today, the insurance industry relies on Verisk to be, and to make the world, more productive, resilient, and sustainable.Verisk works in collaboration with our customers and at the intersection of people, data, and advanced technologies. Through proprietary platformed analytics, advanced modeling, and interpretation, we deliver immediate and sustained value to our customers and through them, to the individuals and societies they serve, with greater speed, precision, and scale. We’re 9,000 people strong, committed to translating big data into big ideas. We help others see new possibilities and empower certainty into big decisions that impact individuals and societies. And we relentlessly and ethically pursue innovation to help move our customers, and the world, toward better tomorrows.\n\nEveryone at Verisk—from our chief executive officer to our newest employee—is guided by The Verisk Way, to Be Remarkable, Add Value, and Innovate.\n• Be Remarkable by doing something better each day in service to our customers and each other\n• Add Value by delivering immediate and sustained results that drive positive outcomes\n• Innovate by redefining what’s possible, embracing challenges, and pushing boundariesVerisk BusinessesUnderwriting Solutions — provides underwriting and rating solutions for auto and property, general liability, and excess and surplus to assess and price risk with speed and precisionClaims Solutions — supports end-to-end claims handling with analytic and automation tools that streamline workflow, improve claims management, and support better customer experiencesProperty Estimating Solutions — offers property estimation software and tools for professionals in estimating all phases of building and repair to make day-to-day workflows the most efficientExtreme Event Solutions — provides risk modeling solutions to help individuals, businesses, and society become more resilient to extreme events.Specialty Business Solutions — provides an integrated suite of software for full end-to-end management of insurance and reinsurance business, helping companies manage their businesses through efficiency, flexibility, and data governanceMarketing Solutions — delivers data and insights to improve the reach, timing, relevance, and compliance of every consumer engagementLife Insurance Solutions – offers end-to-end, data insight-driven core capabilities for carriers, distribution, and direct customers across the entire policy lifecycle of life and annuities for both individual and group.Verisk Maplecroft — provides intelligence on sustainability, resilience, and ESG, helping people, business, and societies become strongerVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}