{"Job ID": "69873482", "Description": "Job DescriptionAre you a Sales professional looking for a great opportunity to exceed?  we have the great opportunity for you with Emerson's Discrete Automation business in India.  You will have authority for growing order bookings and the business development across India.  To be successful in this position you are required to be committed growing the opportunity funnel / order intake, acquiring new customers, providing a reliable orders' forecast, govern key critical metrics across the teams, as well as actively mentoring and developing the team/channel to improve the customer reach within India sub-continent.  Our preference is for the position to be based in Chennai, India.As the Director of Sales, you will:Drive orders growth in India, influence regional sales managers Team, sales engineers, segment business development managers, application engineering, and channel partners.\nEnsure we are capturing above-market, profitable growth with a driven focus on penetration programs and price realization.\nForecast orders performance optimally for the month and quarter based on CRM opportunity funnel, run rates, and team feedback.\nLead forecasting calls, funnel reviews and efficiency sessions with the teams monthly to gain business insight and provide ample mentor to the team.\nDirect critical relevant metrics across sales team and provide regular feedback; funnel expansion, opportunity close rate, commercially tied to sales stage, quote rate, number of customer activities, lead conversion rate, and new accounts generation, etc.\nEstablish annual growth targets for team based on prior year performance and expectations for the year, in-concert with Discrete Automation Asia Pacific plan.\nMonitor competitor activity, displace competition at target accounts, and grow market participation.\nCollaborate with Engineering, Operations, Perfect Execution and Finance Teams for new product development, customer service level improvements and collections.\nPut continual efforts for creating a diverse team in an inclusive environment, provide regular mentor and training to team members to develop highly effective team passionate about application development, value-selling, prospecting, and opportunity closing with customer verifiable outcomes.\nHold Emerson Values and Culture HighWho you are:You define success in terms of the whole team.  You consistently use multiple methods to develop others.  You set aggressive goals and have high standards. You promote high visibility of shared contributions to goals.  You are the first to spot possible future policies, practices, and trends in the organization, with the competition, and in the marketplace.  You serve as a strategic partner to build, grow, and maintain profitable and long-lasting relationships with key accounts.  You show a tremendous amount of initiative in tough situations and are exceptional at spotting and seizing opportunities and bounce back.  You promote a sense of urgency and establish and enforce individual accountability in the team.Required Education, Experience & Skills:Bachelor’s degree in business administration, marketing, engineering, or equivalent. \nRelevant years of sales leadership/ management experience commensurate with the level of the position.\nTechnical knowledge in electrical or mechanical industries.\nWilling to travel >60% of the time.Preferred Education, Experience & Skills:MBA or other advanced degree a plus.\nSales management experience preferably in a business-to-business environment and in the industrial/manufacturing market\nKnowledge of instrumentation, pneumatics schemes and components, PLC and SCADA.\nExperience leading and developing large teams, with multiple layers, strongly preferred.\nExperience selling products/solutions that are typically capital expenditures for customer base preferred.\nExperience with Process, Industrial Solutions, Factory Automation, Medical, Electronics, Packaging, and Automotive markets preferred.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}