{"Job ID": "69873059", "Description": "Job Description:Job Purpose/OverviewOne Demand Data & Analytics (ODDA) is a Mars Wrigley program that harnesses the power of data and insights to solve some of the critical business-wide problems we face – unlocking quality growth and operational excellence.Through ODDA, we deliver connected insights across the entire demand ecosystem. We empower our Associates with the right data, tools and capabilities so they can take decisive action, maximizing value and making a meaningful impact on our consumers, our customers and our business.The Portfolio & Innovation Analytics vertical within ODDA seeks to equip Mars Associates with the capabilities needed to address portfolio health and innovation from a holistic and analytics-driven viewpoint.Key ResponsibilitiesApplies strong expertise in AI through use of machine learning, data mining, and statistical models to design, prototype and build next generation AA engines and services \nCollaborate with business partners to develop novel ways to meet objectives utilizing cutting edge techniques and tools\nEffectively communicate the analytics approach and how it will meet and address objectives to business partners\nAdvocate and educate on the value of data driven decision making focusing on the “how and why” of solving problems\nLead analytic approaches, integrating work into applications and tools with data engineers, business leads, analysts and developers\nCreate repeatable, interpretable, dynamic and scalable models that are seamlessly incorporated into analytic data products\nEngineer features by using your business acumen to find new ways to combine disparate internal and external data sources\nShare your passion for Data Science with broader enterprise community; identify and develop long-term processes, frameworks, tools, methods and standards\nCollaborate, coach, and learn with a growing team of Data Scientists\nStay connected with external sources of ideas through conferences and community engagementsJob Specifications/QualificationsBachelor’s degree in Analytics or related quantitative fields (statistics, Operations research, mathematics, econometrics etc.). Advanced degree will be preferred\n4 to 6 years' experience in applied data science role or equivalent; ideally in CPG/Retail\nKnowledge and experience in modelling techniques and advanced applied skills (e.g. significance testing, GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.) using tools like Spark, Scala, SAS, R, Python, Bayesia, H2O, Storm, Yarn, and Kafka\nExperience querying databases (SQL, Hive)\nExperience working with big data platforms such as Hadoop ecosystem (Azure), including in-memory solutions (SAP HANA and Apache Spark)\nWorking knowledge of data visualization tools such as Tableau, Power BI, D3, ggplot, to deliver output to the broader business community to improve decision making and productivity\nStrong communication and presentation skillsWhat can you expect from Mars?Work with over 130,000 like-minded and talented Associates, all guided by The Five Principles.\nJoin a purpose driven company, where we’re striving to build the world we want tomorrow, today.\nBest-in-class learning and development support from day one, including access to our in-house Mars University.\nAn industry competitive salary and benefits package, including company bonus.Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Gurgaon, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}