{
    "Job ID": "69873118",
    "Description": "Job Details:Job Description:\nIn the IP Engineering Group (IPG), our vision is to build leadership IPs that power Intel's and our customers' winning products. We are on an exciting journey to transform IP at Intel. Intel's ability to achieve product leadership starts with the innovations created by this world class team of engineers and technologists. IPG provides critical ingredients to make Intel products successful whether on Intel or third-party process, including fabrics, memory controllers and Phys, IO controllers and Phys, high speed SERDES (e.g., 112G, 224G), foundational IP (e.g., PLL), power delivery IP, standard cell libraries and more.\nOur program office team is part of the IPG Customer Engineering Group under Yi-Hung Chee. You would be working directly with our internal DEG product partners in client, server, networking, graphics, FPGA's, etc. to ensure that their needs are understood, and that we are providing them with the necessary IP to build leadership products. The Technical Customer Manager is the face of IPG and we are always representing IPG leadership and our organization. We play a pivotal role in managing the IP deliveries to our internal SoC partners, including:\n- Managing a complex IP portfolio from architectural definition through IP execution\n- Acting as the single point of contact in driving both internal and external stakeholder alignment\n- Working across multiple disciplines to drive technical resolution and direction for IP teams\n- Escalation management between IP teams and external stakeholders\n- Executive level communication on critical IPG updates across Intel's product portfolio\n- Management of customer contracts\n- Prepare and participate IPG level management reviews with our partnersQualifications:Work Model for this RoleJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}