{
    "Job ID": "69875695",
    "Description": "Responsibilities:Work with a multi-disciplinary team to translate the client’s business requirements into a solution vision and high-level architecture.\nLead detailed design, implementation and integrations as part of large complex agile projects or product engineering teams.\nLead globally distributed teams of AEM, integration and QA engineers to implement the solution with a combination of architectural leadership and hands-on implementation.\nUse your deep understanding of Digital Experience Platforms to provide thought leadership to our clients and internal teams on best leveraging the Adobe suite products.\nA deep knowledge of modern web frameworks and web architecture best practices and patterns.\nBe accountable for the overall quality and performance of the solution.\nAnticipate issues and risks at the module level and work with program leadership to escalate and solve the problems appropriately.\nStrong experience with build script and CI CD and GIT, Jenkins or similar.The Role Offers:To analyze, understand the client’s business use cases and technical requirements.\nTo be able to design, build & integrate AEM Platform Templates, Components, Services to internal and external applications.Essential Skills:Hands-on-Experience in Content Management Systems in general, with at least 9 years of specific AEM experience required along with AEM 6.3+ version experience is ideal.\nStrong working knowledge of AEM/Adobe CQ/Digital Marketing Suite.\nExperience designing modules and components.\nExperience in end to end implementations of AEM.\nExpertise in AEM and associated technologies like Sling, OSGI, Felix, Jackrabbit, JCR, CRX.\nExperience leading large sized teams and technology engagements, including client and consulting staff.\nExperience conceptualizing, designing, building, and deploying Enterprise Content Management solutions.\nRelevant working experience including expertise in “Enterprise Architecture” consulting skills such as interviewing stakeholders, conducting architecture reviews, and consensus building.\nProfessional and consultative mindset with commitment for excellent customer service.\nExcellent interpersonal and communication skills (both written and oral).\nAbility to come up with creative solutions for ambiguous problems and learn quickly.\nPractical expertise in performance tuning and optimizing bottleneck problems analysis.\nSolid technical expertise and troubleshooting skills.\nFluent oral, written English and strong presentation skills.Essential Qualifications:Bachelors degree (BE, BTech) in Computer Science, or Engineering OR equivalent experience and knowledge required.\nGood mentoring skills and enablement through thought leadership.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}