{"Job ID": "69875731", "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob DescriptionKümeslerde günlük mortaliteyi kontrol etmek, yapılan bütün işlemlerin verilerini ilgili programlara girmek raporlamak ve kesim programlarını organize etmek,\nYarka ve tavukların kümese sevkinden itibaren gerekli kontrol, ölçüm, analiz ve raporlamaları yapmak ve raporlamak,\nHaftalık zaiyat , gramaj ve üretim  veri girişlerini yapmak ve raporlamak,\nKümeslerin biyogüvenlik kurallarına uymasını sağlamak ve takip etmek,\nAşı dolapları, aşı hazırlama ve kontrol ekibi ve aşı ekibinin eğitim ve kontrollerini yaparak aşılama kalitesini en iyi seviyede tutmak,\nBütçeye uyumu sağlamak ve takip etmek,\nSorumlu olduğu personelin takım hedeflerini belirlemek, uygulanmasını sağlamak, performanslarını değerlendirmek ve personelini motive etmek,\nBelirlenen hedefleri yakalamak için gerekli aksiyonları alarak hedeflerin gerçekleşmesini sağlamak,\nSorumlu olduğu personelin her türlü ihtiyaç ve sorunları ile ilgilenmek.\nDamzılık  kümeslerinin ihtiyacı olan ilaç, aşı, dezenfektan ve diğer sarf malzemelerinin takibini yaparak teminini sağlamak,Job DescriptionGıda güvenliği ile ilgili konuların kalite güvence bölümüne rapor edilmesini sağlamak,ISO22000-HACCP, ISO9001 ve ISO14001&OHSAS18001 sistemlerinin gereklerini yerine getirmek, ISO27001 kapsamnda düzenlenmiş olan BGYS-Bilgi Güvenliği Yönetim Sistemi gerekliliklerini yerine getirmek ve şirket bilgilerinin gizliliğini, bütünlüğünü ve erişilebilirliğini korumak,\nAlanıyla ilgili yasal gelişmeleri takip etmek ve öğrenmek,\nKalite Yönetim Sisteminin Gerekliliklerine Uymak,\nGıda Güvenliği Yönetim Sisteminin Gerekliliklerine Uymak,\nHelal Gıda Üretiminin Gerekliliklerine Uymak,\nAlanındaki ve Bölümündeki Özel Müşteri Gerekliliklerine  Uymak,\nPiliçlere uygulanan aşı ve ilaç benzeri tıbbi ürünleri türkvet kayıt sisteminde reçetelendirmek.Desirable requirementsÜniversitelerin Veteriner Fakültelerinden mezun,\nTercihen akıcı derecede İngilizce bilen,\nB sınıfı ehliyeti olan ve aktif olarak araç kullanabilen,\nİyi derecede MS Office (Word/Excel/Powerpoint) programlarını kullanabilen,\nStres yönetimi becerisi yüksek,\nİletişim becerisi güçlü,\nPlanlama ve organizasyon yeteneği gelişmiş,\nProblem çözme becerisi yüksek,\nİş takibi konusunda dikkatli,\nEsnek çalışma saatlerine uyum sağlayabilen,\nBroiler damızlık sevk ve idaresi konularında bilgi sahibi.\nBandırma’da yaşayan veya yaşayabilecek olan.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}