{
    "Job ID": "69872953",
    "Description": "You are a strategic thinker/good at analytics  and passionate about Liquidity Reporting. You have found the right team.As a Reporting Professional in our Corporate Treasury middle Office (CTMO) team, you will spend each day defining, refining and delivering set goals for our firm.Job Responsibilities :Review, adjust and attest to liquidity and interest rate risk data on a daily basis\nPerform product reconciliations & assist with daily balance sheet variance analysis and reporting (e.g. LCR, 6G, etc.)\nDetermine business drivers behind variances and communicate impact to partner groups such as Liquidity Risk Oversight, Corporate Treasury Middle Office, etc.\nDesign queries to analyze large volumes of data from multiple sources to create financial and operational reports (e.g. daily available collateral, intercompany bookings, etc.)\nPartner with senior stakeholders in the LOBs, Controllers, Global Treasury and other related areas to obtain, understand, and analyze Balance sheet data & other relevant information such as forecasts, assumptions etc. and their impact on the firm’s liquidity & structural interest rate risk management\nIdentify opportunities for process improvements, remediate data quality issues, automation etc. Required qualifications, capabilities, and skillsBachelor’s degree required, CFA/CMA/CA/MBA (Finance) an advantage\nMinimum 1-3 years’ experience in the financial services industry, preferably within a regulatory reporting/policy department\nStrong analytic, creative thinking and problem solving skills. Keen attention to detail and ability to work independently \nExcellent organizational, multitasking and prioritizing skills\nAbility to handle stress and tight deadlines. Strong written and verbal communication skills. Be skilled in performing complex quantitative analysis.\nKnowledge of key bank systems and processes, including financial sub-ledgers, product systems etc. would be an advantage\nPossess subject matter expertise in banking book and trading book products, data flows & quality checksPreferred qualifications, capabilities, and skillsExcellent working knowledge of MS Excel, PowerPoint, MS Access and Word \nFRM/ Prior work experience in liquidity and/ or interest rate risk management programs would be an added advantage\nShould be flexible to work in EMEA shiftsJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}