{"Job ID": "69875732", "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:Cloud Architect to join will:Evaluate, plan and integrate technical infrastructure solutions\nGuarantee a secure infrastructure environment as well as production stability and performance\nAnalyze errors in systems and define corrective measures (you’ve got a good eye) Cooperate with other groups in engineering on delivery of large-scale programs Maintain & improve existing deployment and build mechanisms\nExpert in public cloud platform’s\nExpert knowledge of networking and infrastructure provisioning consisting of networks, compute and storageKey Result Areas:Cloud capability Infrastructure provisioning Terraform expertise\nOperating Environment, Framework and Boundaries, Working Relationships\nAdhere to the project management, security controls, procedures, engineering frameworks\nProvide help to other team members\nProvide full information to the peers on work done and have full transparency in\nEnsure management is fully notified of any risks, issues, project status and accomplishments\nEnsure that management is informed of any issues that are delaying the project or of any errors on timely and swiftly basis\nProvide daily updates to the line manager\nEnsure full compliance to the engineering principles in place\nEnsure the tools are used appropriately in daily engineering sessionsProblem Solving:Infrastructure and OS level diagnosis Networking and Security\nEnd to end connectivity diagnosis\nDecision Making Authority & Responsibility\nEnsure engineering best practices are followed in design and implementation\nEnsure code quality is of high standard as outlined by the cloud architect Ensure “automation” approach is the primary strategy in solution engineering\nEnsure every code contribution is fully tested and reviewed by the cloud architect Ensure the solutioning decision always follows the principle of High Availability, Resiliency and Auto Recovery\nKnowledge, Skills and Experience\nMin. of 7 years of experience with cloud engineering Microsoft Azure or AWS, GCP\nTerraform Ansible\nInfrastructure (network, compute and storage) including managed databases in cloud\nOS Linux & Windows\nManaging Active Directory/DHCP/DNS/Windows Infrastructure Experience in administering Azure\nExcellent knowledge of PowerShell, yaml and a good understanding of Cloud API’s & Excellent understanding of management and control plane components, from Networking, Access Management, Policies and RBACJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}