{
    "Job ID": "69873304",
    "Description": "Summary role description:Hiring for a Networks Leader (Senior AVP / VP), to lead Networks (including Networks Security), across multiple environments straddling enterprise (internal) Data Centre and the cloud(s), for a tenured, mid-tier global IT Services, IT-enabled Services, Digital Solutions, Data & Analytics and Business Process Management provider client.Company description:Our client is a tenured mid-tier global major, offering specialised IT Services, Digital Solutions, and Business Process Services. They help their clients – across domains and industries – derive sustainable competitive advantage at scale, through their high-end Data & Analytics & AI/ML and automation driven digital solutions and platforms, across the client’s business value chain. Their services are powered by carefully orchestrated multi-environment networks (and networks security) operations and services.Role details:Title / Designation: Senior AVP or VP – Networks\nReporting Manager: Enterprise Head – Technology Infrastructure\nLocation: Delhi, NCRRole & responsibilities:Lead the design, planning, implementation and ongoing upgrades / updates of Network and Network Security infrastructure, routing protocols, access controls, firewalls, enterprise VPNs, across internal, public clouds, private clouds and hybrid environments\nDirect the management and troubleshooting of Next Gen Network Security Platforms (like Palo Alto , Checkpoint , Zscaler, etc )\nManage large projects related to Network Security Infrastructure, including the design and configuration of VOIP, MPLS and QOS, emerging technology in cyber security like UEBA, WIPS, CASB, DDOS, Zero Trust architecture etc and their support in production operations\nLead the process governance, ongoing certification on security control frameworks like ISO 27000, PCI / DSS, SOX and SAS.\nLead network operations and automation, leveraging SDN architecture solutions like Arista and Cisco SDN, SD WAN /NFV technology solutions, etc. across the enterprise networkCandidate requirements:18- 22 years of experience in Networking and Network security technologies with minimum 3 years in above capacity in a large enterprise\n4-5 years’ experience in design, planning and solutioning of Network and Network Security infrastructure\nExperience in managing and troubleshooting Next Generation Network Security Platform (Palo Alto, Checkpoint, Zscaler etc )\nAbility to manage large projects related to Network Security Infrastructure.\nIn-depth knowledge in designing and configuration of VOIP, MPLS and QOS and troubleshooting any issues related to that.\nGood understating of ISO 27000, PCI/ DSS, SOX and SAS control from Network Security Control perspective.\nHand on experience in Routing protocols BGP, IBGP, OSPF\nHands on experience in Network Access Control (NAC) and Remote Access control in a large enterprise.\nDesign, architect and implement features of Next Gen Firewall, Anti APT, Remote VPN etc \nDeep understanding of SD WAN /NFV technology and its applicability in enterprise network\nIn depth understanding and hands on experience on Public Cloud (AWS, Azure), Private and Hybrid cloud architecture\nGood understanding of emerging technology in cyber security like UEBA, WIPS, CASB, DDOS, Zero Trust architecture etc.\nHands on experience of Arista and Cisco SDN (Software defined Network) architecture\nDesign, Architect and implement features in Arista SDN controller to automate the Network service.\nDeep understanding of SD WAN /NFV technology and its applicability in enterprise network\nExperience working with Infrastructure-as-a-service platforms (Openstack, NSX, vSphere etc)\nExperience in scripting e.g. Python, Ansible, Chef ,Puppet , ManageIQ and Grafana etc.Selection process:Interview by Head of Technology Infrastructure\nInterview by Head of Engineering – Technology Infrastructure and Security\nInterview by CIO\nWrap-up discussions with HRJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Navi Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}