{
    "Job ID": "69873653",
    "Description": "About Content Marketing Manager roleResponsibilities (not exhaustive)●   Develop compelling, long form content (e.g., white papers, eBooks) aligned with the key themes for the broader marketing team. This includes thought leadership-centric content addressing the pain points of large and mid-sized organizations and how Disprz's product portfolio fits-the-bill for their requirements.●   Conduct primary and secondary research to deliver actionable content that resonates with key buyer and decision maker personas. Use primary research surveys to develop fact-based arguments and hypotheses.●   Contribute towards SEO efforts with blogs and short, point of view (PoV)-style content.●   Conduct a competitive analysis to identify gaps in content coverage and work with the product marketing team to proliferate key messages for Disprz’s value proposition in the target markets.●   Monitor and analyze the performance of published content using relevant analytics tools. Identify trends, gather insights, and make data-driven recommendations to enhance content effectiveness and audience engagement.●   Stay updated with industry trends, new content formats, and emerging digital marketing practices. Apply this knowledge to enhance content strategies, experiment with new formats, and propose innovative ideas to drive audience engagement.Education●   Strong writing, editing, and proofreading skills; ability to convey complex topics/ideas via easily consumable content.●   Strong interpersonal and communication skills.●   Experience in creating and publishing both technical and non-technical content of varying depth and complexity.●   Ability to work independently, and manage multiple projects simultaneously.●   Bachelor’s degree in engineering, marketing or a related discipline. MBA preferred. ● Proficiency in using content management systems (CMS) and familiarity with HTML.Experience●   5-6 years of experience in developing/publishing technical and business-centric thought leadership content of varying complexity. Prior experience in B2B SaaS organizations would be an advantage.Abilities and traits●   Content Analysis: This dimension will evaluate you on how you analyze content requirements / learner needs, identify the scope, gather content and advise customers on the approach they should take to develop their content into digital learning. An exceptional performance in this area means that you are the ultimate authority in e-learning solutioning.●   Technical – Development and Coordination: This dimension will evaluate on how you perform technical coordination between the customer and the vendor team throughout the development lifecycle. You will be evaluated on how you develop storyboards and scripts, conduct output reviews, provide feedback and ensure that the delivery is error free and in line with the expectation. An exceptional performance in this area means that you are significantly adding technical value to the e-learning production lifecycle.●   Communication: This dimension evaluates the quality of your written and oral client communications, including email communications, formal written documents, oral presentations, meetings and discussions. An exceptional performance in this area means that your managers and peer group love to work with you and you are in control of the business workflow.About disprzDisprz is an exciting growth stage series C SaaS company in the learning and skilling tech space. Serving over 2 million + learners,It has established itself as a leading start-up in this space in emerging APAC, a fact confirmed by the Government of India's Atma Nirbhar App award (#1 in the eLearning category) and its enviable client list of 300+ customers in every continent of the world, which includes the leading household names such as Amazon, Bajaj Insurance, Tata Motors, Uber, Pidilite, Indian oil, PETRONAS, DG Sharaf, to name a few. Disprz has recently forayed into developed markets and enjoys product-market fit and is now ready to scale in the US, UK and ANZ markets as well. Disprz boasts of a great culture code that empowers teams, values work-life balance and encourages innovation and experimentation.If you are driven, curious, and passionate about tackling technical challenges and driving innovation forward, we believe that you would be a great fit for our team at Disprz.Why Join disprz? / What we offer for you ?Diversity & inclusion - to value the right skills and ambitions, no matter what your age, experience, nationality, gender is.Top decile package - Happens to come as an added perk as we recognize the great work you do.Well being programs - To ensure that you are healthy and happy at all timesGlobal exposure - As we are growing and disprzing our presence across the worldLife at disprz is... Fast-paced yet Balanced | Cutting edge yet Classic | Challenging yet FunA Sneak-Peek into our Culture -https://youtu.be/GYlPdgY_C40?feature=sharedJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}