{"Job ID": "69873124", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.How we support the Whole You:  Our benefits are a good reason to come to JLL.We are committed to hiring the best, most talented people in our industry, and then empowering them with the resources and support to enhance their health, financial and personal well-being. Our underlying benefits philosophy is this: be fair to our people and provide opportunities for those who take advantage of our programs and resources to increase their personal and financial security.Assistant Technical Manager Work DynamicsWhat this job involves:Overcoming engineering challengesIf challenges that come with being the go-to person on engineering matters excite you, join us to develop your strengths.In this role, you’ll show your mettle as you find ways to uphold excellence and high standards in our preventive maintenance programmes and conservation practices. Working closely with the chief engineer, you’ll also monitor the M&E projects, looking out for their quality and ensuring their timely delivery. Delivering complete and accurate facility management reports is another requirement that you must meet consistently.Likewise, you’ll play a huge part in the hands-on process of providing to the client comprehensive facility, contract and procurement management for technical services. You’ll contribute to hitting financial targets and other goals set by the senior facilities manager, achieving key performance indicators, and meeting service level agreements.  Shaping a system of best practicesYour engineering prowess will be your toolkit for success. Managing on-site mechanical, electrical, plumbing installations and civil maintenance should be second nature to you. You’ll also be in-charge of preparing the list of critical spares for all installations based on the manufacturers’ recommendations.On top of these, you’ll plan the maintenance inventory being carried out with our in-house teams. No machine failures of critical equipment should escape your sharp eye. You should, then, also be ready with a pre-emptive maintenance programme for these malfunctions to prevent the risk of sudden breakdowns.You’ll also make sure that our logbooks, checklists and schedules are upkeep and current. From time to time, you’re expected to arrange ad-hoc M&E set ups based on the client requirements.Sound like you? To apply you need to have:Mastery in the fieldYou should have earned a degree in engineering, ideally, electrical engineering or mechanical engineering. Having three to seven years of experience in facilities management will also prove indispensable. We’ll also expect you to work as a part of a diverse team in both leadership and individual contributor expertise.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realise your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –We’re JLL—a leading professional services and investment management firm specializing in real estate. We have operations in over 80 countries and a workforce of over 102,000 individuals around the world who help real estate owners, occupiers and investors achieve their business ambitions. As a global Fortune 500 company, we also have an inherent responsibility to drive sustainability and corporate social responsibility. That’s why we’re committed to our purpose to shape the future of real estate for a better world. We’re using the most advanced technology to create rewarding opportunities, amazing spaces and sustainable real estate solutions for our clients, our people and our communities.Our core values of teamwork, ethics and excellence are also fundamental to everything we do and we’re honored to be recognized with awards for our success by organizations both globally and locally.Creating a diverse and inclusive culture where we all feel welcomed, valued and empowered to achieve our full potential is important to who we are today and where we’re headed in the future. And we know that unique backgrounds, experiences and perspectives help us think bigger, spark innovation and succeed together.Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500® company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}