{
    "Job ID": "69873637",
    "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 50,000 pioneers around the globe. Our teams at Henkel Consumer Brands continuously drive the evolution in dynamic categories: Laundry & Home Care and Hair. With our trusted brands, including Persil and Schwarzkopf, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Executes and manages projects and resources to meet planned objectives.\nEnsures compliance with Henkel corporate SHE standards, policies and procedures and manages the lab and innovation process.\nAssures all new products meet international chemical health and safety requirements and other regulations.\nEnsures that Henkel's new IP is protected through collaboration with internal and external partners.\nProvides technical support services to Manufacturing and Quality as required.\nExecutes process develop-s to support x-functions teams to achieve completion of new technology products consistent with strategy objectives. \nApproves technical readiness of raw materials and products as well as first production and quality specs.\nTests or supervises tests on product stability and performance.Exposure in product development, product launch, laboratory work. \nBachelor's degree in chemistry/chemical engineering.\nProactive, passionate and team player with excellent communication skills\nPrevious laboratory experience is a plus. (ex. formulations)Henkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, personalities and mindsets.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}