{"Job ID": "69872605", "Description": "As an Assistant Sales Manager, you will play a pivotal role in driving the company's customer-centric vision, maintaining positive customer relationships, and fostering a culture of excellence in customer service across all levels of the organization. Your expertise in customer engagement and your ability to lead and motivate teams will be instrumental in achieving the company's objectives and maintaining a positive brand image in the logistics industry.KEY ACCOUNTABILITIES:Sales Enhancement Project: Develop and implement an extensive sales-focused knowledge hub, integrating essential insights including business and market dynamics, and analyses of strategic trade routes. This hub will stand as an invaluable tool for our sales agents, empowering them with precise and current information to drive effective sales strategies and decisions.\nTeam Management: Oversee the orientation and training of the sales team, ensuring they possess the necessary skills and knowledge to deliver exceptional customer service.\nCustomer Experience Optimization: Define and implement standards and procedures to ensure an optimal customer experience across all touchpoints. Conduct surveys to gather customer feedback and opinions on the services rendered, and use this data to drive continuous improvement.\nCollaboration with Marketing: Work in close coordination with the line manager and the marketing department to harness the potential of digital platforms for the purpose of addressing member concerns, ensuring swift responses to inquiries, and cultivating a favorable brand perception.\nTeam Supervision: Supervise the activities of the sales team, guiding them to maintain positive interactions with members and reflecting positively on the company.\nInterdepartmental Collaboration: Collaborate closely with the line manager to foster strong synergy between the marketing, partnership, and other relevant departments, ensuring seamless alignment and a commitment to delivering an unparalleled customer experience.\nMonitoring, Reporting, and Performance Tracking: Monitor the performance of the sales team to ensure adherence to acceptable standards, prepare regular reports and customer satisfaction metrics for management, motivate the sales team, track their performance, and report key metrics to ensure the team's continuous growth and success.\nIndustry Expertise: Develop a deep understanding of the logistics industry, including relevant operations, to make informed decisions and deliver tailored customer solutions.\nCompliance and Confidentiality: Maintain the confidentiality, integrity, and availability of information in line with company information security policies and procedures.\nProfessional Development: Stay updated on industry trends and best practices through education, networking, attending seminars, workshops, and conferences.\nAct as an ambassador for DP World at all times when working; promoting and demonstrating positive behaviors in harmony with DP World’s  Principles, values and culture; ensuring the highest level of safety is applied in all activities; understanding and following DP World’s Code of Conduct and Ethics policies.\nPerform any other related duties as assigned by the company or line manager to contribute to the overall success of the organization.QUALIFICATIONS, EXPERIENCE AND SKILLS:Bachelor's degree in marketing, communications, advertising, business management, or a related field preferred. An advanced degree or relevant certifications would be advantageous.\nMinimum of 5 years of progressive experience in sales or customer experience management or a similar customer support role, with at least 2 years in managerial capacity.\nProven track record of successfully gathering and interpreting customer experience data, driving insights, and implementing strategies to improve customer satisfaction and loyalty.\nComprehensive knowledge of online customer engagement platforms, channels, and emerging trends in customer service.\nExceptional interpersonal skills with a strong client-centered approach, capable of building and nurturing lasting relationships with customers and key stakeholders.\nOutstanding organizational and time management abilities, adept at managing multiple projects and priorities effectively.\nDemonstrated excellence in communication, collaboration, and problem-solving, with the ability to lead and inspire cross-functional teams to achieve common goals.\nStrong analytical skills and data-driven decision-making capabilities, using metrics to assess performance and drive continuous improvement.\nProactive and results-oriented mindset, with a focus on achieving business objectives and driving the team towards success.\nExperience in training and developing customer experience representatives, providing mentorship, and fostering a culture of excellence within the team.\nUp-to-date with the latest industry trends, best practices, and technological advancements in customer experience management.\nHigh level of emotional intelligence, able to handle challenging situations and difficult conversations with a positive and constructive approach.\nPrevious experience in the logistics industry or related fields is a plus.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}