{
    "Job ID": "69870319",
    "Description": "Program National Test Center CoordinatorUMGC EuropeLocation: Manama, BahrainOverseas Contingent III, (100% FTE, Full-Time), Grade 003University of Maryland Global Campus (UMGC) Europe seeks a Program and National Test Center Coordinator. The Program and National Test Center Coordinator (PNTCC) serves as the on-site UMGC representative responsible for providing academic, administrative and testing support services, community outreach, and customer relationsmanagement. Thisposition reports directly to the Site Lead (SL) or Assistant Director (AD). The Program and National Test Center Coordinator must work effectively with the A.D. and the Regional Director (RD), local Program Coordinators and staff, education center personnel, faculty, administrative staff, and the military community at large. There will at times be site-specific duties that differ from location to location. Occasional evening/weekend hours; travel may be required. SPECIFIC RESPONSIBILITIES INCLUDE:Provide academic and administrative support services to prospects and students, and ensure Quality Assurance Standards are met by being available, knowledgeable, courteous and responsive\n\nDocument all student contact through UMGC’s Customer Relations Management System and schedule appropriate follow-up activities\n\nProvide and maintain open and positive communications with host military Education Services Officer (or equivalent) and respective Education Center staff\n\nOrganize and participate in local Education Fairs, Open Houses, Semester Start-ups, Student Appreciation Days, Local Graduations and other events as needed, professionally representing UMGC\n\nTrack and analyze class enrollments and student interest, as well as local degree progression, to provide input on scheduling; ensure classrooms are provided with adequate space and needed technology for class instruction; be present at the first class session to provide assistance to instructors and students; and assist faculty in obtaining base access to attend class on their assigned installation\n\nDistribute marketing, advertising, and mass media materials at assigned locations when permissible\n\nCreate and maintain a site(s) specific outreach plan to attain university goals towards recruitment and retention\n\nProvide National Test Center testing services on a basis that meets community demand while balancing other, outlined duties\n\nParticipate in UMGC staff meetings, professional development activities and training sessions as required\n\nTrack and compile monthly statistics and provide reports as needed\n\nMaintain appropriate communication with immediate supervisor and other UMGC staff to ensure timely resolution of student issues/escalations\n\nOther job-related duties as assignedREQUIRED EDUCATION AND EXPERIENCE: Bachelor’s Degree\n\nBackground in customer service\n\nAble to work in a fast-paced and complex environment with accurate attention to detail\n\nPossess basic office management and clerical skills\n\nEffective written and verbal communication skills\n\nGood interpersonal skills\n\nSuccessful applicants must be able to pass a medical screening, background check and meet requirements for individual logistic support (ILS).PREFERRED EDUCATION AND EXPERIENCE:Applicants with a U.S. valid driver’s licenseWHO MAY APPLY:Applicants with individual logistical support (ILS) preferred. Applicant must qualify for ILS as described in USAREUR Regulation 600-700, Section III, 7-13. Criteria under which applicants qualify for ILS are: must serve the US Forces exclusively; are not stateless persons; are nationals of a NATO state, excluding the host nation; are not ordinarily resident in the host nation.All submissions should include a cover letter and resume. UMGC offers competitive compensation and comprehensive benefits for qualifying positions, such as tuition remission, generous leave and healthcare. For detailed benefits information, please visit: https://careers.umgc.edu/benefits.html.The University of Maryland Global Campus (UMGC) is an equal opportunity employer and complies with all applicable federal and state laws regarding nondiscrimination. UMGC is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, ancestry, political affiliation or veteran status in employment, educational programs and activities, and admissions.University of Maryland Global Campus (UMGC) is committed to helping safeguard the health of its faculty, staff, students, contractors, and guests. Because vaccinations reduce the spread of SARS-CoV-2-the virus that causes COVID-19-all prospective UMGC faculty (full-time and adjunct) and staff are strongly encouraged to be fully vaccinated and current with the recommended boosters. As always, operations at our military locations in Europe, Asia, and stateside will follow the guidance of the U.S. Department of Defense and local commands, and may require proof of full vaccination, unless an exception is approved as a reasonable accommodation based on disability or religion. If so, a copy of their Approved Exception Letter must be provided before the start of their employment. Failure to provide proof of vaccination or show proof of exception may result in the offer of employment being rescinded.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Manama, Bahrain",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}