{
    "Job ID": "69873185",
    "Description": "As Concierge Host, I will fully comprehend the vision of Six Senses to help people reconnect with themselves, others and the world around them and our values of local sensitivity and global sensibility, crafted experiences, emotional hospitality, responsible and caring, fun and quirky and pioneering wellness.  Sustainability, Wellness and Out of the Ordinary experiences are at the core of everything we do at Six Senses. I will safeguard these pillars and ensure full knowledge and active participation of all our brand initiatives. Duties and Responsibilities As Concierge Host, I will assume full responsibility for the efficient operation in the following:\n• Responsible for responding to a wide variety of guest requests by accurately assessing the guest needs and requests and then adding personal recommendations and touches to achieve maximum guest satisfaction while complying with resort standards and policies.\n• Accommodate special requests whenever possible.\n• Process and handle all guest requests in regards to packages, faxes, messages and mail.\n• Assist guests in all inquiries in connection with resort services, hours of operations, key hotel personnel, in-house events, directions, etc.\n• Coordinate with departments for transfer related requests and assist guests with transfers to and from the hotel if required.\n• Recommend, plan, schedule and make arrangement with guests for their preferred activities during the stay.\n• Upkeep Six Senses guidelines and standards of service and operation. My performance benchmarks are maintained and exceeded.\n• Strictly adhere to LQA standards and guest comments.QualificationsTo execute the position of Concierge Host, I must have the required qualifications, technical skills and experience in a similar role in luxury hotels with proven results and includes the following:High school diploma or equivalent and at least 3 years’ experience in a similar role in luxury resorts.  Fluent in English.The above is intended to provide an overview of the role and responsibilities for a Concierge Host at Six Senses Zighy Bay. It is not and does not infer that the above is an inclusive and/or exhaustive list of the duties and responsibilities inherent to the position.  Six Senses Zighy Bay is an equal opportunity employer. This policy applies to all terms and conditions of employment. Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Oman",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}