{"Job ID": "69873407", "Description": "Calling all innovators – find your future at Fiserv.We’re Fiserv, a global leader in Fintech and payments, and we move money and information in a way that moves the world. We connect financial institutions, corporations, merchants, and consumers to one another millions of times a day – quickly, reliably, and securely. Any time you swipe your credit card, pay through a mobile app, or withdraw money from the bank, we’re involved. If you want to make an impact on a global scale, come make a difference at Fiserv.Job TitleTransition of US Implementation roles  to FGS as approved by George WehbeAbout the Role:You will be a member of a team of programmers and analysts (onshore & offshore) working to convert new and existing clients to the Cleartouch core system and related applications.  Using detailed requirement documents (called system studies) you will write programs/procedures/scripts to translate, convert and/or migrate data from other service providers and products to implement products and convert data to the Fiserv applications.  You will work closely with the Conversion Analyst to understand the Client requirements and then collaborate with your team members to code, test and deploy your program(s) and provide support during the actual conversion event.  Working with team members and product development & support teams you will provide analysis, consultation and programming on projects and future releases to ensure an accurate data conversion and the ongoing maintenance of application programs and databases to stay current with the latest release version.  Your efforts will be rewarded with a successful quality conversion, client satisfaction, and a positive post conversion survey.About our Business:Our Bank Solutions team delivers technology products and services for community, regional and large financial institutions through an outsourced service center. The Conversions team is responsible for the conversion of Client data, the implementation of products, and client support on the Fiserv bank servicing platform, Cleartouch. This platform enables Clients to improve their customer service and streamline back-office operations by providing mission-critical banking functionality while also serving as a delivery channel for an array of other advanced, value-adding Fiserv solutions.Reporting Relationships:Reports To:  Manager, ConversionsPeers:  Conversion Programmers and Conversions AnalystsDirect Reports: None.Essential Job Responsibilities:  Develop source code to address the application specification requirements as defined by the Conversion Analyst(s) and the technical attributes of the application.\nProgram, test, debug, and review the field level conversion requirements and verify converted data, balancing requirements and any reporting to achieve the goal of the Conversion Analyst to verify the conversion results and the Client to interpret and understand the data conversion results, warnings and balancing of their portfolio.\nDevelop, test and execute ad hoc reports/scripts and updating custom logic as needed in a timely and highly accurate manner.\nProvide conversion weekend coverage and on-call duties. Provide technical backup of peers and leadership to others as needed.\nStrive to ensure production conversion events are executed flawlessly without jeopardizing Client’s first day live experience.  Any issues are addressed and corrected as quickly as possible to limit end-user impact.\nProactively communicate on all areas of responsibility and project events. Ensure team members, project manager and your resource manager are aware of any issues, risks or concerns that may impact projects, clients or team member activities.  Take ownership of your application(s) communications to maintain an open regular dialogue with all parties involved.\nWork with Conversion Analyst to identify any procedures that may be questionable or in need of clarification to reduce risk of confusion or misinterpretation.\nMaintain a strong awareness of how your tasks interact with other associates and deliver all dependencies on time and accurately.\nDevelop and maintain software to company standards, software development methodology and conventions. \nDocument your program functions and event related activities/processes to ensure quality, repeatability and continuous improvement opportunities.\nInteract with other departments in a positive, constructive manner in order to accomplish tasks and overall job responsibilities.\nPromptly complete administrative tasks as required such as time reporting, project status tracking and billable requests.\nOther duties as assigned by the manager.The above statements are intended only to describe the general nature of the job, and should not be construed as an all-inclusive list of position responsibilities.Required Qualifications:EducationMinimum of a Bachelor’s degree with computer/IT related major preferred.  Equivalent work experience and/or Associate Degree may be substituted if applicable to job responsibilities; or\nA four year degree with a non-computer related major and IT–related certification(s) of completion from an accredited data processing school, university or program; or\nOther schooling/certifications supported with 3-5 years relevant programming experience may be considered and/or application knowledge if applicable to job responsibilities.Job Related Experience\nProgramming knowledge/skills or experience in COBOL and/or SQL\nMS Office Suite and strong Excel skills\nDatabase development experience, SQL, queries, SSIS, or other relational database skills\nStrong troubleshooting/problem solving experienceAdditional Requirements\nStrong time management, organization skills and ability to function independently with minimal oversight\nExcellent communication, follow-up skills and attention to detail\nMust be available to work weekends and provide on-call support (Approx. 15% of weekends)Preferred Qualifications:Preferred Technical Experience:\nA minimum of 5 years programming or related experience in a financial and/or Unisys environment.\nExperience in conversions or product implementations involving heavy data analysis, mapping and manipulation\nProgramming knowledge/skills or experience in Unisys COBOL, T-SQL, Visual Studio, TFS, DMSII, VBA, Excel, and/or PROGENI\nExperience or demonstrated ability to train and mentor others\nKnowledge of Cleartouch or Fiserv products, tools or processesPhysical Requirements:Repetitive use of hands (keyboarding, notetaking)\nInvolves long periods (6 or more hours) of sitting at computer/desk; Multi-day client review sessions\nCarrying items (boxes, laptop, etc., 10-30 lbs.)Work Environment:Weekend work required during conversion events. \nOn-call support required during conversion events and occasional periods during preparations, test runs or special requestsThank you for considering employment with Fiserv.  Please:Apply using your legal name\nComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).What you should know about us:Fiserv is a global fintech leader with 40,000-plus (and growing) associates proudly serving clients in more than 100 countries. As a FORTUNE™ 500 company, one of Fast Company’s Most Innovative Companies, and a top scorer on Bloomberg’s Gender-Equality Index, we are committed to excellence and purposeful innovation.Our commitment to Diversity and Inclusion:We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Warning about fake job posts:Please be aware of fraudulent job postings that are not affiliated with Fiserv. Fraudulent job postings may be used by cyber criminals to target your personally identifiable information and/or to steal money or financial information.Any communications from a Fiserv representative will come from a legitimate business email address. We will not hire through text message, social media, or email alone, and any interviews will be conducted in person or through a secure video call. We won’t ask you for sensitive information nor will we ask you to pay anything during the hiring process. We also won’t send you a check to cash on Fiserv’s behalf.If you see suspicious activity or believe that you have been the victim of a job posting scam, you should report it to your local law enforcement.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}