{
    "Job ID": "69872809",
    "Description": "Prime Function:Brand:Be fully conversant with the brand, its standards and its DNA (visual and written communication, product, service, distribution e.g. brand Packages)\nManage brand compliance for the Mercure Hyderabad KCP to grow the equity of the hotel and outlet brands and the brand equity across all channels\nManage all marketing/promotional/sales collateral development/production both on and off line.Communications / Public Relations:Manage a fully integrated communications calendar for the Mercure Hyderabad KCP around events, food and beverage, public holidays, and need periods.\nEstablish and maintain a relationship with Key local press and local media.\nLiaise with the regional Communications team to maximize communications exposure.\nEnsure all visual and written communication (internal/external, offline/online) is fully aligned with the hotels positioning and brand.Sponsorship:To identify opportunities to further expose the hotel and maximize revenue opportunities through sponsoring local sport/cultural/art events that are aligned with the hotel positioning and are sound in delivering a strong ROI\nDrive the marketing and communication (internal and external) of the Hotels CSR commitments.E Marketing:Effectively manage the hotel’s content and images through conducting regular website audits\nProactively explore all online opportunities for the hotels including but not limited to; local business opportunities, city/regional tourism organizations.\nManage the hotels’ website – traffic and revenue generation, promotional content display.\nManage the hotel email database and e communication activity.\nManage online advertising for the hotel (display banners, SEM/PPC etc)\nManage the online promotion for conference and catering and food and beverage activity at the hotel.\nSet-up, manage social media accounts and sharing sites as relevant to the hotels markets (Facebook, Twitter, You Tube, Flickr etc) and develop social networks\nMonitor various media for positive and negative comments and discussions about the Hotel (Tripadvisor, Blogs, Forums). Take part in conversations and answer comments as a mediator.\nReport to appropriate parties negative comments and discussions\nIdentify threats and opportunities in user generated content surrounding our Hotel\nRecommend new alternatives or ideas to develop the Hotel’s online marketing strategiesQuality:Ensure that all tools and procedures are in place to engage guests in Guest Book (the Accor Guest Satisfaction Survey)\nRegularly monitor the Mercure Hyderabad KCP Guest Book Dashboard and communicate with all the team. Ensure actions are put in place by the hotel to improve below standard scores.\nBe fully au fait with the brands audit criteria .Hygiene / Personal safety / Environment: Ensures that the workplace and storage areas remain clean and tidy across the hotel.\nRespects the instructions and safety guidelines for the equipment (s)he uses\nApplies the hotel's security regulations (in case of fire etc)\nApplies the ISO 9001 quality certification requirements that impact his/her role\nRespects the hotel's commitments to the \"Environment Charter\" (saving energy, recycling, sorting waste etc) and  environmental commitments as applicable to the role, if the hotel is involved in the programme.Minimum of two years experience in a similar role in a Hospitality.\nProjects professional image at all times through personal presentation / interpersonal skills.\nDemonstrated ability to prioritize tasks and excellent time management skills\nExcellent working knowledge of Microsoft office applications\nKnowledge of Opera, preferred\nSelf motivated with a can do attitude\nInitiates contact and establishes rapport easily.\nAppreciates and maintains an effective outlet for stress.\nExcellent numeracy, verbal and written communication skills.\nHas the ability and willingness to undertake further development.\nDevelops and maintains co-operative working relationships.\nFlexibility to work outside of normal business hours, as the business requires;Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}