{
    "Job ID": "69872871",
    "Description": "As a Senior Project Manager, you'll participate in projects and provide support for various initiatives and any associated business transformation projects. You may be involved in multiple projects or initiatives, working across the whole project lifecycle, researching new projects, business process changes, configuration changes or system modifications. Through strong partnership with Business, Operations and Technology counterparts, you'll work on project deliverables. Primary areas of focus will include eliciting project or initiative requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use cases, scenarios, business analysis, and task and workflow analysis. As a Senior Project Manager, you'll critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs. Additionally, you'll assist in the overall coordination and management of the program, including status, scorecards, and other key project management functions.Responsibilities:Facilitate project plan development, resource management, requirements management (elicitation, documentation, prioritization, etc.), process mapping, process design, procedure authoring, org design, capacity sizing, etc.\nDevelop and maintain partnerships with business and technical stakeholders to manage deliverables, executive reporting and presentations / demos\nConduct data analysis, data collection, and synthesis to translate into empirical solutions or evidence that can optimize project reporting\nWork with business partners to design, introduce, or re-engineer existing processes and business applications\nConduct project planning and analysis, including creating detailed project plans, documenting business requirements, detailing issues and problems, and drafting business and technical work/data flows\nFacilitate or support project facilitator, create materials for presentation, and provide reporting/metrics as require\nEstablish and maintain processes / timelines / plans for managing deliverables and scope during the project lifecycle, while setting quality and performance standards and assessing risks\nEnsure standardization and maintenance of processes, artifacts and technical deliverables across the team’s projects for knowledge sharing and management\nManage communications with leadership through reporting and presentations regarding project status, outcomes and highlights\nProvide ongoing insights and feedback to the team on leadership priorities and requirementsQualifications:Bachelor's degree required\n5 - 10 years project management / business analysis experience\nExcellent communication and presentations skills across various stakeholders and senior management\nIntermediate/Advanced experience using Microsoft Office, including Excel, Visio and PowerPoint\nExcellent analytical and logical thinking to understand and analyze complex business processes\nStrong organizational and prioritization skills, detail-oriented, and strong interpersonal skills\nEnd-to-end project management experience, including scoping, business case development, implementation, and change management\nAbility to analyze and resolve project-related issues and follow through with set objectives\nAbility to deal with different stakeholder groups to elicit business requirements, procedures, and processes\nAbility to work in a fast-paced environment, be flexible, follow tight deadlines, organize, and prioritize workJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}