{
    "Job ID": "69873052",
    "Description": "The Finance Reporting Analyst is an entry level position responsible for assisting in the generation, analysis, and submission of financial reports, in coordination with the broader Financial Reporting Team. This role is within the Compensation Accounting Team in FRSS Mumbai supporting Month End Accrual Process for all International Regions - Asia, EMEA and LatAm.\nResponsibilities:Assist with closing the books and sub-ledgers, including passing appropriate required adjustment entries and consolidating financials at the end of each accounting period\nEnsure all accruals and adjustments are accurately calculated and posted within established timelines\nEscalate problems or issues related to transactions, processes, reports, or procedures as well as monitor progress/changes and keep senior leadership informed of unusual financial details\nAdhere to both regional and global procedures and rules, such as global policies, change control, methodologies, etc.\nWork with a team to identify and implement process improvement initiatives or standardizations\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Qualifications:Previous relevant experience preferred\nExperience in accounting management\nConsistently demonstrates clear and concise written and verbal communication skills\nDemonstrated working knowledge of related industry practices and standards\nDetail oriented\nAbility to work unsupervised and adjust priorities quickly as circumstances dictateEducation:Bachelor’s Degree/University degree or equivalent experienceThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}