{"Job ID": "69872896", "Description": "MENATI Aquaness Sales ManagerWould you like to shape our sales strategy?Would you enjoy working in a dynamic role responsible for sales growth?Join our dynamic Sales TeamOur Aquaness Upstream Chemicals ensures that our customers have the products they need to perform effectively and safely. Our team ensures solutions for our customers so that they can function efficiently and perform at the highest level. We provide technical and service solutions to help with all their challenges.Partner with the bestAs a MENATI Aquaness Sales Manager you will take ownership for the sales and commercial effort for new and existing customers within the MENATI region. You will be responsible for developing sales culture and upholding sales processes while building urgency and improvement daily.In this role, you will be responsible for:·Providing local leadership on HSE & Quality and ensure safe execution·Building and supporting a trusted team dedicated to winning profitable market share·Building, documenting and maintaining a healthy sales pipeline.·Creating a culture of accountability and transparency to ensure we are progressing all opportunities towards a win·Ensuring we are making good commercial decisions while meeting profitability and compliance expectations·Enabling sales and distribution including training, go to market strategies, marketing material and other sales and commercial supportFuel your passionTo be successful in this role you will:·Have a Bachelor's degree or equivalent work experience·Have a minimum 5 years of chemical sales with Oil & Gas·Be able to demonstrate project management skills and be experience in project leadership·Be a natural communicator with the ability to motivate and inspire large teamsWork in a way that works for youWe recognize that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too. In this role, we can offer the following flexible working patterns:·Occasional home working possible·Starting early / finishing early·Starting late / finishing late·Working flexible hours - flexing the times you work in the dayWorking with usOur people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.Working for youOur inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. We prioritize rewarding those who embrace change with a package that reflects how much we value their input. Join us, and you can expect:·Contemporary work-life balance policies and wellbeing activities·Comprehensive private medical care options·Safety net of life insurance and disability programs·Tailored financial programs·Additional elected or voluntary benefitsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}