{"Job ID": "69873477", "Description": "Job Title: Data Platform Engineer Integration PlatformsLocation: HyderabadRole PurposeAs a Data Platform Engineer Integration Platforms, you will take advantage of your prior experiences and possess a strong ability to design (architect), build (engineer), and maintain (run) integration platforms used across the Digital Teams by developing and implementing sound processes, procedures, and the necessary documentation to ensure that each platform is maximized for the operational efficiency, availability and meets the technical and regulatory requirements for the Integration users.The Data Platform Engineer is additionally responsible for ensuring all the platforms are kept up to date with the latest software and security. Your strong and broad technical background encompassing both cloud native and data center hosted solutions along with the underlying operating system, database, network, security, and other various development and system integration principles and techniques will enhance your ability to be successful in this role.This is a highly visible position, and you will be a key contributor to how we modernize our platforms and change how we think about the solutions we apply. To be successful, you must have a deep understanding of file transfer capabilities, application integration patterns, and principles. You will be a key member of the team and must be comfortable driving technical ideas and communicating with both technical and non-technical individuals across the organization.  Roles & ResponsibilitiesDesign, build, implement, and maintain integration platforms critical to the Sanofi Digital Data Team.\nEstablish best practices for various integration platforms' performance, security, and resilience to failure.\nContinuously analyze the performance and features of the various integration platforms enabling additional capacity and new features required for the business projects.\nGain an understanding of the current state of our integration platforms and then define future state architectures and execute the strategy.\nDesign platforms using automation tools such as Terraform, Ansible, and Shell for all phases of the solution’s lifecycle.\nDevelop and document best practices around the integration platforms incorporating feedback from across the organization.\nEnsure proper change management processes and procedures and regulatory and quality processes are followed.\nPerform technical reviews of projects utilizing the integration platforms to enforce standards and best practices of each platform and promote sound governance of its usage.\nBoth contribute to and develop various dashboards and reports to gain insights into the performance and utilization of the platforms to improve operational effectiveness, future needs, and governance.\nMaintain a strong cross-functional relationship with the various project and operational teams, continually sharing new features, functionality, process improvements, lessons learned, and other best practices across the team.\nActively contribute to the Digital Data Community.About youWork Experience5+ years of progressive experience working on enterprise integration platforms.\n2+ years with Informatica PowerCenter.\n2+ years with Informatica iPaaS and/or IDMC and/or IDQ and/or CDGCTechnical SkillsStrong Informatica iPaaS capabilities. This position is responsible for designing and maintaining the existing Informatica iPaaS product and modules such as Informatica Enterprise MFT, Informatica Cloud Application Integration, and Informatica Cloud Data Integration.\nKnowledge of enterprise integration design patterns and data engineering best practices.\nExperience with AWS data-related services such as EMR, Glue, S3, and Lambda.\nExperience (and enjoyment) working with emerging technologies.\nExperience with automation and DevOps capabilities such as Terraform, Ansible, and GitHub.\nKnowledge of AWS is a plusMinimum required skillsExperience working with a variety of cross-functional teams\nAble to work in a fast-paced, constantly evolving environment and manage multiple priorities\nPragmatic and capable of solving complex issues\nService-oriented, flexible team player\nAttention to detail & technical intuition\nExcellent written, verbal, and interpersonal skills for executive-level communication and collaboration\nExperience in the bio/pharmaceutical industry is a plusMinimum preferred skillsStrong Regulatory Experience (GxP, Sarbanes-Oxley, French Data Protection Act (FDPA), General Data Protection Regulation (GDPR)\nGood knowledge of AWS/Cloud Computing (Knowledge of Azure or GCP a plus)\nExperience (and enjoyment) working with emerging technologiesEducationBachelor’s Degree in Science or Information Management with a focus on Engineering.\nMaster’s Degree in Computer Science or Engineering is preferred.Pursue progress, discover extraordinaryBetter is out there. Better medications, better outcomes, better science. But progress doesn’t happen without people – people from different backgrounds, in different locations, doing different roles, all united by one thing: a desire to make miracles happen. So, let’s be those people.At Sanofi, we provide equal opportunities to all regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity.Watch our ALL IN video and check out our Diversity Equity and Inclusion actions at sanofi.com!At Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}