{
    "Job ID": "69874014",
    "Description": "Our client is a renowned luxury floral boutique that epitomizes opulence and elegance. Specializing in the delivery of fresh flowers, long-life roses, and exquisite gifts, we have established a reputation for offering the finest floral arrangements and exceptional service. We are in search of a talented Social Media Marketing Specialist to curate our online presence, craft captivating luxury content, and personally capture the beauty of our stores.As theSocial Media Marketing Specialist , you will play a pivotal role in elevating our brand's online identity and showcasing the exquisite beauty of our floral creations. In this multifaceted role, you will be responsible for developing and implementing comprehensive social media strategies, creating visually stunning content, and personally visiting stores to capture the essence of luxury brand.Key Responsibilities:Social Media Management:\nDevelop and execute a strategic social media plan aligned with our luxury brand image.\nManage and curate content across various social media platforms (Instagram, Facebook, TikTok, etc.).\nCraft visually captivating posts, stories, and reels that showcase our premium floral arrangements and gifts.\nFoster engagement with our audience and respond to customer inquiries and feedback promptly.\nLuxury Content Creation:\nCreate and curate high-quality, luxury-focused content, including images and videos.\nVisit our stores to personally capture and direct photoshoots that highlight the essence of our brand.\nCollaborate with photographers, videographers, and designers to ensure the creation of stunning visuals.\nMaintain a content calendar to ensure consistent, high-impact content delivery.\nBrand Enhancement:\nEnsure the luxury and elegance of our brand are consistently reflected in all digital communications.\nUphold brand guidelines and standards across all online platforms.\nCollaborate with the design team to create visually appealing marketing materials.\nAnalytics and Optimization:\nMonitor and analyze the performance of social media campaigns.\nProvide insights and recommendations for optimizing strategies based on key performance indicators (KPIs).\nStay updated on industry trends and incorporate best practices into our social media efforts.\nStore Visits:\nVisit our stores to capture authentic, compelling content that portrays the essence of our luxury brand.\nDirect photoshoots and videoshoots to showcase the beauty of our physical locations.\nCoordinate with store staff to ensure a seamless shooting experience.Qualifications:Bachelor's degree in Marketing, Communications, or a related field.\nProven experience in social media management and content creation.\nStrong photography and videography skills.\nAesthetic sensibility with an appreciation for luxury aesthetics.\nExceptional writing and editing skills.\nProficiency in social media analytics tools.\nCreative thinking and a passion for storytelling.\nStrong organizational and time management skills.\nExcellent interpersonal and communication skillsIf you are a creative individual with a passion for luxury aesthetics, a keen eye for visual storytelling, and the ability to capture the essence of our brand through social media, we would love to hear from you. Apply with your most updated CV, highlighting your relevant experience, and a link to your portfolio showcasing your work.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}