{"Job ID": "69873139", "Description": "The Testing Intermediate Analyst is a developing professional role. Deals with most problems independently and has some latitude to solve complex problems. Integrates in-depth specialty area knowledge with a solid understanding of industry standards and practices. Good understanding of how the team and area integrate with others in accomplishing the objectives of the subfunction/ job family. Applies analytical thinking and knowledge of data analysis tools and methodologies. Requires attention to detail when making judgments and recommendations based on the analysis of factual information. Typically deals with variable issues with potentially broader business impact. Applies professional judgment when interpreting data and results. Breaks down information in a systematic and communicable manner. Developed communication and diplomacy skills are required in order to exchange potentially complex/sensitive information. Moderate but direct impact through close contact with the businesses' core activities. Quality and timeliness of service provided will affect the effectiveness of own team and other closely related teams.\nResponsibilities:Conducts initiatives related to User Acceptance Testing (UAT) process and product rollout into production. Testing specialists who work with technology project managers, UAT professionals and users to design and implement appropriate scripts/plans for an application testing strategy/approach. Responsibilities may also include software quality assurance testing.\nConducts a variety of tests and analyses to ensure that systems and or applications meet or exceed specified standards and end-user requirements.\nWorks closely with key stakeholders to understand business and functional requirements to develop test plans, test cases and scripts.\nWorks complex testing assignments.\nExecutes test scripts according to application requirements documentation.\nIdentifies defects and recommends appropriate course of action; performs root cause analyses.\nCoordinates multiple testers and testing activities within a project.\nRetests after corrections are made to ensure problems are resolved.\nDocuments, evaluates and researches test results for future replication.\nIdentifies, recommends and implements process improvements to enhance testing strategies.\nInterfaces with development teams if clarification is needed on requirements or to convey test results.\nExhibits good understanding of concepts and principles in own technical area and a basic knowledge of these elements in other areas.\nRequires basic understanding of how own area integrates within IT testing to achieve objectives.\nMakes evaluative judgments based on analysis of factual information.\nParticipate in test strategy meetings,\nHas direct impact on the team and closely related teams by ensuring the quality of the tasks services information provided by self and others.\nResolves problems by identifying and selecting solutions through the application of acquired technical experience and guided by precedents\nRequires sound and comprehensive communication and diplomacy skills to exchange complex information.\nProvides informal guidance to new team members.\nPerforms other duties and functions as assigned\nAppropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.Skills:10-12 years experience of Testing within Financial Service industry\nStrong Banking (Wealth Management) domain knowledge. \nFunctional and Technical expertise. \nHands-on Automation experience. \nWorks as SME\nStrong knowledge and hands-on experience of Java/J2EE, Spring MVC, Python, SOAPUI/Postman, Selenium, API and VBA.Education:Bachelor’s/University degree or equivalent experience-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}