{
    "Job ID": "69873156",
    "Description": "Nielsen Global Media is a global independent measurement and big data analytics company focused on your future. We explore audiences everywhere—uncovering and discovering what they want—so businesses can make media that counts.We are looking for a Middleware engineer who likes to work on cutting-edge technologies in an environment that gives you the autonomy to explore, learn, and adopt. Join a team of highly skilled global engineers working in an agile environment, and you will be responsible for helping to create and maintain middleware microservices and related infrastructure.ResponsibilitiesBuild and maintain Java middleware services that support frontend applications\nWork with global team members to coordinate feature development\nEnsure application monitoring systems are designed to provide necessary application performance and dashboard reports.\nProvide implementation and support for DevOps/Continuous Integration\nLeverages fluency in technical languages, operating systems, application programming interfaces, and troubleshooting.\nDemonstrates knowledge of system information dependencies and end-to-end application transaction competency.\nResolves support issues involving production systems.\nInterfaces with business solution teams and partners on operational platform events as well as solution design needs.\nDocument and manage SOPs for software and information platform systems.Qualification4+ years of experience with Java applications in a cloud environment\nExperience in Java/J2EE. JSON, REST API/SOAP UI/Web Services/APIs, XSL, XSLT, YAML development\nExperience in Continuous Integration and Continuous Deployment methodologies\nBasic Database troubleshooting technique experience.\nDemonstrates basic knowledge of infrastructure subcomponents and interoperability including (but not limited to) network (application routing) and compute platforms.\nAbility to work well in a fast-paced environment under deadlines in a changing environment.\nA bachelor’s degree in computer science or related fields, or equivalent work experience\nUnderstanding of Cloud Native application architectures and platforms\nApache Tomcat platform experience a plusNice to have skillsExperience specifically with AWS.\nAbility to code well in Python, React.JS, NodeJS or willingness to learn\nExperience with Docker and Kubernetes\nHistory of open source contributionsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "General Engineering Consultancy",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}