{
    "Job ID": "69876344",
    "Description": "Account Executive, BrandResponsibilities:Play a major role in the research, planning, and development of comprehensive public relations campaigns. \nServe as daily client contact; develops and maintains good client and partner agency relationships\nManages smooth, daily running of account while adapting quickly and remaining calm on the fast-paced account \nPartners with cross-practice and cross-agency teams (creative and strategy) and committed to delivering solutions for clients \nProactive individual who isn’t afraid to take initiative – is able to anticipate next steps and figure out where and how to find solutions, while supporting account leads \nUnderstand key client information, including business strategy, industry issues, products and services, key customers, and competitors \nProvide client service administration, including preparing client status and activity reports, attending meetings and conference calls, compiling media and competitor coverage, coordinating media outreach and press tours, scheduling, and logistics  \nDemonstrate proficiency in writing skills to craft internal and client correspondence, communications plans, press materials, new business proposals, etc. \nDemonstrate tactical proficiency in media relations, including creating and driving outreach plans, message development, management of events, effective pitching, and training of spokespersons on speeches and presentations and growth of contact network. \nHelp mentor, coach and support team members and ensure you and your staff are constantly developing abilities through Edelman University and other training, including on-the-job training and mentoring. \nBuild network of industry clients and participate in relevant professional organizations and networking activities that will grow Edelman brand recognition and your own reputation. \nContribute to new business process, including identifying new business opportunities. \nParticipate in cross-practice and cross-geographical teams to provide clients and prospects with the most compelling team and proposal. Basic Qualification:Minimum 6 months to a year of total experience in public relations and/or related fields including research, advertising, media, and publishing.Preferred Qualification:A Master's degree in a related field and a proven ability to manage large projects as well as small teams on one or more sizable accounts.\nA comprehensive understanding of his/her clients’ businesses and their missions, as well as their key stakeholders: consumers, employees, investors, regulators, media, vendors, partners, and other businesses/organizations, etc., and will be able to impart this knowledge to account team members.\nExcellent written and verbal communications skills and a demonstrated ability to delegate tactical assignments and accurately judge and edit the work of others.\nThe ability to work with senior staff to develop and execute communications plans based on client goals.\nFamiliar with best practice communications tactics and public relations tools and will be able to recommend them to his/her clients.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}