{"Job ID": "69873264", "Description": "Position: HRBP - Employee Engagement                                        Experience: 4-6 YearsLocation: Bangalore                                                                         Responsibilities & DutiesResponsible for improving the Employee Engagement Index and implementing various employee development and engagement initiatives.\nWork closely with team members to develop and implement comprehensive engagement strategies for employees.\nResponsible for executing employee connect programs improving employee relations and people experience.\nImplementation of people practices, rewards and recognition programs, and employee development programs.\nPerform internal campaigns and events [fun activities/employee connect programmers, culture campaigns, contests] to keep the team engaged and bring values to life.\nDrive culture and build feedback mechanisms into employee engagement activities and internal communications\nIdentify training and development opportunities that align with employee career growth and aspirations. Collaborate with the learning and development team to create programs that enhance employees' skills and competencies.\nPlan and coordinate employee engagement events, both virtual and in-person, to promote team building and foster a positive workplace culture. Facilitate open communication channels within the organization to keep employees informed and engaged.\nImplement wellness initiatives that support physical and mental well-being, such as fitness programs, mental health resources, and stress management activities.\nAct as a mediator in resolving workplace conflicts and address employee concerns promptly and confidentially\nRegularly analyze employee engagement metrics, prepare reports to track progress, and make data-driven recommendations for improvement.Preferred candidate profileMinimum 3 years of experience in Employee engagement.\nMaster’s degree in human resource management.\nProven experience in employee engagement, HR, or related roles.\nExcellent communication and interpersonal skills.\nExperience in using Employee engagement tools.\nCreative and innovative approach for engagement strategies.\nStrong understanding of organizational behavior, psychology, and HR best practices.\nAbility to work collaboratively and build relationships at all levels of the organization.\nCertifications in HR or employee engagement (e.g., SHRM, CEBS) are an added advantage.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Navi Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}