{"Job ID": "69874347", "Description": "Job Description:The Fund Accountant is responsible for overseeing the financial operations and reporting of investment funds. They ensure accurate and timely investor reporting, manage VAT returns, maintain compliance with Anti-Money Laundering (AML) regulations, understandand support the year-end audit process, calculate Net Asset Value (NAV), provide compliance reports, and liaise with investors. The Fund Accountant also reviews fund expenses, distributions, and drawdowns, and develops processes for investor communications.Responsibilities:Oversee monthly and quarterly investor reporting, ensuring accuracy and timeliness.\nPossess knowledge of the evaluation life cycle of a fund.\nEnsure fund administrator reporting reflects accurate business insights.\nManage monthly and quarterly VAT returns.\nPrepare the financial statements of Investment entities/Assets Management Company.\nSupport the year-end audit process.\nComplete Net Asset Value (NAV) calculations.\nProvide compliance reports to ensure adherence to regulatory requirements.\nLiaise with investors to address queries and provide the necessary information.\nReview expenses, distributions, and drawdowns of funds.\nDevelop and uphold processes for external and internal investor communications and demands.Job Qualifications:CA/ACA/ACCA/CIMA qualification.\nBachelor's degree in Accounting and Finance.Skills:Preferably 5-10 years of experience in a related position.\nAdvanced Excel skills and PowerBI knowledge\nKnowledge of DFSA (Dubai Financial Services Authority) and ADGM (Abu Dhabi Global Market) regulations is mandatory.\nGood interpersonal skills to collaborate with various stakeholders.\nExcellent attention to detail to ensure accuracy in financial reporting.\nGood time management skills to meet deadlines effectively.\nAbility to multitask and prioritize tasks efficiently.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}