{"Job ID": "69873693", "Description": "For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose-built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,900 companies and have detected 100 Million threats/day. We work in a fast-paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrives on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference.The Talent Sourcer will report to the Manager, Talent Acquisition will serve as a dedicated resource to build and manage our India candidate pipelines. The Sourcer will play a key role in our recruitment strategy and efforts as they help to build a strong pipeline of talent through innovative and proactive search techniques.\n\nZscaler has spent years building groundbreaking technology that’s improving the security posture of enterprises around the world. And while engineering teams have been building great Zscaler products, our G&A teams have been building Zscaler into a great company. The members of our GA teams have been working together to recruit the right people,\ncreate the right culture and environment, and build a solid financial and legal foundation—all of which has brought us to an incredibly exciting stage with a lot of momentum driving us forward. Join us and you, too, will have the opportunity to be a part of the excitement and contribute to Zscaler’s growth and success in meaningful ways.\n\nResponsibilities/What You’ll Do:Creatively source for talent, using various tools such as LinkedIn, job boards, search engines, and social networking.\nWork closely with Recruiting and Hiring managers to identify key talent and evaluation of candidate skills against specific requisition descriptions.\nConduct phone interviews to pre-qualify candidates.\nDevelop and execute campaigns to attract active and passive job seekers.\nCreate and maintain a pipeline of top talent for existing and forecasted requisitions.\nReview resumes for appropriate skills, experience, and knowledge that are relevant to our position requirements.\nMaintain accurate and thorough documentation within the company’s candidate database.\nMust be comfortable sourcing and identifying candidates throughout IndiaMaster’s Degree preferred or Relevant Degree\nShould have 4-6 years exp in recruitment.\nA positive, can-do attitude\nOutstanding written and verbal communication skills\nAbility to overcome challenging circumstances and still meet deadlines and deliverables\nExcellent organizational skills & multi-tasking skills\nFlexibility and ability to quickly change directions\nDemonstrated integrity, maturity, professionalism, and sensitivity even in stressful situations\nProficient with MS Office Suite, Corporate Gmail, and video conferencing\nExperience with Jobvite and LinkedIn Recruiter preferredPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \n\nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.#L1-NT1Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Chandigarh, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}