{
    "Job ID": "69875564",
    "Description": "Job Responsibilities: Data Governance Strategy and Framework:Enhance and implement the data governance short/medium and long term strategy and framework aligned with the organization's objectives and compliance requirements.\nDefine and driveadoption of data governance policies, procedures, and guidelines to ensure consistent and effective data management practices.\nEstablish data ownership and accountability across the organization, outline roles and responsibilities(data ownership, stewardship, custodian) and promote a data-driven culture.Master Data Management (MDM):Design, implement, and maintain a robust Master Data Management framework, full life cycle of data management, to govern and control the organization's critical data assets.\nDefine and enforce data quality standards and processes to ensure accuracy, completeness, and consistency of master data.\nCollaborate with stakeholders to identify and define master data domains, hierarchies, and relationships.\nMonitor and assess data quality metrics and implement remediation measures to resolve data issues.Data Governance Implementation:Oversee the data stewardship activities, including data profiling, data cataloging, data standards, and data accuracy.\nLead and manage a team of data governance professionals, including data stewards, data analysts, business units, and compliance teams, to implement data governance initiatives.\nEstablish data governance roles and responsibilities, including data stewards and data custodians, and facilitate their engagement in data management activities.\nConduct data risk assessments, identify data-related risks, and implement controls to mitigate risks.Data Quality and Standards:Ensure data quality (DQ), standards, and integrity. Own theimplementation of data quality standards related to data accuracy, consistency, completeness, and reliability. \nDefine and maintain data standards, naming conventions, and data dictionaries, meta data management, to ensure consistency and understanding across the organization.\nMonitor and measure data quality against established data standards and implement data quality improvement initiatives.\nConduct data audits and assessments to identify data quality issues and implement corrective actions.Data literacy and Compliance:Empower adoption of right data culture within Organization, uplift data maturity across all business verticals, and create awareness about the importance of data governance.\nDevelop and deliver data governance training and awareness programs to promote understanding and adoption of data governance practices.\nProvide guidance, mentorship and support to the data governance professionals and respective team members.\nEstablish data classification and data protection policies to ensure data privacy and compliance with relevant regulations (e.g. GDPR, CCPA).\nCollaborate with legal and compliance teams to align data governance practices with regulatory requirements.Ensure compliance with data protection and privacy regulations, and support the organization's data security and privacy initiatives.Education and Certifications:Bachelor’s or master’s degree in computer science, Computer Engineering, Data Management, Information Systems, or other related field.\nCertification in data management or data governance (e.g., DAMA DMBoK, DCAM, ISO 8000, CDMP, DGSP, etc.)\nCertifications or knowledge in agile delivery such as Scrum or SAFe desirable.Experience:Overall experience of 12+ years of experience in working with organizing and enhancing enterprise data through applications and databases\n3+ years of proven experience, hands on experience implementingdata governance (framework, policy, procedure) and master data management tools and technologies such as Plantir, Talend, Atacama, Semarchy, Profisee, informatica.\nWorking experience with Data lakes (e.g. BigQuery, Databricks, Snowflake, Cloudera, Teradata), Data Fabric concepts, Sematic layer(e.g. Kyvos, AtScale, LookML, dbt, Cube Lab) are desirable.\nKnowledge of regulatory requirements related to data privacy and protection.\nStrong experience in RDBMS, data modeling, ETL, ELT, MDM, SQL (Microsoft SQL, BigQuery, Oracle, MySQL, PostgreSQL, .. etc.), NO-SQL (MongoDB, Cassandra, etc).\nStrong Experience with Python, Cloud infrastructure (Azure, GCP) and DevOps (Docker, CI/CD), GIT is desirable.\nWorking experience with graph data bases and visualization tools is an advantages.\nAny working experience on Automotive, Retail, Financial sector, Customer loyalty programs, CDP tools is an advantage.Competencies:Demonstrated ability to lead teams, develop strategic goals, prioritize, allocate resources, and establish performance measurement for tracking results.\nStrong desire to learn and develop within a dynamic organization\nExcellent written and verbal communication skills for coordinating across teams.\nStrong problem-solving skills with an emphasis on product development.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}