{"Job ID": "69872676", "Description": "Job Purpose:This role will be responsible for designing & planning of HCP journeys. Experience Design & Channel Orchestration Lead will activate & scale new channels, perform cross-channel orchestration, define channel strategy, and measure channel effectiveness to craft an Omnichannel (OC) customer experience.Key Responsibilities:Customer Journey & Experience ManagementDesigns HCP journeys with the right touchpoints, frequency & sequencing, leveraging HCP 360 and behaviour-based personas; designs holistic, OC customer experience delivery ecosystem with maximized reach & impact.\nProvides overall direction for enhancing CX by analyzing business objectives and customer needs as well as developing, communicating, and implementing business strategies.\nEnsures that digital and physical interactions are consistent, using technology and digital solutions; establishes a closed loop feedback strategy to create a meaningful engagement.\nDevelops customer experience roadmap; sets prioritization rules and develops guidelines for improving customer experience. Build CX Plan with marketing team and identify development areas with OC mindset.\nMonitors the performance of various internal & external platforms like GSK owned web portal for HCPs/ 3P/ Other Brand.com pages to improve the user experience.\nProvides recommendations for content effectiveness and works on the content requirements with Content Strategist / Leads\nMake decisions and manage issues raised regarding governance which includes data privacy & security, local laws/regulations such as ETK & KVKK and ethics.\nWork in unison with Risk Management and Compliance Board (RMCB) on corrective actions as appropriateLead Consent Gathering Projects & Manage Consent Database Channel StrategyLeads channel strategy/action plan and ensures improvement in quality of customer interactions though improved cross-channel orchestration & personalization.\nIdentifies opportunities to establish new channels (voice, chatbots, social etc.) based on customer preferences and formulates strategies to scale them.\nProvides recommendations on GSK owned and non-GSK owned channels (e.g., site, email, paid social); works closely with Tech to improve channel experience and raises any risks/concerns/business implications of channel choices.Customer Insights & AnalyticsLeverages CX framework, insights from customer data & information from different channels (e.g., Sales team feedback, social media, market trends, NPS scores etc.) and external market research reports for trends to adjust customer engagement strategy.\nActs as the voice of the customer to inform brand strategy, ensuring the tactical plan successfully addresses CX challenges and opportunities.\nTracks performance of activities, customer journeys & respective channels and acts as an expert, providing suggestions to respective brand teams on how to continually optimize in coordination with OC Analytics Insights LeadCross-functional CollaborationCollaborates with cross-functional teams (Sales, Marketing, Medical etc.) to use the appropriate GSK supported tools and ensures all functions & Business partners are kept informed of certain channel/campaign objectives.\nGuides on the execution of an orchestrated customer journey\nFollow digital trends, proactively seek innovative solutions in a multichannel environment. Evaluate the macro and microenvironment and develop interpretations and vision for MC as part of marketing mix.\nMonitor the external digital landscape in the pharmaceutical industry evaluating new trends and crafting a long-term vision for the company.Why you?Basic QualificationsWe are looking for professionals with these required skills to achieve our goals:Bachelor’s Degree in Sales, Marketing, or any other related discipline. MBA preferred.  \n5+ years of directly related or relevant experience, preferably in digital marketing, brand management, omnichannel engagement, or customer experience.Preferred Qualifications:If you have the following characteristics, it would be a plus:Preferred Certifications:Digital Marketing Certifications\nData Analytics Certifications\nProject Management Certifications\nSalesforce Marketing Cloud StrategistSkills & Knowledge:Technical Skills:Omnichannel Engagement\nCampaign Management\nChannel Strategy & Management\nCustomer Journey Mapping\nCustomer Experience\nMarketing Communications\nData Analysis and Synthesis\nMarketing Analytics & Customer Insights\nUser Interface (UI) Design\nCross-Channel Analytics\nDigital Marketing\nConsent ManagementBehavioral Skills:Collaboration\nTeam Management\nPlanning\nDecision Making\nCreativity & Innovation\nNegotiation skills\nProblem solving mindsetTools Knowledge:MS Office suite\nWeb Analytics tools like Google Analytics\nCRMs like Veeva, Salesforce\nExpertise on SQLData tools like Claravine\nMarketing automation tools like SFMC, Pardot#Omnichannel#OCJourneyJob Posting End Date: 22.09.2023Why Us?GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.Contact information:You may apply for this position online by selecting the Apply now button.Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}