{
    "Job ID": "69875720",
    "Description": "FAB, the UAE's largest bank and one of the world's most secure financial institutions, is dedicated to creating value for its employees, customers, shareholders, and communities. Through innovation, agility, and differentiation, FAB is committed to fostering growth.FAB GBS India is looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting and dynamic industry. Job Purpose:Liase with business and technical stakeholders to identify new functionality that should be implemented by the domain/service/application/feature.Key Accountabilities:Generic AccountabilityProactively address issues discovered in the software components, infrastructure and scripts in the various environments\nEnsure that SDLC  procedures defined for service within the domain/service/application/feature are followed.\nEnsure that all performance and career based activities, conversations and artefacts are prepared together with the individuals, such as; Development Plan\nShare knowledge through Code Reviews and Communities of Practise opportunities across the Service Job Context:Specific AccountabilityOwner of an application or a feature within the application\nDefines and communicates a shared technical and architectural vision (including infra)\nConsult with the Enteprise Architecture practice to ensure that the service is aligned with FAB architectural patterns\nEnsure that  SDLC procedures defined for Requirements and Solution Design within the domain/service/application/feature are followed.\nDocument quality procedures for the service\nEnsure that talent is continual brought into the team through facilitating interviewing new team members including on boarding\nEnsure that all performance and career based activities, conversations and artefacts are prepared together with the individuals, such as; Development Plan\nShare knowledge through Code Reviews and Communities of Practise opportunities across the Service 7-10 years overall experience in IT starting with the hands-on engineering positions\n2-5 years’ experience doing practical design or architecture within the specialization (solutions, infrastructure, network, security, etc.)\nPractical experience and deep understanding of technology in the area of specialization, software stack, patterns and best practices\nKnowledge and experience in requirements traceability throughout the design phase, including functional and non-functional requirements\nAbility and experience in translating functional and non-functional requirements into solution/feature/component design and service architecture\nUnderstands how the business structures and functions in FAB relate to the nature of the service\nCan create a high-level and low-level design (functional and non-functional) of a single or a small collection of components or a small end-to-end service\nHas good understanding of Software Development Life Cycle (SDLC) and ensures that SDLC procedures defined for service or application are followed\nConducts / participates in code reviews, identifies bug root causes, and finds a workable solution\nParticipates in Communities\nProactively addresses issues discovered in the software components, infrastructure and scripts in the various environmentsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}