{
    "Job ID": "69874183",
    "Description": "Who are we and what do we do?BrowserStack is the world's leading software testing platform powering over two million tests every day across 19 global data centers. BrowserStack's products help developers build bug-free software for the 5 billion internet users accessing websites and mobile applications through millions of combinations of digital environments—devices, browsers, operating systems, and versions. We help Tesco, Shell, NVIDIA, Discovery, Wells Fargo, and over 50,000 customers deliver quality software at speed by moving testing to our Cloud. With BrowserStack, Dev and QA teams can move fast while delivering an amazing experience for every customer.BrowserStack was founded by Ritesh Arora and Nakul Aggarwal in 2011 with the vision of becoming the testing infrastructure for the internet. We recently secured $200 million in Series B funding at a $4 billion valuation in June 2021.At BrowserStack we solve real problems—each day is a unique challenge and an opportunity to make a difference. We strive to be open, transparent, and collaborative, so no feat is too big to achieve. BrowserStack is an extension of its people and a place where they can grow both professionally and personally. To that effect, we’re humbled to be recognized  by leading organizations around the world:BrowserStack is Great Place to Work-Certified™ 2020-21\n\nNamed “SaaS Startup of the Year” in 2022 by SaaSBOOMi\n\nRanked in Forbes Cloud 100 in 2021 - for the second time\n\nFeatured in LinkedIn Top Startups India 2018Role in a nutshell:As a Senior Associate - Marketing Operations, you will be required to meet our goals of supporting & and optimising all operations & and technology to enable effective marketing at BrowserStack. You will be helping the marketing team to execute, analyse and improve decision-making. You will also support process development, budget administration, and marketing analytics.Desired Experience:Overall 6 years experience in B2B SaaS company.\n\nAt least 4-5 years experience in marketing operations and analytics roles.\n\nMust have exposure to SQL\n\nExperience in managing external consultants in a remote setup.\n\nProven experience in working with ICP identification across different segments\n\nMust have managed marketing budgets for tech\n\nKnowledge of working with tools like ZoomInfo, LinkedIn Sales Navigator, Apollo, Rocket Reach, Lusha, Traxcn, etc.What will you do?Marketing Intelligence & Database GovernanceDevelop, implement, and maintain account intelligence strategies to identify profitable, high-potential accounts, and garnish and retain the customer base\n\nIntegrate data from multiple sources into a unified intelligence platform, and adjust database management to reflect changes, including adding new contacts and correcting inaccuracies\n\nIdentify, investigate, and document key account, market, and competitor information to build business profiles for existing and potential businesses; research and develop account-specific marketing strategies\n\nDefine and manage target audience and ideal customer persona for different products\n\nContinually work to set up systems and processes to extract, enrich and classify ideal customer persona.\n\nMonitor system performance, maintain data integrity, and ensure all systems are working properly\n\nEnsure processes are designed, documented, understood, and followed in a way that minimises bad or incomplete data.\n\nCollaborate closely with sales and marketing teams to support requests for accounts, contacts & and lead intelligence.\n\nOwn the account, contact and lead enrichment activities along with its reporting and insights\n\nDevelop a deep understanding of BrowserStack’s marketing database and help segment it for different marketing communications.Marketing Budgeting & PlanningMaintain and optimise the marketing budget and ensure all marketing costs are tracked correctly.\n\nDevelop, present, and oversee marketing budgets on an annual and quarterly basis.\n\nEnsure all budgets align with BrowserStack’s financial plan.\n\nWork closely with Business Operations, Product, Marketing & Sales, Finance, and Engineering teams to solve problems, identify trends, and define key metrics.\n\nCollaborate with marketers, project managers, and cross-departmental leadership to set budget goals and ensure they’re followed.\n\nForecast marketing budget needs throughout the year.\n\nMonitor usage of all marketing systems to meet the budget planned for the year and quarters.\n\nDevelop and maintain an accurate record-keeping system.\n\nIdentify, flag, and analyze potential financial and budgetary risks.Benefits:In addition to your total compensation, you will be eligible for following benefits, which will be governed by the Company policy:Medical insurance for self, spouse, upto 2 dependent children and Parents or Parents-in-law up to INR 5,00,000\n\nGratuity as per payment of Gratuity Act, 1972\n\nUnlimited Time Off to ensure our people invest in their wellbeing, to rest and rejuvenate, spend quality time with family and friends\n\nRemote-First work environment that allows our people to work from anywhere in India\n\nRemote-First Benefit for home office setup, connectivity, accessories, co-working spaces, wellbeing to ensure an amazing remote work experienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}