{
    "Job ID": "69875318",
    "Description": "Durée de la mission : 1 anMissions :En charge de définir l’expérience utilisateur et de concevoir les maquettes/interfaces détaillées avec des outils de design (eg. Figma, Adobe XD, zepplin..).\nCompréhension de l’expérience client et établissement d’un bon diagnostic.\nGestion du contenu et respect des règles graphiques.\nResponsable de la qualité et de l’ergonomie des applications et produits.\nElaboration du design et de l’ergonomie des produits en version Desktop / responsive / mobile .\nAnimation des ateliers de conception, prototypage des écrans web et mobiles (zoning, prototype low- fidelity, prototype high-fidelity) et de tests utilisateurs, et en prépare les supports et les reports.\nDéveloppement des prototypes tels que décrits dans la démarche globale (zoning, prototype low- fidelity, prototype high-fidelityProfil recherchéNiveau de formation : Bac+2/3 en développement informatique.\nNiveau d’expérience professionnelle: minimum 6 ans en tant que UX/UI Designer.Compétences techniques:Maîtriser les logiciels de graphisme, avoir des notions de programmation et des connaissances en webmarketing.\nApplication des méthodologies UX : recherche utilisateur, personas, parcours utilisateurs, mapping d’expérience, tests d’usabilité, etc\nEtre en mesure de faire des propositions de chartes graphiques.Compétences comportementales:Il doit avoir une force de proposition et une aisance relationnelle.\nIl doit avoir une expérience dans des projets en mode agile.Un portfolio de réalisation ou des référencements faisant preuve de livrables et réalisations produites sont demandées en attache au CV--Novancy One est leader du recrutement et staffing de profils dans les domaines des systèmes d'information et de la transformation digitale. Chaque candidat qualifié sera considéré pour un emploi, indépendamment de sa race, sa couleur, sa religion, son genre, son orientation sexuelle, son origine nationale, son handicap, son âge ou son statut de vétéran. Si vous pensez que votre candidature aurait été injustement écartée, veuillez nous en aviser par email : [email protected]. Pour consulter toutes nos offres : https://novancy.com/jobs/. Pour enregistrer une candidature spontanée : [email protected]Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Casablanca, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}