{
    "Job ID": "69873599",
    "Description": "Position : Customer Value Specialist – Pune, IndiaLocation : PuneJob requisition no. : R0059367Sandvik Coromant is the world’s leading supplier of tools, tooling solutions and know-how for the metalworking industry. We believe that engineering is the lifeblood of society - developing, changing, molding and evolving our everyday lives. New opportunity awaits as we enter the future of manufacturing. And we want you to join us!\nWe are now looking for a curious, confident and business-oriented Customer Value center Manager for Pune, India location – someone who wants to ensure successful delivery of our world class premium Customer Experience, focusing on services for today, with the needs of tomorrow in mind. Are you that someone?ScopeProvides Business Support and Services with a consultancy approach to support the strategic planning of Front Line Sales and to strengthen and develop the customer relationship and loyalty over time. The business support and value added offers are targeted towards selected accounts.ProvidesVIP customer service experience to selected customers (SAM)through Enquiry-to-post Delivery handling, securing the execution of commercial support to fulfill customer satisfaction’s expectations, or through the monitoringof KPIs and SLAs and potential issues’ resolution through dedicated projects, in coordination with relevant Sales Support Center (Operational Account Management)Main ResponsibilityInterfacing with key customersCommon company employee activities:Other important responsibilities\n• Any activity has to be carried out according to the requirements of Quality Management System and Internal Sales & Marketing Playbook.This position will report to the Customer Value Manager – Pune. The location for this position is at our office in Pune, India .Your background profile and experience\n• Good understanding of customer needs\n• High organized, flexible and multi-tasking skills\n• Be analytical and a capable problem solver\n• Up- and cross selling aptitude and approach\n• Strategic prospecting\n• Demonstrate strong planning, organizing and communication skill\n• Be a self-starter, adaptable to change with a positive mindset and solution orientated\n• Team player\n• Be persuasive and have good interpersonal skills\n• Excellent communications skills across different communication channels\n• Capable of working in a demanding environment (high stress tolerance)\n• Fluent written and verbal capabilities in one or more of the following languages:\n• Relevant experience of 3-6years\n• Preferable Bachelor degree or relevant qualifications in Business Administration or Engineering\n• Fluent English\n• Occasional travels required\n• Extensive SAP/EBP experience\n• Office365, CRM Dynamics,\n• Project Management skills\n• Business economics fundamentals\n• Core experience in Sales Operations and/or business development management, process improvements\n• Experience working in a cross functional and multi-cultural environmentYour personality inspires us!\nWith strong integrity and a great ability to lead others, you are both capable and genuinely interested in managing and motivating teams and individuals in a virtual, cross-functional and global organization. You easily create an open and trusting environment, where commitment, collaboration and results are key drivers. Being a natural communicator with sincere customer focus, you interact successfully with all our stakeholders, and you embrace any opportunity to represent our business and shape a profitable marketing position. On top of this, you bring a structured and holistic approach as you work to execute strategies and meet our objectives.\nAt Sandvik Coromant, we believe that diversity of experience, perspective and background will lead to a better environment for our employees, our business and our customers, and we are looking forward to meeting you.Application\nSend your application no later than September 22, 2023. Read more about Sandvik and apply at www.sandvik.com/career, Job ID: R0059367Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}