{
    "Job ID": "69873584",
    "Description": "IntroductionYour Role and ResponsibilitiesWho We AreIBM Z is the world’s most powerful business platform. 68% of enterprise production workloads, 80% of structured enterprise data, and 55% of all enterprise transactions, including more than 50% of the back-end transactions generated from mobile enterprise applications run on IBM Z. Before this backdrop, our team is embarking on an exciting journey to usher in the era of AIOps in zSystems Software.\nThe Position\nThe IBM Z AIOps team is seeking an experienced zSystems Software Developer to provide technical implementation and leadership as we develop an advanced approach to IT operations. As a backend developer, you will be part of a highly focused, self-managed team that designs, develops and tests cognitive insights created from Z Systems workloads and applications. The Z AIOps solutions collect availability and performance log and metric data from the z/OS operating systems and subsystems, then stream the data to endpoints for analysis, where anomalies from normal operations are identified and alerts are generated.\nYou will take technical ownership of new features and capabilities for our solution and provide architectural, design and implementation leadership for these features. In this capacity, you will work closely with the solution architecture and UX Design teams, and you will guide junior software engineers in the agile implementation of high-quality deliverables. You will drive the integration of the features assigned to you into our automated Continuous Deployment pipeline, and you will be responsible for reviewing the business value they deliver with Product Management. You will share your z/OS and subsystem expertise with the Z AIOps organization to aid in the development of advanced Z AIOps insights.\n\nWho You AreEnjoy the challenge of finding and resolving complex technical issues.\nAre curious by nature: creative by default: passionate about the promise of technology.\nValue teamwork while leading by example.\nRemember to always bring empathy to the client, team, design, or task.\nHave an interest in and understanding of modern software architectural patterns.\nHave an interest in, understanding of, or experience with Design Thinking.\nBring strong verbal and written communication skills as well as technical skills.Required Technical and Professional Expertise8+ years of professional experience working as a software developer.\nGood experience in C & Assembler.\nExperience in all phases of software development including architecture, design, coding, unit testing and functional testing.\nMainframe Domain knowledge: z/OS plus some levels of subsystem experience such as Db2, CICS, MQ and/or IMS.\nExperience working with mainframe development and debugging tools.\nExperience in the implementation of microservices-based architectures.\nExperience in Agile software development methodologies.\nExperience working in Linux environments.Preferred Technical and Professional ExpertiseExperience with Docker, Kubernetes, OpenShift.\nExperience working in z/OS environments.\nExperience with Python development.\nKnowledge of streaming technologies such as Kafka.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}