{
    "Job ID": "69873682",
    "Description": "NH Collection Dubai The Palm: Eclectic Elegance on Palm JumeirahFeel the ambiance at our exciting new hotel on Palm Jumeirah. Sitting on the exclusive West Beach, NH Collection Dubai The Palm gives easy access to the nearby Nakheel Mall and the largest fountain in the world, the captivating Palm Fountain at The Pointe.Our new property is brimming with energy and chic touches of authentic local character. The new 14-storey property is offering 227 hotel guest rooms and suites and 306 serviced apartments.Guests are just a short journey from all Dubai’s top attractions, including the Burj Khalifa, Dubai Mall, and Dubai Marina. Our sunset-facing rooftop infinity pool and its elegant bar and lounge is the perfect place to feel relaxed between exploring. Those seeking a more stimulating atmosphere can indulge at the hotel’s lively sports bar, set to be one of the new ‘go to’ spots in Dubai.As Outlet Manager you will lead the operations of a specific outlet. Your key duties and responsibilities will be to ensure profitable operations, achieve outlet business goals, accurately forecast business demands, work with management to develop & execute the marketing plan, ensure the manning schedule is up to date, oversee regular preventative maintenance, maintain outlet safety and sanitation standards, and lead by example through a 'hands on' approach to motivate team members to excel. You will also manage team member performance, identify any training needs, develop and deliver the required training for supervisors and team members in an effective way to maximize guest satisfaction and develop team members to enable them to achieve their career goals.• At least 2-3 years’ experience in the same role within UAE – Russian Speaker\n• Bachelor Degree in any related field\n• Good command of spoken and written English\n• Excellent computer skills (Microsoft Word, Excel, Outlook Express, Internet, e-mail)\n• Positive attitude with excellent interpersonal skill and strong leadershipJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}