{
    "Job ID": "69876007",
    "Description": "To develop the skills, knowledge and competencies required to enable the Trainee Engineer NDP (Trainee) to progress to ATSEP (Engineer) allowing them to maintain the availability and integrity of all ATE or ATM systems or equipment, dependent on their allocated working position within CNS.\nNote: you will be required to attach the following mandatory documents to complete your application:\n- CV\n- Passport Copy\n- Certificate copy of IELTS band 5.5 or above, EmSAT-English score of 1250 or above\n-Military exception letter (Applicable for male candidates onlyThe NDP shall meet the following International ATSEP requirements;\n• The post holder shall have as a minimum; a formal education in Electronics, a Bachelor Degree or Higher Diploma in Electronics Engineering from a recognized University or Training Establishment is preferable.subjects in English, Maths and preferably Physics.\n•A good command of the English language (written, comprehension and oral). IELTS band 5.5 or above, EmSAT-English score of 1250 or above, or equivalent.\n• 21 Year of age or over\nExperience:\n• Previous experience is not expected, however, the individual should have an interest in aviation and in particular Communications, Navigation and Surveillance radar systems\nTraining:\n• Training will be provided in 4 phases to meet the ICAO doc 9868 - Training and 10057 - Manual on Air Traffic Electronics Safety Personnel Competency-based Training and Assessment\nKnowledge:\n• Some basic technical knowledge of Communications, Navigation, Radar, ATM and other Airport Systems would be advantageous\nSkills:\nThe following personal skills are preferable;\n• Hold a valid UAE driving licence\n• Resourceful team player who excels at building trusting relationships with colleagues.\n• Good attention to detail\n• Good communication and organizational skills\n• The ability to read and interpret technical drawings and schematic diagrams\n• Computer literacy with MS office package\n Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}