{
    "Job ID": "69872741",
    "Description": "Petrofac is a leading international service provider to the energy industry, with a diverse client portfolio including many of the world’s leading energy companies.We design, build, manage and maintain infrastructure for our clients. We recruit, reward, and develop our people based on merit regardless of race, nationality, religion, gender, age, sexual orientation, marital status or disability. We value our people and treat everyone who works for or with Petrofac fairly and without discrimination.The world is re-thinking its energy supply and energy security needs; planning for a phased transition to alternative energy sources. We are here to help our clients meet these evolving energy needs.This is an exciting time to join us on this journey.   We support flexible working requests and have adopted a hybrid approach for most of our office-based roles. We ask employees to be present in the office at least three days per week.Are you ready to bring the right energy to Petrofac and help us deliver a better future for everyone?Scope of ResponsibilitiesSupervise a team of designers in the design and drafting activities, producing calculations, estimates and technical drawings in support of engineering, procurement, fabrication and construction activities.Having around 19 to 20 yrs experience in EPC environment.Primary DutiesDevelop the initial bill of material; prepare technical layouts and drawings for proposal estimation.\nReview the Technical Document Register (TDR), evaluate scope of work, number of required drawings and establish design and drafting requirements. Review Data Sheets, Piping Material Specifications (PMS), Process Data Sheets (PDS), Piping & Instrumentation Diagrams (P&ID’s), Plot plans, General Arrangement (GA) drawings, Review Philosophies, Area Classification Drawings, Fire and Gas Detector Layout Drawings, Civil/Structural Engineering Calculations, Piping Plans and Elevations, Standard Drawings, Plot Plan/Equipment Layout, Project Schedule, Project Scope of Supply, Drawing Index and other relevant documents.\nReview the Design Basis and create I/O lists, assess total number of engineering deliverables, drafting and drawing requirements, format of delivery, time schedules and other requirements for execution of the work. Evaluate development method and software requirements; AutoCAD, PDS, PDMS 3D Modeling and other relative software.\nRecommend manpower and personnel assignments for the execution of design activities within budgeted project man-hours.\nPerform calculations and layouts including 2D and 3D models with adequate dimensions necessary to assist the Engineering disciplines and Fabrication/Construction personnel including preparation of topographic layouts, earthworks/excavation drawings, boreholes locations, fencing, paved roads and drainage, underground piping and foundations, architectural and conceptual building drawings, control room layouts, substation layouts, machinery shelters, service platforms, pipe racks, pump foundations, vessel and vessel platform foundations, columns and other civil/structural drawings.\nPerform layout clash/interface checks, identify conflicts, take corrective action in coordination with other engineering discipline inputs.\nIssue engineering drawings and layouts for Inter-Discipline Checks (IDC’s) coordinate with other engineering discipline in the integration of technical data inputs. Prepare final layouts and drawings integrating inputs provided by other engineering disciplines. Consult and make recommendations to Engineers on feasibility of design plans and layouts.\nSupply Engineers with estimates for the required quantities. Prepare material take off’s (MTO’s), review vendor drawings and design calculations, ensure vendor specifications are in full compliance with contract requirements. Attend progress meetings when required.\nPrepare final layouts and drawing for installation and construction. Provide clarification, guidance and technical support to construction and commissioning personnel. Perform design changes and alterations based on Design Change Notices (DCN’s) when required.\nPrepare “As-Built” Drawings following completion of construction activities.\nEnsure conformity of designs and layouts in accordance to Company Engineering procedures and ISO Quality Standards. Upload documents into “Documentum”, maintain and archive IDC’s, originals, checkprints and Master technical drawings in accordance to Company and quality procedures.\nPerform related duties as and when directed by Direct Supervisor.ESSENTIAL QUALIFICATIONS AND SKILLS:Associate degree or Diploma in Civil Engineering with related petrochemical experience.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}