{
    "Job ID": "69874023",
    "Description": "Head of Finance, Property CoE-(2300017179)Job:Audit, Accounting & FinancePrimary Location:Asia-India-BangaloreSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 6:49:19 AMUnposting Date:15/Oct/2023, 10:59:00 PMThe Role ResponsibilitiesJob RoleHead of Finance, Property CoE is responsible for leading the multi-location team managing the Functional cost base of c.$750m for Property.This role would partner with Property CFO and Property MT members to define and execute strategy, establish a strong financial performance and control framework, and provide independent guidance on business trends, forecasts and any other aspects.This role would lead the end to end of Property Finance within Finance Operations to expand support beyond Plan to Perform (P2P), including Record to Report (R2R) and deliver a fit for purpose, End to End (E2E) Property Finance Target state besides enhancing control, analytics, insights, and decision support services.This role will be responsible to build out the Centre of Excellence as a central utility and transitioning Property Finance activities from countries / partnerships, ensuring a best practice approach, driving enhancements in our control environment and leveraging it for driving informed decisions for Property Function across the Bank.This is a key leadership role in the management team of Global Functions Finance, Global Property Finance, Plan to Perform GPO, Record to Report GPO and would be instrumental in driving the Property Finance Transformation and Centralisation strategy.StrategyProvide strategic leadership on the significant Property Finance Transformation agenda including the Centralisation and support the delivery of FTOM for Property Finance.\nDeliver the finance value proposition to the Property MT, through a period of significant but exciting change with the evolution of New ways of working (NWoW) in the Bank.\nLead the strategic thinking on the end state Property Finance process landscape and drive the transition by ensuring complete understanding and transparency across all stakeholders.\nDrive the Property Finance Operating Model with clear roles and responsibilities, including the centralisation of various Property Finance processes, actively working with the Property CFO, Global Property Finance, Country Finance, GPO teams and 3rd party vendors (partnerships).\nLead the key transformation pillars of Property Finance Data Structure, Recharge methodology/ transparency, Planning process, Standardisation and Digitisation for Property Finance that will drive standard outcomes by integrating group, regional and country expectations alongside enhancing transparency.\nDesign, build and implement an end state GPO aligned process organisation for Property Finance and drive the prioritisation and resource allocation discussions aligned to the end state design for Property Finance team, including support for documentation of Sarbanes Oxley controls.\nLead the simplification, standardisation and transformation agenda including the Property finance systems, data flows and current reporting structure to enable seamless touchless processing and digitised reporting outcomes, thereby enhancing transparency.\nDevelop a Strategic vision and plan for the evolution of the process, covering people, operating process, policies and procedures, controls, systems, and data.BusinessThree key areas of Focus of this role:Centralisation of Finance Activities, Build Centre of ExcellenceDrive the Property Finance Centralisation seamlessly, build a sustainable, forward-looking and fit for purpose finance organisation in the form of a central utility covering the end to end of Property Finance.\nCreate and execute hiring plan, track and report milestones for workload transition.\nEnsure transition of activities from partnership and Country Finance into the newly created capability with appropriate structure, accountability.\nCentralisation of accruals, recharges, accounting advice and other Controllership activities including liaising with auditors and substantiation with Regional / Country.\nCoordinate with relevant stakeholders and ensure no impact or risk during transition with appropriate documentation.Plan to Perform - Provide Leadership on Planning, Management and Analytics of the Property Cost BaseAccountability for all P2P and R2R finance support delivery to the Property MT and Property CFO.\nDelivery and execution of annual corporate plan, budget restatement and forecasts, including recharges.\nDelivery of cost analytics MI, insights, including challenge of appropriate spend levels and cost control.\nSupport recharge calculations, bookings, analysis and Business Segment and Function stakeholder engagement to explain and challenge recharges.\nSupport the appropriate finance change agenda to maximise benefits to functions.\nActively contribute and influence outcomes partnering with the Finance leadership team to the benefit of Finance organisation and functions.\nProvide strategic finance support capability where required for Property, including constructive challenge to investments and other strategic initiatives.\nSupport the oversight of Property investments.Record to ReportEvaluate overall governance frameworks, financial and program information systems, and internal controls and practices to identify potential deficiencies or opportunities.\nLease Accounting including sub-let accounting, remediation of issues, substantiation, accounting advice, impairment and audit engagement.\nReinstatement provision Accounting including substantiation (liaising with Asset Management/valuations re: estimate updates).\nCapex Management - Fixed Asset Register for Owned properties and Investments, including substantiation and remediation of WIP and Fixed Asset Register.\nSupport centralisation of accruals, recharges, accounting advice and other Controllership activities including liaising with auditors and substantiation with Regional / Country.\nAssist with booking all Property finance journals and associated substantiation for Property financials, including SODA requests and other reallocations / recharges.ProcessesEnsure a clear end to end understanding and documentation of property finance process.\nDesign and establish the target state reporting and planning processes that will drive standard outcomes by integrating group, regional and country expectations.\nBuild a culture of continuous process improvement, standardisation of procedures and implementation of a robust control framework to optimise current state.People and TalentBuild and coach exceptional CFO aligned leads capable of delivering non-proximate finance partnering support to Functions management team and their delegates.\nBuild and sustain an inclusive performance-oriented culture which attracts and retains the best talent within and outside of GFS.\nChampion the people development agenda within P2P and R2R in the GFS.\nOwn and deliver my voice action plan in the way it provides for continuoJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}