{
    "Job ID": "69872686",
    "Description": "Aramco energizes the world economy.Aramco occupies a unique position in the global energy industry. We are the world's largest producer of hydrocarbons (oil and gas), with the lowest upstream carbon intensity of any major producer. With our significant investment in technology and infrastructure, we strive to maximize the value of the energy we produce for the world along with a commitment to enhance Aramco’s value to society.Headquartered in the Kingdom of Saudi Arabia, and with offices around the world, we combine market discipline with a generations’ spanning view of the future, born of our nine decades experience as responsible stewards of the Kingdom’s vast hydrocarbon resources. This responsibility has driven us to deliver significant societal and economic benefits to not just the Kingdom, but also to a vast number of communities, economies, and countries that rely on the vital and reliable energy that we supply.We are one of the most profitable companies in the world, as well as amongst the top five global companies by market capitalization.We are currently seeking a Lead Financial Auditor with substantial auditing experience to join our Internal Auditing Organization.  This role does not have permanent direct reports, however the Lead Auditor on any audit will have a team working for them.  Lead Auditor will be responsible for the audit team and will be the main point of contact for the client.  In terms of career progression, it is important to note that Internal Auditing at Saudi Aramco is a significantly large organization, and therefore there are significant opportunities for advancement.  There are opportunities to be promoted to (i) Group Head positions, which oversee audits and perform planning and administrative work, or perform specific non-audit functions within Internal Auditing such as Audit Committee Reporting, Advisory Services, Quality Assurance, Affiliate Coordination & Oversight, (ii) Audit Manager positions, which involves leading an audit division that would be responsible for all audits related to a Business Line, (iii) Chief Audit Executive of one of our Affiliates.  There are significant number of positions to achieve growth to the point that most auditors never leave the organization and climb the hierarchy ladder numerous times over their careers.You will be based in our corporate headquarters in Dhahran, Saudi Arabia.The Internal Auditing organization within Saudi Aramco is an independent and objective assurance and consulting activity designed to add value and improve the operations of Saudi Aramco. The Internal Auditing organization helps the organization to accomplish its objectives by bringing a systematic and disciplined approach to evaluate and improve the effectiveness of the organization’s risk management, control, and governance processes. The Internal Auditing organization provides members of management and the Board of Directors with analyses, recommendations, and information concerning the activities reviewed.  The Internal Auditing organization consists of four (4) departments:  Operational Audits, Functional Audits, Affiliates Audits, and Special Audits with three (3) audit divisions under each department.You will be required to perform the following:Review and analyze financial statements in order to identify areas which should be assessed as a part of an audit.Design, execute, document and report on audit testing of financial and reporting processes, balances, amounts and disclosures. Identify key business, financial and functional processes for identifying and assessing current and emerging risks.Plan, execute, and/or report internal audits to management.Establish the objective and scope of the audit engagement.Develop comprehensive risk-based audit programs.Responsible for the audit team and will be overseeing assistant auditors.Discuss concerns and issues with the audit client, draft field memorandums, and update client and Internal Auditing Management on progress of the audit.Prepare or assist in preparing audit reports.Deliver presentations to client’s management at the audit opening and closing meetings.Provide on-the-job training and mentoring to inexperienced or less experienced staff.Evaluate the performance and capabilities of the assisting staff auditors.Assurance and consulting activities on internal controls as requested.As a successful candidate, you will hold a bachelor's degree in accounting or finance or another related field; and preferably have an advanced degree relevant to accounting and finance.You will have a minimum of six (6) years of experience working either in external auditing and public accounting firms in the auditing/assurance practice or the financial reporting function of a publicly listed company, working with the adoption, application and presentation of International Financial Reporting Standards.You should hold a Certified Public Accountant or Chartered Accountant designation.  Additional certifications such as Certified Internal Auditor would be a plus.   You must demonstrate excellent oral and written communication skills in the English language and excellent presentation and interpersonal skills.You should be flexible to travel within the Kingdom of Saudi Arabia and/or outside the Kingdom to conduct audit and consulting engagements.Working environmentOur high-performing employees are drawn by the challenging and rewarding professional, technical and industrial opportunities we offer, and are remunerated accordingly.At Aramco, our people work on truly world-scale projects, supported by investment in capital and technology that is second to none. And because, as a global energy company, we are faced with addressing some of the world’s biggest technical, logistical and environmental challenges, we invest heavily in talent development.We have a proud history of educating and training our workforce over many decades. Employees at all levels are encouraged to improve their sector-specific knowledge and competencies through our workforce development programs – one of the largest in the world.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}