{"Job ID": "69873809", "Description": "Associate Director, Macro Structuring-(2300017355)Job:Financial MarketsPrimary Location:Asia-India-MumbaiSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 7:16:05 AMUnposting Date:30/Oct/2023, 11:59:00 PMJob SummarySupport delivery on the strategic ambitions of the Global FM Sales & Structuring business by originating and executing structured transactions within India in collaboration with regional and global stakeholders. The role would involve structuring solutions across asset classes – FX, Rates & Credit and working in close cooperation with FM Sales & Trading. ResponsibilitiesStrategyPromote the FX, Rates and Credit (FXRC) business across client segments for bespoke hedging, investment and financing trades \nResponsible for facilitating FX/Interest Rate derivatives/Credit trades in the Bank through ideas generation, pricing support, sales & external client training and calibration or testing of systems.BusinessDriving FXRC transactions from idea origination to deal execution (structured rates swaps, corporate finance FX / rates hedges, FX / FXO hedging, credit-linked notes, collateralized financing etc)\nWorking in close collaboration with client coverage teams from FM Sales and CCIB Client Coverage (Corporate, Commercial & Institutional Banking) to translate specific client needs into tailor-made solutions, including balance sheet analysis, cross-border solutions, portfolio hedging, cash flows optimizationDeliver practical and viable solutions, within several objectives and constraints, conciliating among various stakeholders:Clients : (e.g. economic objectives, hedging policies, risk appetite etc)\nBank’s resources (Credit appetite, balance sheet returns, liquidity availability, reputational risk, etc)\nMarkets and products (trading limits, market liquidity, available products and payoffs etc )\nRegulatory (Legal and compliance, tax, etc)Generating and promoting trade ideas, based on clients’ needs, markets opportunities or regulatory developments.Marketing and dissemination of trade opportunities across sales, relationship managers and clients.\nProvide pricing support to Sales for structured FX, Rates and Credit both at origination and execution levels; facilitate deal execution across FXRC where required\nSupport senior members of the team in helping them design, promote and execute bespoke derivative based solutions for the bank’s clients\nKnowledge sharing on FXRC products to internal and external stakeholders through focused training / teach-ins\nPrepare transactional documents as per internal guidelines in collaboration with Legal & Compliance\nRepresent the bank at industry forums in relation to aid market development, providing inputs on regulatory prescriptions, propose reforms etcProcessesConceptualisation and roll out of products in collaboration with the relevant teams (Trading, Quants, Market Risk, Middle-Office, Compliance, Product Governance etc).\nDesign end-to-end processes for new hedging, investment and financing platforms to address client needs while capturing the trade downstream impacts (RWA, PNL, market and credit risks etc).People & TalentWork as a team player in partnership with local and global stakeholders to deliver ideas and trades into / out of India Risk ManagementAbility to analyse situations in a neutral and balanced position specifically with regards to situations involving matters of product appropriateness, risk profile, regulatory compliance etc.\nAdherence to all Group Policies and relevant legislations covering credit, operational, reputational risk among others\nCommitment to Group Code of Conduct\nTimely completion of all e-learning, attestations and requests for informationGovernanceEnsure adherence to all internal and external regulations\nPromote an environment where compliance with internal control requirements and external regulatory framework is a cornerstone of business conductRegulatory & Business ConductDisplay exemplary conduct and live by the Group’s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nConduct the FM Structuring activities in an appropriate manner so as to achieve the outcomes set out in the Bank’s Conduct Principles: Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.\nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}