{
    "Job ID": "69872823",
    "Description": "Position title: MLOPs EngineerLocation: Hyderabad/ ChennaiJob description:Roche has established Global Analytics and Technology Center of Excellence (GATE) to drive analytics & technology driven solutions by partnering with Roche affiliates across the globe. While the candidate can join us remotely, we would require them to move to our Chennai or Hyderabad Office soon. To know more about us, visit - https://www.rocheindia.com/en/About_Roche/GATE.htmlThe MLOps Engineer will play a crucial role in ensuring the accuracy, performance, and stability of machine learning models used for forecasting and analytics. This role involves continuous monitoring, maintenance, and improvement of ML pipelines, Docker images, and data synchronization processes to support reliable predictions and decision-makingAn ideal candidate should have:Overall experience of 4-6 Years, with experience in MLOps space is a must\n\nDesign and implement cloud solutions, build MLOps on cloud (AWS, Azure, or GCP),\n\nBuild CI/CD pipelines orchestration by GitLab CI, GitHub Actions, Circle CI, Airflow or similar tools;\n\nData science model review, run the code refactoring and optimization, containerization, deployment, versioning, and monitoring of its quality\n\nData science models testing, validation and tests automation\n\nProgramming languages like Python, Go, Ruby or Bash, good understanding of Linux, knowledge of frameworks such as scikit-learn, Keras, PyTorch, Tensorflow, etc.\n\nGeneral understanding of AGILE Project Delivery process\n\nExcellent written and verbal communication skills for coordinating across teams\n\nStrong analytic mindset and logical thinking capability, strong QC mindset\n\nDemonstrates consulting, creativity, critical thinking, project planning, and attention to detail capabilities\n\nKnowledge of US/Europe pharmaceutical market and experience with pharmaceutical data would be a plus, but not a mustAs an MLOPs Engineer, you will do:1) Accuracy Analysis:Perform in-depth analysis of forecasting model accuracy\n\nIdentify and diagnose issues causing low accuracy\n\nCollaborate with data scientists to understand and rectify model shortcomings2) Performance Comparison:Regularly compare model performance against the previous month's results\n\nIdentify trends and areas for improvement in forecasting accuracy3) Pipeline and Docker Maintenance:Ensure that the production pipeline and Docker images are running with the latest model code\n\nPerform regular checks to maintain the stability of the production environment4) Development-Production Alignment:Align the development environment with the production environment every two weeks to ensure consistency5) Bug Fixing:Investigate and fix code bugs related to model deployment and data synchronization6) Data Synchronization:Maintain data synchronization processes to ensure data consistency across systems7) Accuracy Comparison:Implement accuracy comparison between past forecasts and realized actuals to assess model performance8) Affiliate Support:Collaborate with affiliate teams to understand and address their needs related to predictions and model outputs9) Understanding Predictions:Provide insights and explanations for model predictions to relevant stakeholders10) Model Performance Deep Dive:Conduct in-depth analysis of model performance, including feature importance and model behavior11) Monthly Export:Export results in a wide format for monthly reporting and analysis12) Eventing:Upload and process monthly CSV data into the database\n\nImplement eventing logic to derive insights from data\n\nContinuously improve eventing code logic for better resultsEducation:UG: B.Tech/B.E. - Any Specialization (Computer Science preferred)\n\nMaster’s Degree –   Data Science, Machine Learning, Statistics, Economics/Econometrics, Computer Science or related field- Nice to have\n\nAny certifications on AI/ML/Data science would be an added advantageAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}