{
    "Job ID": "69872950",
    "Description": "Aruba Systems Engineer - Public SectorThis role has been designated as ‘Office’, which means you will primarily work from an HPE office.Who We Are:Hewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.Job Description:HPE Arubais redefining the \"Intelligent Edge\" Aruba is creating new customer experiences by building intelligent spaces and digital workspaces - leading next-generation network access solutions for the mobile enterprise. We are focused on campus, branch, mobility and the IoT to transform businesses with the combined power of compute, context, control and secure connectivity. We help some of the largest and most exciting companies globally to modernize their networks to meet the demands of a digital future.In this role as \"Systems Engineer\", youEnsure technical product expertise, technical resources and tools are available enabling qualification and differentiation of the HPE Aruba offering within the targeted segment through appropriate understanding of customer needs. \nUnderstand and translate customer technical and business requirements into product and solution designs. \nExperiences in use case talks with end customers. \nEnsure technical knowledge is transferred to partner's sales force to enable partner driven technical presales & sales engagement. \nPrepare technical presentations and benchmarks on products. \nAlignment of technical work with channel partners to match customer requirements. \nRepresentation of HPE Aruba in relevant national Business Associations (technical partner and end-user forums) \nParticipate to Marketing activities, providing technical presales support when technical expertise is required. \nResponsible for achieving Partner Certification Targets in order to meet HPE Aruba and customer expectations. \nValidate and describe Special request from technical point of view as well as from business perspective to drive customer requirements. \nProvide technical (solutions/products/technology/competitive) feedback from partners/end-users on our solutions/products to WW R&D If you have these Skills, Expertise, Attitude and Education…Bachelor's (undergraduate) degree and/or Master's (graduate) degree, preferably in Computer engineering or the like. \n\nAt least 3 - 5 years’ experience in IT sales, presales or technical networking consulting.\n\nIn-depth knowledge of the networking market as well as knowledge on LAN / WLAN products & solutions. .\n\nVery good knowledge about wireless technologies (IEEE 802.11) and deployment strategies.\n\nVery good knowledge about authentication technologies (RADIUS, TACACS+, LDAP, SAML) and deployment strategies.\n\nIn-Depth knowledge of competitive landscape.\n\nAny certifications like HPE Aruba Certifications, Cisco's CCNA, CCNP or CCIE or equivalent qualification are highly desired.\n\nExperiences in setup and operating proof of concepts including practical configuration of networking products.\n\nA self-motivated, go-and-get approach and the will to win.\n\nStrong presentation and technical communication skills.\n\nAn organized, team worker attitude.\n\nWilling to travel and work as and when needed.#turkey#Aruba#sales#LI-HybridAdditional Skills:What We Can Offer You:Health & WellbeingWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.Personal & Professional DevelopmentWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have — whether you want to become a knowledge expert in your field or apply your skills to another division.Diversity, Inclusion & BelongingWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good.Let's Stay Connected:Follow @HPECareers on Instagram to see the latest on people, culture and tech at HPE.Job:Job Level:HPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together. Please click here: Equal Employment Opportunity.Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.HPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories. .Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Ankara, Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}