{"Job ID": "69874655", "Description": "Associate - Technology ServicesPosition SummaryPosition is to manage key project initiatives across critical functions in the ITRS organization focusing on remediation of critical vulnerabilities across various platforms and infrastructures. Perform Patching and deployments using Microsoft SCCM and Tanium.Infrastructure remediation services – External and Internal vulnerabilities, TLS , JAVA , Adobe and Microsoft patching\nRemediate key vulnerabilities in external and internal risk areas to catch up and reduce overall Kenna score\nDrive tracking and removing or upgrading key Java, Adobe, and Windows products to eliminate risk from out of date versionsKey focus on :-MS SCCM Patching & Vulnerabilities Remediation\nSoftware Configuration Management\nHardware Configuration Management\nSecurity Analytics\nConfiguration Management Database\nGlobal Security Infrastructure SharePoint\nGlobal tools remediation (Windows, Firewall, PC encryption , AV )\nAlign R&R and escalation path similar to SCCM\nFocus on remediation/troubleshooting for fixing remediation issues\nGlobal workstations patching opportunities\nDevelop scorecards and remediation prioritization / plans ( PC Vs Server )Job ResponsibilitiesManage relationships with global partners and ITRS stakeholders\n Timely delivery of the program scope for patching , deployment of tools , integration of cloud entities onto CASB products, identification and fixing of unidentified end-points, onboarding of all AD non-managed domains pushing patches and fixing of servers.Tanium deployments and upgradesKnowledge, Skills and AbilitiesEducationMCA, MSc. Computers or EngineeringExperienceAtleast 2 years in Security Operations\nExperience in Vulnerability management, Security vulnerability remediation. Patching and Deployments using Microsoft SSCM, Tanium\nHands on work experience in governance, risk management Audit and Governance activities for ITRS functions\nWorking experience of managing projects using Agile framework and methodologyKnowledge and skills (general and technical)Databases -  IBM DB2, MS SQL 2008 and 2012\nKnowledge of Operating Systems-  WINDOWS Server, Linux Server\nKnowledge of Databases- Oracle, DB2, Sybase, MS SQL Server\nIntermediate MS Office skills –  MS-Excel and Business  Powerpoint presentations is a must\nPower BI, exposure\nExcellent Communication skills\nMust process problem solving, planning, and analytical skills to drive continuous improvements\nFlexibility in working hours and handling escalation and pressure situations\nExcellent inter-personal skills with the ability to coordinate cross functionallyOther Requirements (licenses, certifications, specialized training – if required)Active Directory, Service Now, Endpoint security & Azure DevOps (Preferred)Working RelationshipsInternal Contacts(and  purpose of relationship):All Internal GOSC Stake HoldersExternal Contacts(and purpose of relationship) – If ApplicableStateside Client/ Engineers from different regional Security teams (Such as Country/Regional Head for Monitoring/Containment)MetLife:MetLife, through its subsidiaries and affiliates, is one of the world’s leading financial services companies, providing insurance, annuities, employee benefits and asset management to help its individual and institutional customers navigate their changing world. Founded in 1868, MetLife has operations in more than 40 countries and holds leading market positions in the United States, Japan, Latin America, Asia, Europe and the Middle East.We are ranked #44 on the Fortune 500 list for 2019. In 2019, we were named to the Dow Jones Sustainability Index (DJSI) for the fourth year in a row. DJSI is a global index to track the leading sustainability-driven companies.      MetLife is committed to building a purpose-driven and inclusive culture that energizes our people. Our employees work every day to help build a more confident future for people around the world.MetLife is a proud Equal Employment Opportunity and Affirmative Action employer dedicated to attracting, retaining, and developing a diverse and inclusive workforce. All qualified applicants will receive consideration for employment at MetLife without regards to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity or expression, age, disability, national origin, marital or domestic/civil partnership status, genetic information, citizenship status, uniformed service member or veteran status, or any other characteristic protected by law.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Noida, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}