{"Job ID": "69875734", "Description": "Have you ever imagined to be part of one of the biggest food companies in the world?Nourish life is our commitment. This is not limited to food production – it extends to projects, initiatives and causes we embrace. In order to deliver quality products, we have a team dedicated to innovating every day. We have more than 90,000 employees worldwide. A large team that has a global vision, without leaving aside the local needs.Each member of our team is important to make BRF one of the largest food companies in the world. We are guided by values that serve as a compass for our work. Ethics in all actions, transparency in our value chain and innovation are non-negotiable points for us.Come and join us to be part of this food giant!BRF values and promotes an inclusive and diverse culture. We consider persons with disabilities for all our opportunities.#WeareBRFJob Description·       Aylık beyannameleri düzenli ve doğru şekilde hazırlamak,·       Ay sonu vergi kayıtlarını hazırlamak ve dokümantasyon işlemlerini yürütmek,·       Uluslararası Vergi Projelerine katılmak,·       KDV iade başvurusu için listeleri düzenlemek - yüklemek ve dosya kapanış süreçlerini yürütmek,·       Resmi evrak dosyalarını hazırlamak, ve arşivlemek.Desirable requirements·       Üniversitelerin İşletme, İktisat, Ekonomi ya da ilgili bölümlerden mezun,·       İyi derecede ingilizce bilen,·       1-2 yıl vergi, muhasebe ve finans alanında deneyime sahip,·       Tercihen SAP bilgisine sahip,·       MS Office Programalarını iyi derecede kullanabilen,·       Takım çalışmasına yatkın,·       Planlama ve organizasyon yeteneği güçlü,·       Problem çözme ve analitik düşünme yeteneği güçlü,·       İletişim yeteneği güçlü,·       Bandırma’da yaşayan ya da yaşayabilecek olan.Stay tuned on our Website to be aware about all the job opportunities we have!Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}