{"Job ID": "69873259", "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.About the teamYou will be part of the Client Success team within International Markets and will work closely with peers within the Client Success team, as well as with other stakeholders and functional partners within FIS’s functional matrix model.What you will be doingWorking with different teams/Leads/Managers/individuals to make sure the non-production environments are up and running Coordinating with teams/individuals to get the work done, issues resolved and work closely with Leads/Managers as well.\nShould be able to make documents on processes and modify them to adjust for changes and keep everyone updated.\nCandidate  would need to have exp. and knowledge in managing such environments with long term goal of managing production environment.What you bringGood understanding of IT infrastructure.\nGood understanding of standard SDLC.\nKnowledge with engineering tools such as, Jenkins, Confluence, Jira or similar.\nExperience in IT Environment Management in a corporate environment.\nManage & coordinate non-production environments across multiple applications and technologies.  \nCommunicating and collaborating with QA\\Test manager, Release Manager, and technical teams on Environment requirements, delivery and support.\nCo-ordinate activities of release engineers to automate the setup and configuration of testing environments\nProvide the initial point of contact for non-production environmental issues.Would be a plus if you have:Experience in the following Applications: IST/Merchant Account & Settlement (MAS), IST/Clearing (CLR), Data Navigator, Connex &/or Webpay/Digipay\nExperience in the following Tools/Sims: Test Rail, Jira, FINsim\nISTQB Foundation Software Testing certification\nKnowledge of network message standards - AS2805 or ISO standardsWhat we offer you An exciting opportunity be a part of World’s Leading FinTech Product MNC\nTo be a part of vibrant team and to build up a career on core banking/payments domain\nCompetitive salary and attractive benefits including GHMI/ Hospitalization coverage for employee and direct dependents\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nTime to support charities and give back in your community\nValuable internal opportunities to showcase your talent on Fine Arts/Sports/Fitness etc.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}