{
    "Job ID": "69873329",
    "Description": "IntroductionYour Role and ResponsibilitiesAs a client-facing technical sales professional, you will be guided by IBM’s purpose – to be essential to its clients; help them grow their businesses by solving strategic and tactical business problems with IBM’s proven hardware, systems software and Hybrid cloud solutions. We are seeking individuals interested in making an impact in selling IBM’s Power Systems portfolio to maintain and grow existing revenue streams and relationships.Key Responsibilities:Use business insights to understand client’s business requirements, technical requirements and/or competitive landscape.\nCollaborate with IBM Technical and Services teams to define, design, and detail the aspects and feasibility of proposed integrated solutions.\nDetermine customer requirements, create configurations and proposals, respond to RFP and RFQ’s.\nWork with the technical team to deliver effective Proof of Concept (POC), Proof of Technology (POT) and support critical situations.\nActively engage with clients to develop the trust and credibility to help them grow their businesses by solving strategic and tactical business problems with IBM’s proven hybrid cloud technology solutions.\nActively engage your team with clients to develop the trust and credibility to help them grow their businesses by solving strategic and tactical business problems with IBM solutions.\nApply IBM brand strategies and offerings, methods and models, to ensure world-class design and delivery.\nApply IBM brand strategies and offerings, methods and models, to ensure world-class design and delivery.Required Technical and Professional ExpertiseExperience in Enterprise Unix & Linux Servers Solutions (Preferably AIX).\nExperience in key Enterprise ISV solutions (SAP, Oracle, Temenos, …etc)\nSolid skills and a deep understanding of Server market and competitive positioning to articulate a winning strategy.\nPossess technical and business acumen to understand the client’s business requirements, technical requirements and/or competitive landscape.\nCommercially minded and capable of supporting end-to-end sales engagements with the ability to think, plan and act strategically.\nExtensive networking and interpersonal skills in complex environments.\nSolid presentation skills and a deep understanding of Enterprise Servers technologies and how to position winning solutions.Preferred Technical and Professional Expertise\nN/AJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}