{"Job ID": "69874010", "Description": "You Lead the Way. We’ve Got Your Back.With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.At American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.Join Team Amex and let's lead the way together.Description•Candidate will be responsible for conducting analysis and generate deep Insights into Fraud RISK & Fraud Prevention (for Both Merchant & Card Member)•Develop the requirements for the creation of MIS tools and capabilities that improve the day to day performance•Liaison with Technologies team to translate MIS business requirements to technical requirement. Use project management skills to lead the development of MIS tools and processes through the software development lifecycle.•As part of the requirement process, build proof of concepts or prototype MIS solutions.•Proactively identify business trends and perform diagnostic analysis to determine key drivers.This role may be subject to additional background verification checks.Qualifications  •Strong analytic skills who is able to work with complex processes and perform complex data analysis•Able to work with large datasets and use data analysis tools to draw conclusions•Experience working with Technology organizations and managing projects through Agile methodology•Project management skills with demonstrated results in driving small to medium scale projects•Highly organized and able to simultaneously manage multiple projects and priorities•Able to effectively communicate (written and verbal), including cross-border communications•Experience working in some or all of the following processes: Credit, Fraud Prevention, Risk Management. Deep understanding of Collections Portfolio is an added advantage.•Experience on Teradata, SAS, Big Data, Hive is preferredWe back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritize their physical, financial, and mental health through each stage of life. Benefits include:Competitive base salaries \nBonus incentives \nSupport for financial-well-being and retirement.\nFlexible working model with hybrid, onsite or virtual arrangements depending on role and business need.\nGenerous paid parental leave policies (depending on your location) \nFree access to global on-site wellness centers staffed with nurses and doctors (depending on location) \nFree and confidential counseling support through our Healthy Minds program \nCareer development and training opportunitiesAmerican Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.  Offer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}