{
    "Job ID": "69873058",
    "Description": ", IndiaJob Family Group:Worker Type:Posting Start Date:Business unit:Experience Level:Job Description:Where you fit inYou will be working with Shell's Trading and Supply business, one of the world's largest energy trading operations in the world with key hubs in Singapore, Dubai, Houston, London, and Rotterdam. Based in Shell Energy Europe and Environment Products, the role supports trading across European Power, Gas, regulated Carbon and global weather markets, with a focus on the net zero agenda. The role involves exploring data sets and providing analytics to support trader decision making and offers opportunities to work with the latest technologies, top-notch professionals, and complex projects.What’s the roleDesign and implement solutions on Force.com platform\n\nUnderstand the requirement of a functional specification or user stories as well as ensure its completeness for next steps\n\nDocument technical solution design\n\nRun a quality assessment of a counterparts’ code\n\nResolve defects during test cycles and hypercare\n\nAdhere to the release and Change processWhat we need from you5-8 years total development experience and 4+ year relevant experience as Salesforce Developer\n\nGraduation in BE / BTech or other related discipline is required\n\nStrong technical expertise in Salesforce.com including lightning web components (LWC), triggers, apex classes, visualforce pages, and salesforce integrations\n\nKnowledgeable of Web Development (Ajax, JavaScript, REST/SOAP, HTTP, CSS Bootstrap)\n\nExcellent Salesforce.com (SFDC) declarative configuration skills and Data migration between SFDC environments using change sets, Eclipse or other tools\n\nExperience with version control solutions (e.g., Github, Sourcetree) as well as SSO and FAAS, ERP integration and Agile development (product backlog, user stories etc) would be good to complement\n\nAny Salesforce certification is preferred such (Salesforce developer 401 certification, or Salesforce Advanced developer 501 certification level 1)-COMPANY DESCRIPTIONShell is a global energy company where we work towards powering progress through more and cleaner energy solutions. We use advanced technologies and take an innovative approach to help build a sustainable energy future. In India Shell has its businesses footprint in Information Technology, Projects & Technology, Finance Operations, Integrated Gas, Downstream & Upstream spread across more than 7 main locations.An innovative place to workThere’s never been a more exciting time to work at Shell. Everyone here is helping solve one of the biggest challenges facing the world today: bringing the benefits of energy to everyone on the planet, whilst managing the risks of climate change.Join us and you’ll add your talent and imagination to a business with the power to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently.An inclusive place to workTo power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential.We’re creating a space, where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply, and we’ll take it from there.We’re closing the gender gap – whether that’s through action on equal pay or by enabling more women to reach senior roles in engineering and technology.We’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity.We consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.A rewarding place to workCombine our creative, collaborative environment and global operations with an impressive range of benefits and joining Shell becomes an inspired career choice.We’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible.DISCLAIMER:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}