{"Job ID": "69873469", "Description": "Job Title: Sales and Technical specialist - Round ToolsNo. of Vacancies: 1Job ID: R0058793Location: PuneFull time /Part Time: Full timeRegular /Temporary: RegularSANDVIK COROMANT is the world’s leading supplier of tools, tooling solutions and knowhow to the metalworking industry. With extensive investments in research and development we create unique innovations and set new productivity standards together with our customers. These include the world's major automotive, aerospace and energy industries. Sandvik Coromant has 9,000 employees and is represented in 130 countries. We are part of the business area Sandvik Machining Solutions within the global industrial group Sandvik. At Sandvik Coromant, we are driven by a passion for excellence in everything we do. Our belief is that sustainable success is a team effort and with our profound knowledge of metal cutting and insight into the varying challenges of different industries, we strive to develop innovative solutions in collaboration with our customers, to meet both current and future demands. We are seeking for people who are passionate in their work and possess the drive to excel to join us.Scope:Round Tool Specialist is to be a model for the organization with skills, techniques and ways to work that will drive results in round tool sales. Essentially he / she must be positive example of success in round tool sales which really means leading by example. Engagement with various stakeholders in organization and provide good insights of the market through hands-on customer work. It is very important to be active and visible with the customers and have customer first mentality. Work specifically with the cluster sales organization to execute high value sales opportunities through professional project management techniques. Support all phases of the selling cycle including reconditioning. Act as a round tool consultant and advisor for sales organization. Through all these actions being accountable and responsible for round tool sales results for the geographical territory he or she is handling. Identify barriers to the sale and remove the same.Key Performance areas:1. Actively engage in all phases of the sales process including pre-qualifying the opportunity, customer presentations, project management, follow through, service.2. Responsible for the promotion, sale and technical support end-users and authorized distributors within assigned territory.\n3. Engage with key industry stakeholders; licensors, design institutes, associations, engineering companies and end users to support field sales to technically market existing products to existing customers/applications.4. Identify new customers and application areas for future product solutions.\n5. Responsible for developing, scheduling and execution of Technical Marketing programs.\n6. Liaise with sales team to prepare, conduct and/or assist in product promotion, presentation and demonstration from technical perspective. May also provide technical training and guidance to sales.\n7. Work with cross-functional teams providing statistical and technical advice. 8. Understand both the business problems and the technical solutions. Provide assistance to other team members.9. Continuous Improvement of round tool success factors and ways of working 10. Focus on both engineered solutions and standardsRequired competencies :- Graduate degree from premier institute or equivalent experience.- 7-10 Years’ Experience in Sales / Technical Sales.- High level communication skills across all mediums- Excellent understanding of the design, application, optimization and trouble shooting of round tools- Develop the enablers of success in our offer and way of working: specials, standard assortment, channel offer, competence development, and communications.This position reports to Round Tools Sales Cluster Manager, South & East Asia.Benefits :Sandvik offers a competitive total compensation package including comprehensive benefits. In addition, we provide opportunities for professional competence development and training, as well as opportunities for career advancement.How to apply:You may upload your updated profile in PeopleSoft through your ESS login, no later than 29 September, 2023Or Please send your application by registering on our site www.sandvik.com/career and uploading your CV against JR No. R0058793 before 29 September , 2023.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}