{
    "Job ID": "69870423",
    "Description": "About Glovo:We’re a Barcelona-based startup and the fastest-growing delivery player in Europe, Africa, and Western Asia. With food at the core of the business, Glovo delivers any product within your city at any time of day.At Glovo, you’ll have the job of your life while working together towards our shared vision to give everyone easy access to anything in their city. We welcome top performers that will bring new ideas, diverse perspectives, and provide you the opportunities and freedom to grow and make a real impact on millions of lives… all while having fun!We believe that diversity adds incredible value to our teams, our products, and our culture. We know that the best ideas and solutions come by bringing together people from all over the world and by fostering a culture of inclusion where everyone feels heard and has the chance to make a real impact. It's because of this that we are committed to providing equal opportunities to talent from all backgrounds.&nbsp;Your work-life opportunity:We’re looking for a strong leader to manage the biggest region for Glovo Morocco (Grand Casablanca) &amp; own the growth of a portfolio of 6 cities &amp; top partnersWe're looking for someone who has a mix of operational prowess to get great work done, the negotiation and collaboration skills needed to bring out the best from our partners, the strategic, innovative and creative thinking that's required to develop outside-the-box solutions, and the emotional intelligence and humility required to lead a fast-paced business and inspire a team of people.Be a part of a team where you will:Lead a team in charge of managing a group of existing partners, cities and driving them to success.\nOwning the P&amp;L, as well as the key growth and profitability metrics for your area.\nWork together with the Director of Regions and the functional heads to define winning sales, growth, and operations strategies for your cities, and own its implementation.\nBuild, manage an account management dream team, help them perform and inspire them to grow\nConstantly look for ways to improve the service in your area, staying up to date in terms of news and trends, and looking after operational excellence.\nBuild, scale, communicate and maintain detailed reporting models to assist regional efforts, both on a strategic and operational level.\nAssure your team establishes excellent relationships with Glovo’s partners through consistent and proactive communication, identifying their needs and building engagement (Partner’s meetings and business reviews).\nWork hard with your team, helping and guiding them during difficult negotiations to close important deals with top chains and smaller partners\nLead by example in accordance to our values and set high standards for the team.\n&nbsp;You have:You have +6 years of experience in consulting/business development/start-up or similar.&nbsp;\nA strong track record of excellent performance delivering challenging KPIs and / or projects\nManagerial, 360 view: good understanding of all the key drivers in a business P&amp;L and how to affect them\nHighly polished communication skills - speaking, writing, presenting and negotiating. Ability to work with remote teams through clear and concise communication\nYou are willing to travel several days per month in the cities under your ownership&nbsp;\nBe an owner mindset: You are committed to growing Glovo in your cities, and digging deep to solve bottlenecks. You’re solution-oriented and don’t take no for an answer.\nAbility to balance swift pace of execution with attention to detail\nSuperior analytical skills and willingness to roll up your sleeves to get it done\nExcellent French, Arabic and EnglishWe are always looking for the best candidates, so if you think you would be a good fit even if you don't meet 100% of the requirements we would love to hear from you!Experience our Glovo Life benefits:Enticing equity plan (if applicable)\nTop-notch private health insurance\nMonthly Glovo credit to spend on our restaurant products and zero delivery fee on all Glovo orders!\nDiscounted gym memberships\nFlexible time off (take the time you need) and hybrid working model (own your time)\nEnhanced parental leave including nursery support!\nOnline therapy and wellbeing benefit\nExternal learning budgetGas: Driven to deliver quality results quickly\nGood Vibes: Bring positivity and communicate openly\nStay Humble: Self-aware and open to learning\nCare: Uplift people and the planet\nGlownership: Act as proud owners\nHigh Bar: Focus on Top PerformanceGlovo is transforming the way consumers access local goods, enabling anyone to get almost any product delivered in minutes. Our on-demand logistics connect customers with independent local couriers who acquire goods from any restaurant or store in a city, as well as deliver urgent packages for a variable fee.&nbsp;For additional information on Glovo, please visithttps://about.glovoapp.com/Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Medina, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}