{"Job ID": "69873369", "Description": "JOB DESCRIPTION:TITLE :Area Business managerINDUSTRY: Medical devicesLOCATION: NagpurROLES AND RESPONSIBILITIES:Create sales plans and quotas in alignment with business objectives.• Support team with day-to-day operations.• Evaluate team and individual performances.• Report on regional sales results.• Forecast quarterly and annual profits.• Identify hiring needs, select and train new sales people.• Prepare and review the annual budget for the area of responsibility.• Analyse regional market trends and discover new opportunities for growth.• Address potential problems and suggest prompt solutions.• Participate in decisions for expansion or acquisition.• Suggest new services and innovative sales techniques to increase customer satisfaction & sales.• Experience in Distribution channel management.• Relationship with purchase managers of all the leading hospitals in the region.• Good relationships with the intervention cardiologist in the region.REQUIRED SKILLS:Proven work experience as an Area Manager or similar sales role.Minimum 3 yearsof experience in Medical Devices – Interventional Cardiology & Structural Heart (Stents, Catheters, balloons, Heart valves, pacemakers etc.)• Proven work experience in similar sales role.• Ability to measure and analyze key performance indicators (ROI and KPIs). • Ability to work with the sales team.• Excellent communication skills. • Strong teamwork and pro-activnessABOUT CLIENT: The client's organization holds a prominent global position in manufacturing advanced medical devices used in cardiovascular care. Their product portfolio includes a diverse range of items, such as Bare Metal Stent Systems, Drug Eluting Stent Systems, PTCA Balloon Catheters, Angiographic Diagnostic Catheters, Guiding Catheters, Coronary Vascular Accessories, and Transcatheter Heart Valves.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}