{
    "Job ID": "69873490",
    "Description": "Job Requisition ID: 157175 Established in the 1930s as a trading business, Al-Futtaim Group today is one of the most diversified and progressive, privately held regional businesses headquartered in Dubai, United A”rab Emirates. Structured into five operating divisions; automotive, financial services, real estate, retail and healthcare; employing more than 35,000 employees across more than 20 countries in the Middle East, Asia and Africa, Al-Futtaim Group partners with over 200 of the world's most admired and innovative brands. Al-Futtaim Group’s entrepreneurship and relentless customer focus enables the organisation to continue to grow and expand; responding to the changing needs of our customers within the societies in which we operate. By upholding our values of respect, excellence, collaboration and integrity; Al-Futtaim Group continues to enrich the lives and aspirations of our customers each and every day.We are currently seeking an experienced finance professional to join our Finance Shared Service Center in the capacity of Accountant – R2R.Overview of the role\nAs a member of FSSC R2R team – To support monthly and yearly preparation of journal entries and reconciliation of GL accounts.What you will doGeneral ledger reconciliations & schedule reviewReconciliation of GL accounts, preparing GL schedules with actionable insights.Post transactions in SAP/BPC and maintain necessary documentation to support such transactions.\nPrepare necessary analysis and reports related to General ledger balances and provide highlights indicating risks and recommend mitigation action.\nStandardize accounting schedules and implement quality review process.\nPrepare & circulate monthly intercompany loan reconciliation\nStrive to continually improve GL review process for early warning signals.\nGather necessary information related to balance sheet accounts from concerned stakeholders to ensure proper reconciliation of GL accounts.\nPrepare and submit audit schedules, data, documentations to ensure prompt closure of audit.Monthly / Yearly books closing and business supportEnsure timely inputs for preparation of financials and take ownership for compliance\nFollow checklists for monthly book closure and audit closure.\nEnsure necessary amortization and provision entries are posted and issues highlighted.\nPerform necessary reclassifications and validations in BPC process.\nProvide support in circulating weekly stock forecast\nRecord month end stock provision entries after comprehensive review and confirmation by business.Intercompany and IntracompanyReview ICM module to ensure ICM team has accepted the regular charges (Warehouse rent, D&W, Warranty, Security charges. MDE charges, EIT, Visa, Emiratization & Training Levy)\nHighlight issues around elimination of transactions and provide inputs to fix process issues and to avoid recurrenceRequired skills to be successfulGood accounting (IFRS) knowledge preferred\nAnalytical, process oriented\nWell organized, with excellent communication skills, a team player\nShould possess a good knowledge of excel and have prior experience in working with large databases\nPresentation skills, exposure to ERP\n(Preferably SAP) and SAP BW/ BPCWhat equips you for the roleGraduate/Fresh ACCA/CMA (or similar qualification)\nFresher with necessary qualification and aptitude or minimum 2 years of similar experience, with good accounting knowledge and ERP systems.\nExcellent written and verbal communication and interpersonal skills.We’re here to provide excellent service but a little help from you can ensure a five-star candidate experience from start to finish.Before you click “apply”: Please read the job description carefully to ensure you can confidently demonstrate why this opportunity is right for you and take the time to put together a well-crafted and personalised CV to further boost your visibility. Our global Talent Acquisition team members are all assigned to specific businesses to ensure that we make the best matches between talent and opportunities. We not only consider the requisite compatibility of skills and behaviours, but also how candidates align with our Values of Respect, Integrity, Collaboration, and Excellence.As part of our candidate experience promise, we also want to make ourselves available to you throughout the application process. We make every effort to review and respond to every application.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}