{
    "Job ID": "69873459",
    "Description": "Main Purpose of the JobThe main purpose of the position of HVAC Helper is to assist HVAC technicians with the installation, maintenance, and repair of heating, ventilation, and air conditioning (HVAC) systems. HVAC Helpers typically have a basic understanding of HVAC systems and are able to follow instructions from HVAC technicians.Main Competencies required for the PositionThe main competencies required for the position of HVAC Helper are: Technical skills: HVAC Helpers must have a basic understanding of HVAC systems and be able to follow instructions from HVAC technicians. They may also be required to operate a variety of power and hand tools. Communication skills: HVAC Helpers must be able to communicate effectively with both HVAC technicians and customers. They should be able to explain technical concepts in a clear and concise manner, and they should be able to resolve customer complaints in a professional manner. Problem-solving skills: HVAC Helpers must be able to identify and solve problems quickly and efficiently. They should be able to think critically and come up with creative solutions. Safety skills: HVAC Helpers must be aware of the safety hazards associated with HVAC work. They should be able to follow safety procedures and ensure that their team does the same.Main Duties / ResponsibilitiesThe main duties and responsibilities of an HVAC Helper include: Assisting with the installation, maintenance, and repair of HVAC systems Operating a variety of power and hand tools Cleaning and organizing tools and equipment Maintaining a clean and organized work area Performing routine maintenance tasks such as cleaning filters and coils, and making minor repairs as needed. Cleaning and organizing tools and equipment, as well as work areas. Following all safety procedures, such as wearing personal protective equipment and using lockout/tag out procedures.Minimum qualifications / educational levels required for this position A high school diploma or equivalentSelection Criteria Knowledge of safety procedures Ability to work independently and as part of a team Ability to meet deadlines and work under pressure Strong commitment to his superiorsSpecial Conditions Availability to work on weekends Ability to lift heavy objects Ability to work in confined spaces. Ability to work in hazardous environments such as those with high levels of noise or dust. Ability to follow safety proceduresJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Tabouk, Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}