{
    "Job ID": "69873277",
    "Description": "IQ-EQ is a leading Investor Services group which combines global expertise with an unwavering focus on client service delivery. We support fund managers, global companies, family offices and private clients operating worldwide.Lead the team where everybody counts.Manage the team and make each member feel valued as they do the accounting for the clients your team is supporting. Your role will be critical in ensuring that stakeholders demands, and the team’s delivery are BALANCED out, making sure CREDITS are given where it’s due and providing opportunities for your people to EXCEL at work.EssentialGraduate of accounting or any business-related course with 8+ years relevant accounting experience.\nAt least four (4) years supervisory experience.\nExperience with managing service operations and client deliverables.\nExperience in managing staff and/or conducting appraisals.\nActual work experience in the preparation and/or review of working paper files, financial statements with disclosures and other financial information.\nIntermediate Excel skills such as pivot tables, lookup, “if” and other similar functions.\nExperience in e-mail, word processing, presentation and video conferencing applications such as Microsoft Office.DesiredDesire to complete Certified Public Accountant qualification, if applicable.\nExperience working in Financial Services or Shared Services office environment.\nExperience working in a multinational office environment.\nOpen to travel and other secondment opportunities abroad.\nUniversity Degree in Accountancy and other accounting-related courses.At IQ-EQ we want you to reach your full potential. We offer an inclusive and diverse environment to support your career aspirations. With a strong emphasis on continuous learning and a holistic approach to your professional and personal development. We also offer opportunities across our service lines and our international network of offices.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Hyderabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}