{
    "Job ID": "69875873",
    "Description": "At LeasePlan, we are always asking What's next in mobility.Join our team and be part of a dynamic, exciting and engaging business, so we can discover What’s next together!Görev Tanımı:İkinci el satış sürecinde müşteri talebine istinaden kredi ürünlerinin başvuru işlemleri\nKredi onayı ve sonrasındaki süreçlerin ve evraklarının takip edilerek kayıtlarının tutulması\nKredili satılan otomobillerle ilgili işlemlerde şirket içi ve müşterilerle olan koordinasyonun sağlanması\nSatılan araçlar ile ilgili sigorta ürünlerinin başvuru kayıt işlemlerinin yapılması\nMüşterilere araç satışı için sunulan finansal ürünler ile ilgili her türlü desteğin sunulması\nÜrün ve süreçler ile ilgili rapor ve takiplerin zamanında yapılmasıNitelikler:Üniversite veya Meslek Yüksek Okullarının ilgili bölümlerinden mezun (İktisat, İşletme, Maliye, Bankacılık Sigortacılık vb.)\nOtomotiv sektöründe benzer pozisyonda  en az 1 yıl tecrübeli,\nİnsan ilişkileri ve iletişimi kuvvetli,\nkişisel bakıma özen gösteren,\nProblem çözme ve karar verme yetkinliğine sahip,\nSürücü belgesine sahip ve aktif olarak araç kullanabilen\nDiksiyonu düzgün, prezantabl, ekip çalışmasına yatkın, gelişime açık\nMüşteri ve Çözüm odaklı, pratik, disiplinli, dikkatli ve titiz çalışan\nTempolu ve yoğun ilişki yönetimi gerektiren ortama uyum sağlayabilecek\nTercihen İstanbul Anadolu yakasında ikamet edenWhy LeasePlan?LeasePlan is a global leader in Car-as-a-Service, with approximately 1.9 million vehicles under management in 29 countries. LeasePlan purchases, funds and manages new vehicles for its customers, providing a complete end-to-end service for a typical contract duration of three to four years. Through our NextGen Digital strategy, we are transforming from an analogue into a fully digitally-enabled business, delivering digital services at digital cost.With over 55 years’ experience, LeasePlan's mission is to provide what’s next in sustainable mobility so our customers can focus on what's next for them. We aim to build an ethical, inclusive, and progressive culture in which people can thrive and be themselves regardless of their race, nationality, gender, age, disability, sexual orientation etc.  If you’d like to learn more about our culture, DE&I journey and our way of working, please find out more in our sustainability section and our latest Annual Report.Follow @NextGenLeasePlan on Instagram and LeasePlan on LinkedIn to check out what LeasePlanners are up to everyday!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}