{"Job ID": "69872766", "Description": "Customer SupportResponsible for providing back office support to the Professional Services team through the customer relationship management (CRM) software Rexis / New Field Service solution which includes but is not limited to case creation and dispatch to assigned personnel\nCollaborate with the Customer Support leadership team, prepare necessary documents and schedule instrument implementation with the customers\nSupport the team to arrange courier service for spare parts\nResponsible for liaising with the various teams, preparing and sending necessary documents as required by regulatory bodies and accreditation agencies post implementation of projects.\nResponsible for spare part management including ordering, inventory management & reconciliation in collaboration with the Service Manager and distributor.\nCollaboration with Business partners (Water units, UPS, 3rd party materials etc) and handling complaintsMarketing / Events SupportResponsible for liaising with Roche’s procurement function, 3rd party vendors, organizing companies and hotels for events, including support on drafting agreements, contracts and facilitating payments (events and activities include roundtables, scientific conferences, symposia, etc.)\nDeliver events on time, within budget, that meet (and hopefully exceed) expectations, and are aligned with Roche compliance policies, the local law and the industry deontological code\nHandle HCP Forms for all sponsored events and travels in time according to rules and policies\nFacilitating travels and accommodation for HCPs, Hospital/Lab Management and Government Authorities traveling on Scientific Conferences.\nHelp achieve company goals by supporting the planning and organization of logistically successful external events and internal meetings, maintain timelines and priorities (events such as team meetings, awareness sessions, training and education)\nAnalyze event operations and prepare and implement recommendations for improving operational efficiencies within the events\nPrepare event status reports to monitor progress against plan and recommend corrective actions, and develop methodology to measure events success\n As and when requested by team to arrange the catering service at the office and communicating internally and externallyPeople & Culture SupportCollaborate with business partners to improve employee journey including on boarding, visa , Payroll , recognition, and exit\nAlign with IT to manage, initiate, and close IT assets and business related assets (Sim cards, business cards, fuel tags and service reports)\nBe a point of contact for people & Culture topics and support the network\nOrganize and co-drive organization culture through team building activities, internal events, and special occasions.\nApply, renew & cancellation of work permit card for employees\nApply for new/cancellation of employees or dependent medical insurance\nProcess all employee appreciations (Applause/Clap)\nProcess farewell and customary gesture for life event\nRegister the vendors in distributor system in coordination with requestorComplianceAll activities and behavior in business must be in compliance to Roche standards as expected by all Roche employeesWho You Are•           You hold a University degree ( Biomedical preferred)•           You have a proven admin or assistant experience of at least 3 years•           You have excellent time management skills , ability to multitask and prioritize work•           You are confident and able to work independently with minimum supervision•           You are proficient in MS office and have knowledge of office management systems &              procedures        •           You have excellent written & verbal communication skills in English. Arabic is a plus.At Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.Roche is an Equal Opportunity Employer.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Dubai, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}