{"Job ID": "69873396", "Description": "About Jumeirah & the Hotel:Jumeirah Group, a member of Dubai Holding, has been making a distinguished impact on the global hospitality market for more than two decades with its Stay Different™ brand promise.Its award-winning destinations, such as the iconic Burj Al Arab Jumeirah, position service beyond expectations, elevated dining destinations and surprising architecture and design at the heart of every guest experience.Today, Jumeirah operates a world-class portfolio of 23 properties across the Middle East, Europe and Asia and employs over 8,000 colleagues, representing over 106 nationalities.As Jumeirah continues to expand its global portfolio and scales up its operations to the next level of growth, it remains fully committed to developing and empowering our colleagues to excel in world class environments.Jumeirah is committed to embedding equality, diversity, and inclusion in all its practices, embracing a culture that celebrates diversity.Jumeirah Bahrain Gulf Resort and Spa is an idyllic getaway situated majestically on the shores of the Gulf and takes its architectural inspiration from the gentle movements of the sea. The resort’s cluster of villas and elegantly designed rooms, along with the award-winning Talise Spa, offers a sanctuary for travelers looking to recharge and embark on a journey for wellbeing. Bahrain presents itself as a destination for the ultimate Middle Eastern experience, with its rich heritage of beautiful forts and charming bazaars blending perfectly with an inspirational vision for the future. The resort harmonises Jumeirah’s promise of unparalleled hospitality with the wonder of the destination, providing a true beachside escape in the heart of culture. Set to exceed all guest expectations, the resort and spa is an oasis for nature-loving friends, families and couples hoping to disconnect from the chaos of everyday life.About the Job:An opportunity has arisen in Health & Safety department to join Jumeirah Gulf of Bahrain Resort & Spa Family. The main purpose of this position is to assist in the efficient and effective running of the Health and Safety Management System in the property.Duties and responsibilities of this role:Assisting with the development, implementation and continuous improvement of the HSE Management System, programs and processes\nMonitoring trends and recommend pro-active action plans to remedy potential problems.\nFacilitating, investigating and analyzing incidents and make sure lessons learned are shared and communicated to the concern parties.\nAssisting with investigating and reporting all alleged food poisoning cases\nReporting all incidents and accidents on “Perspective”\nAssisting with the Management of Occupational Health, Safety & Hygiene related matters\nAssisting and coordinating with fire & life safety procedures\nAssisting the Food and Beverage Team in preparation for HACCP promotion and implementation.\nAssisting with the development, implementation and continuous improvement of the HSE Management System, programs and processes\nMonitoring trends and recommend pro-active action plans to remedy potential problems.\nFacilitating, investigating and analyzing incidents and make sure lessons learned are shared and communicated to the concern parties.\nAssisting with investigating and reporting all alleged food poisoning cases\nReporting all incidents and accidents on “Perspective”\nAssisting with the Management of Occupational Health, Safety & Hygiene related matters\nAssisting the Food and Beverage Team in preparation for HACCP promotion and implementation.\nCarrying out Health Safety and Environment training such as Near Misses, Risk Assessment, Environmental awareness, etc. for all the colleagues\nMeet and liaise with enforcement officers and other officials from external organizations including Fire Consultants, Legionella Consultants, Environmental Consultants, Hygiene Consultants, etc.\nConducting Health, Safety & Kitchen Hygiene Inspections and spot checks\nConducting Risk Assessments periodically and ensuring identified risks are managed and controlled effectively.\nAttending the monthly Health Safety and Environment Group meeting and raise and deliberate with Committee on any Health Safety and Environment issues.\nAttending the monthly HACCP Team meeting and raise and deliberate on any food safety issues.About You:The ideal candidate for this position will have the following experience and qualifications:Hotel School Degree or Diploma/ Certificate in Occupational Safety and Health or Environment\n\"NEBOSH” or ‘IOSH’ Certificate or equivalent is desirable.\nA minimum of 1 year experience in similar role.\nA minimum of 2 years’ experience working in 5-star international luxury environment\nPresentable and with great communication skills\nMulti-Culture environment experience\nDemonstrated experience working in a high-volume, high-pressure environment.\nExcellent communication, interpersonal and leadership skills with the ability to interact with different groups of diverse needs and requirements in a motivational manner.\nValid Bahrain driver license is essential.About the Benefits:We offer an attractive tax-free salary, paid in Bahraini Dinar (BHD), the local currency of Bahrain. In addition, we offer reduced hotel rates across our properties globally, excellent leave and health care package, flights home, accommodation allowance, life insurance, 50% discount off Jumeirah F&B Outlets and reduced hotel rates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bahrain", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}