{
    "Job ID": "69872941",
    "Description": "John Crane (www.johncrane.com) is a global leader in rotating equipment solutions, supplying engineered technologies and services to process industries. The company designs and manufactures a variety of products including mechanical seals and systems, couplings, bearings, filtration systems and predictive digital monitoring technologies. John Crane customer service is accessed through a global network of more than 200 sales and service facilities in over 50 countries. Fiscal year 2016 revenue was greater than 1 Billion USD (£830m). John Crane is part of Smiths Group (www.smiths.com), a global leader in applying advanced technologies for markets in threat and contraband detection, energy, medical devices, communications, and engineered components.Responsible for the operations within Manufacturing function, supporting day-to-day CNC Programming requirement, Coordinating with Team leaders and to manage workloads, support in delivering Key Performance Indicators (KPIs) and quality standards, whilst fostering a culture of working safely. Work under general supervision, reviewed by Management.What you'll do - • Preparing CNC Programming with support of Edgecam software and Mazatrol to ensure production throughput against stated capacity targets.• Carry out Evaluation of technical and machining feasibility and process optimization. • Responsible for daily management and support team to achieve operational success, Process planning, designing Fixtures and Tools and Cycle time reduction through Lean tools.• Carry out non-conformity investigations and associated reporting and action closure with RCA and resolve problems.• Support, comply and ensure complicity with 5S, Health & Safety regulations, Quality and Environmental standards and all other Company policies and procedures.• Team player High levels of motivation, optimistic and action orientated.What you'll definitely need - • Diploma in Mechanical Engineering or equivalent with 2-3 years OR ITI Technician with CNC Programming with 4-5 years of management experience.• Good to have CNC programming certification.• Must have thorough CNC Machining knowledge, understanding of design, drawing standards and Processes.• Excellent verbal and written communication skills. Ability to effectively communicate with all levels of personnel and across functional lines. Requires excellent personal computing skills, particularly CNC Programming with various controls and Microsoft Office.•Should have Sound knowledge of CNC Programming, CNC machining, tooling, fixtures, and other manufacturing processes.• Knowledge of Quality standards.• Good understanding of customer deliverables and the impact of failure/cost of poor quality.• Support safe workplace cultures and compliance with Smiths EH&SWe believe that different perspectives and backgrounds are what make a company flourish. All qualified applicants will receive equal consideration for employment regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, economic status, disability, age, or any other legally protected characteristics. We are proud to be an inclusive company with values grounded in equality and ethics, where we celebrate, support, and embrace diversity.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}