{
    "Job ID": "69872899",
    "Description": "As part of Risk Management and Compliance, you are at the center of keeping JPMorgan Chase strong and resilient. You help the firm grow its business in a responsible way by anticipating new and emerging risks and using your expert judgement to solve real-world challenges that impact our company, customers and communities.  Our culture in Risk Management and Compliance is all about thinking outside the box, challenging the status quo and striving to be best-in-class. You will be responsible for managing risk strategies end to end, developing and maintaining process standards and performing complex activities with the objective of reducing losses, balancing risk reward trade-off and enhancing efficiencies in the system. Identify key risk drivers and assess concentrations and exposures while analytically segmenting the portfolio along these factors. You would be required to interact frequently with cross-functional partners and make presentation to senior managers and executives. You will also be expected to demonstrate thorough understanding of the business and ensure robust controls environment.Job responsibilities:Provides coaching and mentoring to a group(s) of analytic professionals. Able to effectively develop team members\nDemonstrates effective people management and leadership skills\nResponsible for the creation, design, analysis and execution of specific projects/analytics for assigned functional area\nHigh degree of judgment and independent decision making for complex issues and problem solving\nAbility to work collaboratively with cross-functional partners to understand and address key business challenges\nWork independently on analytical tasks starting with problem identification, defining objectives, data discovery and analysis of large & complex data points, formulating concise conclusions with actionable recommendations, creating presentations to pitch findings and strategies\nProviding clear/concise oral and written communication across various functions and levels, inclusive of Operations, IT, and Risk ManagementRequired qualifications, capabilities, and skillsMS / Bachelor's degree in a quantitative discipline; Math, Finance, Statistics, Economics or equivalent work/training is required; advanced degree is preferred\nStrong people management and leadership experience\nAbility to manage and prioritize projects across cross-functional groups\nStrong communication and interpersonal skills with ability to interact with individuals across departments / functions \nKnowledge of the lending lifecycle, including origination, portfolio management, sale/servicing, default management / loss mitigation\nIn depth knowledge of risk management policies, control processes, metrics & strategy\nStrong understanding of SAS programming, SQL programming, MS Word, PowerPoint, and Excel (graphs, charts, formulas etc.)Preferred Qualifications, Capabilities, and SkillsPrior experience of working in small business industry in strategy / policy roleJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}