{
    "Job ID": "69872887",
    "Description": "Requisition ID: 271819 Relocation Authorized: None \nTelework Type: Part-Time Telework \nWork Location: New Delhi About Bechtel:Since 1898, we have helped customers complete more than 25,000 projects in 160 countries on all seven continents that have created jobs, grown economies, improved the resiliency of the world's infrastructure, increased access to energy, resources, and vital services, and made the world a safer, cleaner place.Differentiated by the quality of our people and our relentless drive to deliver the most successful outcomes, we align our capabilities to our customers’ objectives to create a lasting positive impact.We serve the Infrastructure; Nuclear, Security & Environmental; Energy, and Mining & Metals markets. Our services span from initial planning and investment, through start-up and operations. Core to Bechtel are our values – ethics, safety, quality, people, culture, relationships, innovation and sustainability, and our covenants – integrity, respect, collaboration, trust, and delivery. They are what we believe, what customers can expect, and how we deliver.Bechtel partners with customers across the globe to deliver projects of purpose that create a lasting positive legacy. These innovative projects create jobs and grow economies; improve the resiliency of the world's infrastructure; connect communities to resources and opportunity; get us closer to net zero; protect U.S. and allied interests; tackle critical environmental challenges to protect people and the planet; and accelerate progress to make the world a cleaner, greener, safer place. While expertise enables delivery, partnerships ensure long-term success, which is why we align everything we do to our customers’ goals. We are a team of committed individuals at Bechtel who are enthusiastic about developing, maintaining, and supporting cutting-edge applications critical to our projects. We aim for excellence in everything we do, and our Information Systems & Technology (IS&T) group is at the forefront of technical innovation.Bechtel India is a global operation that supports execution of projects and services around the world. Working seamlessly with business line home offices, project sites, customer organizations and suppliers, our teams have delivered more than 125 projects since our inception in 1994. Our offices in Gurgaon, Vadodara and Chennai will grow significantly and sustainably with exciting career opportunities for both professionals and young graduates who are passionate about creating a cleaner, greener, and safer world; building transformational infrastructure; making decarbonization a reality; and protecting people and the environment.Role Description We are looking for Developer with Node JS and Typescript skills on industry standard applications The candidate must have good hands-on experience on required technologies and Proficient in client communication. s/he should also have good analytical and Communication Skills. s/he should also have good knowledge of handling enterprise applications.Must Have SkillsServer-side development experience with Node.js using Typescript\nFront end development experience using React JS\nExperience developing and consuming GraphQL APIs\nExperience writing complex SQL queries \nExperience with implementing unit tests in Jest, integration tests, Test Driven Development Nice To Have SkillsDevelopment experience with ORM tools (Entity Framework, TypeORM)\nCloud technologies (Microsoft Azure)\nApollo GraphQL server/client Experience - 2+ yearsHybrid work mode - 2 days in office every weekLocation - GurgaonShift Timings - 11.30 am to 8 pmShaping tomorrow togetherBechtel is one of the most respected global engineering, construction, and project management companies. Together with our customers, we deliver landmark projects that foster long-term progress and economic growth. Since 1898, we’ve completed more than 25,000 extraordinary projects across 160 countries on all seven continents. We operate through four global businesses: Infrastructure; Nuclear, Security & Environmental; Energy; and Mining & Metals. Our company and our culture are built on more than a century of leadership and a relentless adherence to our values, the core of which are safety, quality, ethics, and integrity. These values are what we believe, what we expect, what we deliver, and what we live.  \nwww.bechtel.comBechtel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, disability, citizenship status (except as authorized by law), protected veteran status, genetic information, and any other characteristic protected by federal, state or local law.\n\nBechtel employees are required to be vaccinated for COVID-19 or show proof of a negative test result prior to accessing Bechtel sites/facilities to the extent required by applicable law or by customer requirements.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}