{"Job ID": "69873044", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Facility Manager - TechnicalAccount Management – Work DynamicsWhat this job involvesKeeping up the paceYou’ll set the facility management team on the right track through ample engineering planning and management. You’ll drive success in terms of functionality and stability by finding new ways to improve the system and making sure that everyone knows where they stand. You need to ensure that team members can efficiently respond to all engineering challenges, at the same time comply with the policies and procedures. You’ll bring out the team player in you to keep all key performances in check.All eyes on the planYou’ll ensure that all risk mitigation plans are in place. Do such plans comply with our clients’ designated procedures and policies? Are all engineering reports in order? You constantly need to monitor and evaluate all critical environment equipment across the account’s site to make sure everything is running smoothly as possible. Tracking review reports should also keep you busy, as doing so is instrumental in implementing improvement plans across the sites.Taking facilities operations up a notchMaintaining high-quality facilities operations is your top priority. To achieve this, you’ll work closely with facilities managers to keep the reliability of facilities operations. You’re in charge of reviewing the planned preventive maintenance programmes, as well as ensuring that service standards are aligned and maintained with regional operations procedures. You’ll take the lead in pushing the “ONEVIEW” system to your staff, and use it to ensure consistency against regional policies and procedures. You’ll also be responsible for quality assurance by keeping the M&E  systems in check.Risks under controlBeing an engineering manager also requires you to be on top of your risk management game. Are there any major M&E equipment risks? Is information uploaded into our systems accurate and complies with the audit process? Is the disaster recovery and business continuity planning implemented and reviewed periodically? Are escalation procedures observed? These are just some of the questions that you constantly need to ask yourself as our risk management agent.Tracking project effectivenessYou’ll be involved in project review, execution and information documentation. You’ll keep track of the M&E portions of all project proposals, and participate in the technical aspects of the M&E portion of any project’s bidding process. It is also your job to keep project information together for future use.Managing the teamYou’ll oversee all engineering-related trainings of staff members, as well as ensure their compliance to necessary licenses and certifications. You’re also in charge of ensuring the quality of management reports through the team’s deliverables and administration of the “ONEVIEW” portal.Sound like you? To apply, you need to be:Experienced and client centricYou must have a university degree in engineering/facility management, with eight years’ experience in the field. You’ll need a strong grasp of client satisfaction, as you’ll constantly communicate with our stakeholders. We’ll expect you to provide them with solutions that will continuously improve their systems and save them costs. You’ll also strive to determine if we can provide them other services that may help improve their conditions further.A strong, flexible leaderDo you have an excellent command of spoken English and Chinese languages? Are you a proactive leader who can think laterally and deliver innovative solutions? Do you have strong people skills, capable of boosting staff satisfaction and morale? If your answers are “yes” to our questions, let’s discuss how we can put your expertise into action as our engineering manager.What we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realize your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500® company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}