{
    "Job ID": "69872621",
    "Description": "We are looking for Inspector to work on with one of our prestigious clients in Riyadh.Overview:The inspectors will be qualified field personnel and equipment to provide continuous onsite inspection to monitor, document, inspect, and test the assets, staff, operations and maintenance of the contractors.\n\nThey will perform these services at a level complementary to, and not duplicative of, the contractor requirements, and according to RCRC procedures.\n\nWith the contractor, the Consultant will perform pre-commencement condition and operation surveys and prepare reports including photographs and video records.\n\nThe contractor completes the surveys and the Consultant will confirm that they are complete with the data collected by the inspectors.\n\nThe Consultant will reconcile its records with the contractor. Condition surveys will include photo, video, or both types of documentation of existing conditions within and immediately adjacent to the works areas with notations of observed defects or damage.The following are the qualifications for the KPI inspectors:3+ years of experience in Operation & Maintenance inspection\n\nKnowledge of maintenance standards and regulations\n\nExcellent written and verbal communication skills\n\nAbility to work independently and as part of a teamRewards and BenefitsWe offer an excellent package which includes:A competitive tax-free salary\n\nAccommodation allowance\n\nTransportation allowance\n\nAnnual flight allowance to point of origin\n\n21 days annual leave\n\nMedical and life insurance cover\n\nCompany gratuity scheme\n\nDiscretionary bonus schemeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Riyadh, Saudi Arabia",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}