{
    "Job ID": "69874772",
    "Description": "It takes the brightest minds to be a technology leader. It takes imagination to create green energy for the generations to come. At Siemens Gamesa we make real what matters, join our global team.Exposure to Tecnomatix Plant Simulation\nExposure on OEM Standards / Templates and requirements preferred.\nKnowledge of Programming with SimTalk (mandatory)\nCreate the discrete event simulation models and analyzed parameters like machine efficiency (MTTR, MTBF), line efficiency, process equipment utilization, throughput per hour\nExperience in all modules and tools in Plant Simulation\nExperience in creating material flow simulation models, layout feasibility studies, logistics process, warehouse movement, crane and its applications\nObject oriented programming skills – SimTalk for custom logistics\nExperience in statistics analysis and charts\nGood at layout improvement, throughput improvement, assembly process improvement and line balancing\nAnalysis using different What-if Scenarios, experiment managers, Bottleneck & Buffer Studies and Line Optimization / Line Balancing Etc.2 to 3 Years of practical experience in Discrete Event Simulation / Throughput and validating the Manufacturing Processes.\nManufacturing / Shop floor experience preferred.\nCreation and execution of material flow simulation models\nCreation of new and modification of existing simulation models in Tecnomatix Plant Simulation\nKnowledge of Industrial Engineering concepts, Lean Manufacturing Principles\nElaboration and evaluation of scenarios for optimization of KPIs\nStrong math skills, ability to perform routine simulation activities\nRapidly adapt and respond to changes in environment and priorities\nExcellent communication, leadership, problem solving, and analytical skills\nSelf-motivated and hands on approach\nFollow written/verbal instructions and meet deadlines with minimal supervision\nMust be Quality Conscious and produce Simulation details with 100% issue free\nTeam Player with more positive intentSiemens Gamesa is an equal opportunity employer and maintains a work environment that is free from discrimination and where employees are treated with dignity and respect. Employment at Siemens Gamesa is based solely on an individual's merit and qualifications, which are directly related to job competence. Siemens Gamesa does not discriminate against any employee or job applicant on the basis of race, ethnicity, nationality, ancestry, genetic information, citizenship, religion, age, gender, gender identity/expression, sexual orientation, pregnancy, marital status, disability or any other characteristic protected by applicable laws, rules or regulations. We adhere to these principles in all aspects of employment, including recruiting, hiring, training, compensation, promotion and benefits.We are driven by people - from more than 100 different countries, they build the company we are every day. Our diverse and inclusive culture encourages us to think outside the box, speak without fear, and be bold. We value the flexibility that our smart-working arrangements, our digital disconnection framework and our  family-friendly practices bring to the new way of working.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}