{
    "Job ID": "69870009",
    "Description": "Do you crave the taste of success? Can you handle the heat in the kitchen and keep your team cool at the same time? Then why not come and join us at the Radisson Hotel Group to Make Every Moment Matter! where our guests can relax and enjoy the experience!\nOur Kitchen Team has a taste for developing the flavors to cook up a storm and strives to deliver a hospitality experience that is beyond expectation - creating memorable moments for our guests.\nAs Exec Sous Chef, you will join a team that is passionate about delivering exceptional service where we believe that anything is possible, whilst having fun in all that we do!\nInterested then why not say Yes I Can! as we are looking for passionate people just like you!\nKey Responsibilities of the Exec Sous Chef:\n-Ensures the smooth running of the kitchen department, where all aspects of the guest dining experience throughout the whole Hotel are delivered to the highest level\n-Works proactively to improve guest satisfaction and comfort, delivering a positive and timely response to enquiries and problem resolution\n-Develops and implements plans where kitchen initiatives & hotel targets are achieved\n-Leads and manages the kitchen team, fostering a culture of growth, development and performance within the department\n-Prepares and is responsible for the departmental budget, ensuring that costs and inventory are controlled, that productivity and performance levels are attained\n-Builds and maintains effective working relationships with all key stakeholders\n-Reviews and scrutinizes the performance of the food offering, providing recommendations that will drive financial performance\n-Ensures adherence and compliance to all legislation where due diligence requirements and best practice activities are planned, delivered and documented for internal and external audit, performing follow-up as required\nRequirements of the Exec Sous Chef:\n-Proven experience in kitchen with strong problem-solving capabilities\n-Excellent leadership skills with a hands-on approach and lead-by-example work style\n-Commitment to exceptional guest service with a passion for the hospitality industry\n-Ability to find creative solutions, offering advice and recommendations\n-Personal integrity, with the ability to work in an environment that demands excellence, time and energy\n-Experienced in using IT systems on various platforms\n-Strong communication skills\nCAREERS\nJoin us in our mission to make every moment matter for our guests and be part of the most inspired hotel company in the world. At Radisson Hotel Group we believe that people are our number one asset. As one of the world’s largest hotel companies, we are always looking for great people to join our team. If this sounds like an ambition you share, then start with us.\nTo find out more about the Radisson Hotel Group, our Culture and Beliefs, then why not visit us at careers.radissonhotels.com.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}