{
    "Job ID": "69874368",
    "Description": "General Ledger and financial reporting (Consultant or Sr. Consultant level)Experience in the consolidation of accounts as per IFRS\nPreparation of Statutory financial statements as per IFRS\nExperience in group financial reporting\nEnsure the accuracy of financial data by supervising and maintaining the company’s General Ledger accounts\nSupport Monthly and Annual close processes, ensure all required accounting transactions are booked properly at the end of each period, and perform period-end account closing activities and reconciliations\nExperience in preparation, processing and posting of JEs in ERP system with supporting documents and control of the JE logs\nEnsure that all Sub-ledgers are reconciling and are well maintained\nResponsible for reconciling Revenue reports with GL and allocating revenue based on business segments\nFinancial Statement review and reporting results to the management\nExperience in preparing balance sheet reconciliations for all accounts\nResponsible for compilation of balances for the Company, its subsidiaries, and JVs for consolidation\nManaging external and internal audits processes and reports\nAdhere to standard accounting standards and company procedures.\nVAT accounting and returns finalizationRequirementsMinimum of 8 to 10 years of extensive experience in accounting, finance or related role of which 2-4 in a senior GL accountant role.\nBig 4 experience is a must either in audit or in advisory\nStrong project management skills\nExperience in consolidation is required\nAbility to work well in high pressure situations in order to meet deadlines\nCertifications in any of the qualification (ACCA, ACA, CPA, CIMA or equivalent) is a must\nExperience with various ERP systems\nExposure to PowerBiJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Abu Dhabi, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}