{
    "Job ID": "69873446",
    "Description": "JOB PURPOSE To provide a quality service to customers in respect to check-in, boarding, special services, baggage services, ticket desk and Emirates Lounge as per the criteria set forth by the Company’s commercial, safety and security policies, standards and procedures. Ensure all operational criteria are completed within specified time frames as per applicable procedures. JOB ACCOUNTABILITIES - Identify and meet the standard and special service requirements of the customers at check-in, transfer desk, special services and boarding gates by adhering to the set service standards and procedures so that the customers are handled in a friendly and efficient manner. - Adhere to the internal operating boarding procedures by ensuring that laid down boarding priorities, announcements, hand baggage removal, regular staff briefing and stationary/equipment availability before the flight. Post the flight, ensure flight coupon reconciliation and head count confirmation is in order to assist the smooth process of a safe and on time departure of EK flights in order to achieve EK standards and customer satisfaction. - Guide and advise team members to ensure that superior customer service levels are upheld and assist the process of ensuring the safe and on-time departure of EK flights. - To liaise and monitor the Emirates Chauffeur drive company on arrival and departure. Ensure eligible customers are provided with this service on arrival and any customers that require assistance are met on departure. - Oversee the arrival of bags into the baggage hall, ensuring priority bags are first on the carousel and assist customers with missing or damaged bags referring them to Emirates GHA to complete necessary paperwork and follow up on missing bags for Premium customers ensuring customers are kept fully informed. - To monitor queues at check-in ensuring priority given to Premium customer card holders. To assist and deal with any excess baggage and visa issues that may arise. Assist in dealing with any problems such as, keeping customers informed of any delays, disruptions and denied boarding including the implementation of the 'Options' scheme. - Assist with the preparation and completion of pre and post flight documentation and complete all relevant station statistical information and filing. Ensure all safety instructions are compiled with at all times and report any damage to aircraft, ULDS, immediately and assist with preparation of relevant reports. - Cover the absence of check-in supervisor and prepare flight briefs regarding customer information ensuring that all staff, GHA and service providers are fully aware of this information. Ensure all operational areas are covered and that staff are aware of what is expected of them to ensure high levels of customer service in all operational areas. - Support and cover the Emirates Ticket Desk functions and undertake ticketing/reservation duties to ensure seamless service to customers. Offer full range of Emirates products and services to all customers to maximize ticketing revenue. Issue tickets, EMD, EBT, make and amend reservations as and when necessary. Re-issue and re-calculate fares for customers changing itinerary and make any additional collection as required. Carry out Credit Card verification. Complete daily ticket sales returns and assist with banking duties as required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}