{"Job ID": "69873068", "Description": "Work Flexibility: Hybrid or OnsitePosition DescriptionVocera now part of Stryker is Looking for a Senior DevOps Engineer. You will play a key role as part of our DevOps team, developing primarily on the AWS and Azure platforms, as well as designing and implementing infrastructure as code for private/public cloud. You will be responsible for maintaining existing and new configuration management code and infrastructure. You will manage day to day operation of different SaaS products external as well as internal. We believe in automation of operational tasks and are seeking an operational engineer with a developer mindset. You will work on a small team so ability to learn quickly and work independently is essential for this role. This position reports to the Manager, DevOps.Responsibilities.Configure and administer production environments in AWS.\nDevelop scripts to auto deploy and manage configurations.\nUpgrade live applications with minimum downtime, Canary/Red-Blue Deployments\nCollaborate effectively with Engineering and other key stakeholders to negotiate necessary code changes.\nSupport Engineering in the management and upgrade of the Dev, QA environment\nMonitor, debug and troubleshoot operational issues, upgrade infrastructure (compute, storage, networking, databases and webservers)\nPerform operational benchmarking and scaling.\nManage new customer provisioning, issue-tracking workflows, and their implementation.\nInvestigate, integrate, or develop tools to automate tasks.\nDevelop and maintain tools for deployment, monitoring, security, patching and auditing for Windows and Linux based software stack.\nParticipate in incident reviews and work on continuous improvement of operation environments.\nProduce quality code and deliver features on-time.CompetenciesStrong automation mindset, operational rigor, attention to details, and ability to collaborate with key stakeholders in Engineering, Support, and Product Management\nExcellent communication, presentation, interpersonal and analytical skills, including the ability to communicate complex, interactive design concepts clearly and persuasively across different audiences and varying levels of the organization.\nSuccessful track record of delivering enterprise class on-premises and/or cloud offerings from concept to production release, and on time.\nAble to demonstrate past accomplishments developing consumer grade automation using configuration management tools.\nResourceful, able to solve complex problems through adaptation of technology using online and team resources.\nDoer Mindset – Ability to independently execute against deadlines.\nPassionate about DevOps, strong Linux background and modern DevOps toolsetRequirementsBachelor’s degree in computer science or related field or equivalent\n3 to 5 years of experience maintaining applications and services on AWS / Azure CodePipeline, and Azure services (a plus) including at least 3 years in a DevOps role.\nAnsible for configuration management / Infrastructure automation CI/CD (Blue/Green or Canary) experience with tools like Spinnaker, Travis CI, GitHub CI, Jenkins or similar\nExperience as a software engineer specifically working on enterprise/cloud/web/SaaS.\nStrong Python language abilities.\nStrong knowledge about networking solutions with pfSense , Palo Alto.\nExperience with Open Source based DevOps tools for metrics-based monitoring solutions (Prometheus, Grafana), Log aggregation (Loki), Container Management (Docker, or similar), Escalations Management (Pagerduty, or similar)\nAbility to install software using package manager and migrate images from on premises to cloud in the Linux (Centos, ubuntu) and Windows operating system.\nDeep understanding of system automation, scripting, and deployment tools, including Python / Go / Java / Ansible / Terraform / Shell\nDeep understanding of Docker and Kubernetes (AWS EKS / Kops)\nDemonstrated experience with Databases MySQL, Microsoft SQL Server, MariaDB\nOn Call work as needed\nTravel may be required.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}