{
    "Job ID": "69873662",
    "Description": "Job Title:Job DescriptionConcentrix is a technology-enabled global business services company specializing in customer engagement and improving business performance. We partner with ambitious, progressive executives around the world to future-proof their business and stay ahead of the competition and customer expectations.Role and Key Responsibilities:Define, standardize and monitor quality parameters including both non-critical & critical parameters (End-User, Business critical, & Compliance) and thereafter make recommendations for ongoing improvements in the process. ·\nEnsure the team meets the assigned audit targets and compliances set as per SLA and performance scorecard for each process through continuous improvement methodologies. ·\nDesign and document standard practices to be carried out- business processes.\nWork closely with all functions for consistent delivery of service standard. ·\nInteract actively with the clients at an operational level. Responsible for consistent delivery of service standards as per SLAs.\nDrive a Metrics Driven Culture amongst the Team and establish reliable systems for measurement.\nMonitor systems and process to provide ongoing feedback for continuous improvement to the service delivery standards.\nAttention to detail in supporting management reporting with clear and concise data handling and presentation.\nEvaluate and identify the capabilities of all processes within the system, introduce metrics to monitor the same and report to management on improvements necessary to meet customer and industry standards.\nLeverage quality tools and techniques to effectively disseminate knowledge on the floor.\nIncorporate & establish TQ standards across all LOBs in the span. · To identify root causes of variances in metrics (if any)\nResponsible for leading, motivating and supervising the team of Quality analysts.Key skills & knowledge:Good Quality domain knowledge & Tool management\nMinimum 4 years of experience required in Quality domain with BPO Industry, Travel background Preferred.\nAnalytical, logical, reasoning & numerical ability\nAbility to interact with internal and external stake holders.\nExcellent oral & written communication skills.\nExpert in Excel & PowerPoint\nKnowledge of basic life insurance terminology\nGraduate in any discipline\nGood People Management skills.Educational Qualification: GraduateDisclaimer:-'Neither Concentrix nor any authorized 3rd party who assist with our recruitment process, ever ask candidates for ‘recruitment’, ‘processing’ or any other kind of fees in exchange for offer letters from Concentrix. Offer letters and other recruiting correspondence from Concentrix are printed on Concentrix letter head with authentic signatures of appropriate Concentrix authorities.'Location:Language Requirements:Time Type:If you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California ResidentsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}