{"Job ID": "69875367", "Description": "Some careers have more impact than others.If you’re looking for a career where you can make a real impression, join HSBC and discover how valued you’ll be.HSBC is one of the largest banking and financial services organisations in the world, with operations in 62 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Head of Data Management Technologies.If you’re looking for further opportunities to develop your career, take the next step in fulfilling your potential right here at HSBC.Principal responsibilities:Group Data Technology (GDT) enables the bank’s data via world-class technologies and engineering capabilities.  As senior member of the team, you’d be expected to demonstrate strong competencies across leadership, engineering excellence, and communication in context of data technology and the banking industry.  You’ll also be expected to understand HSBC’s purpose, ambition, and values that has been reflected in our strategy, and translate high level strategic objectives into execution at a team level.\nReporting to the Group Data Technologies CIO, this role is a leadership role and part of GDT Exco\nThis role is responsible for partnering with DAO leadership, to execute the Data strategy and manages the delivery of the tools & automation for Data controls and enable Data Market place for the bank\nAccountable for the Data Control automation (DMOV, DUSE, DPRIV and DSTO), this role needs the person to be able to understand the complexities involved in the current manual processes and work with the team to innovate and come up with disruptive solutions helping the substantial reduction of manual work involved\nThis role is also responsible for the building of the strategic Data Marketplace solution which is critical for the business to be able to unlock and exploit the data available to them across lines of business.\nAbility to build effective senior stakeholder relationships. Confidence to constructively challenge the technical agenda to help the business and technical teams deliver maximum value for each $.\nPartner with DAO to constantly strive to increase the adoption of the re-usable tools across GBGFs to adhere to the data controls. Work on establishing continuous feedback loop for improvements in the tools in a true agile way\nUnderstanding of Data Management tooling landscape like Collibra, Solidatus, Exterro etc and understand how to effectively drive the adoption of these tools across the GBGFs for data control adherence\nManage negotiation with and management of, and service agreement monitoring of third party contracts with Technology suppliers\nBuild technology talent and guide & mentor the team to deliver the agreed outcomes in an accelerated fashionLeadership & TeamworkStrong technical execution track record in complex organisations\nAbility to drive decisions to conclusion across multiple stakeholders in a matrix organisation through strong influencing skills to CxO level\nHighly energetic and resilient individual capable of managing critical technical platforms budgets to quality, time and resilience objectives\nStrong strategic planning and execution skills, including business case development and benefits realisation\nAbility to operate across boundaries of location, business and technical change organisations, with broad infrastructure and business systems knowledge\nAble to balance local urgency with global strategic direction\nOutstanding written/verbal communication and presentation skills\nAbility to work with external partners, influencing and directing, where needed, priorities for the benefit of HSBCJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}