{
    "Job ID": "69873808",
    "Description": "OSTTRA IndiaThe Role: Associate Director – Scrum MasterThe Team: The OSTTRA Technology team is composed of Capital Markets Technology professionals, who build, support and protect the applications that operate our network.  The technology landscape includes high-performance, high-volume applications as well as compute intensive applications, leveraging contemporary microservices, cloud-based architecturesThe Impact: Together, we build, support, protect and manage high-performance, resilient platforms that process more than 100 million messages a day. Our services are vital to automated trade processing around the globe, managing peak volumes and working with our customers and regulators to ensure the efficient settlement of trades and effective operation of global capital marketsWhat’s in it for you: We are looking for highly motivated technology professionals who will strengthen our specialisms, and champion our uniqueness to create a company that is collaborative, respectful, and inclusive to all. This is an excellent opportunity to be part of a team based out of Gurgaon and to work with colleagues across multiple regions globally.Responsibilities:As a Senior Scrum Master, you will work within cross-functional, globally distributed team to lead the planning, estimation, and delivery of client projects and programs.Identify and realize business outcomes using most suitable and effective Agile project management approach, methods, processes, and tools to ensure a high degree of delivery and solution quality\nOrganize and lead ongoing team planning sessions to identify key risks, issues, and dependencies across workstreams \nOptimize delivery within a project or program through insights and mitigation strategies for project risk management\nGuide internal and external senior stakeholders on Agile program delivery methods ceremonies and protocols to streamline and structure workflow to deliver timely results\nCoach and mentor team members to develop agile capabilities, self-organization etc.\nFacilitate daily stand-up meetings sprint planning retrospective and sprint demos\nIdentify and track key metrics and maintain reports\nWork with the product owners to ensure that the Product Roadmap and release plan is revised periodically\nWork with the scrum team to translate roadmap into team specific release planning and sprint planningWhat We’re Looking For:10+ years of Experience working with Agile delivery methods like Scrum and Kanban, waterfall, and hybrid systems\nAbility to effectively communicate and collaborate with all levels of the organization to achieve broader insights into managing work streams and outcomes\nCapable of earning trust and influencing stakeholders without formal authority to required results\nProficient with collaboration tools including Atlassian Jira and Confluence, and Microsoft Office applications\nFlexible, collaborative, and able to manage and prioritize multiple tasks simultaneously to maintain teamwork and optimal project flow\nExcellent communication skillsThe Location: Gurgaon, IndiaAbout Company Statement:OSTTRA is a market leader in derivatives post-trade processing, bringing innovation, expertise, processes and networks together to solve the post-trade challenges of global financial markets.  OSTTRA operates cross-asset post-trade processing networks, providing a proven suite of Credit Risk, Trade Workflow and Optimisation services. Together these solutions streamline post-trade workflows, enabling firms to connect to counterparties and utilities, manage credit risk, reduce operational risk and optimise processing to drive post-trade efficiencies.   \nOSTTRA was formed in 2021 through the combination of four businesses that have been at the heart of post trade evolution and innovation for the last 20+ years:  MarkitServ, Traiana, TriOptima and Reset.  These businesses have an exemplary track record of developing and supporting critical market infrastructure and bring together an established community of market participants comprising all trading relationships and paradigms, connected using powerful integration and transformation capabilities.-----------------------------------------------------------Equal Opportunity EmployerS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.-----------------------------------------------------------Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}