{
    "Job ID": "69875753",
    "Description": "JOB DESCRIPTIONBulk Production:Ensure Bulk placement falls on aligned LT & within capacities.\nEnsure Supply chain issues are caught before hand & resolved.\nResponsible for bulk execution of 200-400 PC9s and 5 million units annually by liaising with mills/Suppliers/Support departments/trims suppliers/Prod development.\nResponsible for on-ground monitoring of operations to verify & report production statuses, proactively seeking bottlenecks before they endanger deliverables.\nActively liaise with FE & PI teams on bulk issues.Production Planning:Analyze & work on capacities & input in System.\nUse Projection system of Board Walk to send, get supplier confirmations, and upload data.\nMinimize MOQ upcharges and liabilities by effective planning, negotiation.\nCreate alternate solutions to reduce lead times wherever possible.Product Development/Pre-prod:Develop FT’s, protos, FLA, CS samples as requested by PD – liaise with FE/PI teams & ensure deadlines are met & issues resolved.\nMonitor pre-production approvals i.e. APS Finish, APS Fit, Size Sets, FTL’s, & First of Production samples are sent within the specified timelines.\nLiaison with fabric and quality teams to ensure fabric and garment quality, within LS&CO specifications of both aesthetic and physical standardsControl:Work with Quality and Finishing teams to ensure any issues in bulk production are identified as a early as possible & work on resolution with concerned.\nImplement and standardize LS&Co. SOPs, protocols, and processes with Suppliers.\nLiaison with vendors, IT, and third-party logistic teams to ensure accurate and transparent data representation in Levi’s systems.\nAchieve strong customer services through quick responses, efficient problem solving and creative solutions along with market intelligence.\nCreate and maintain OAs in SAP and Solar accurately for on time Purchase Order issuance and delivery.LOCATIONFULL TIME/PART TIMECurrent LS&Co Employees, apply via your Workday account.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}