{
    "Job ID": "69872615",
    "Description": "Join Us!We combine AtkinsRéalis project management expertise and Hitachi Energy’s deep technological knowledge to create a company dedicated to substations – we are Linxon!The Technology Support Analyst is responsible for the resolution of all IT-related incidents and service requests within their region. Their role is to both provide second-line support for the Linxon Business and supervise the Local IT Support resources in India. They are responsible for resolving support requests as well as continuous service delivery demandsWhat will you do?Manage and prioritise all 2nd line incidents and requests according to defined SLAs (within specific regions) - ensure 100% adherence to RFS & INC best practice guidelines.\nGeneral troubleshooting of the desktop computing environment based on service requests logged via the Global Service Desk.\nDeploy IT Hardware, record, and track assets during deployment according to IT Services standards and workflow procedures.\nMaintain regional service excellence by providing customers with continual and regular updates throughout the management of their incidents and requests.\nTroubleshooting a range of technology and telephony issues: investigating, diagnosing faults, and working through to resolution.\nOwn, monitor and maintain equipment rooms to comply with IT Services and QSSE standards and mitigate risks arising from audits, fire, safety, or other risk assessments.\nSupport the set-up of new offices, sites or projects across the local region.\nManagement of Service Now ‘Stock Rooms’ and ownership of goods receipting process.\nResponsible for the recycling of all redundant IT equipment and technologies, ensuring correct disposal according to Asset Disposal Policy.\nEscalate and track issues with vendors and other internal support teams to troubleshoot problems with hardware and software.\nExhibit a flexible approach to working and may need to visit other Linxon sites.Experience, Education and other Required:At least 5+ years’ experience in IT Service Management principles and processes.\nHigh level of proficiency and knowledge of working in a Corporate IT environment.\nSolid understanding of hardware and software asset management processes.\nWorking knowledge of database/excel structures/tables/configurations.\nProven experience in data analysis and good numeracy, analytical and reporting skills.\nQualifications: Certification from Microsoft\nITIL V3/4 Qualification\nWorking knowledge of Service Now\nCertified in project management methodology e.g., Prince2 Practitioner, MSP, APMWhat we offer:In return, we offer a wide range of rewards and benefits,20 days Privilege Leave, 13 days Emergency leave and 14 Public holidays per year\nMedical Insurance, Life Insurance\nGlobal Career Progression OpportunitiesED&I:When it comes to diversity and inclusion, we see things differently at Linxon - we encourage applications from people of all races, ages, genders, religions, sexual orientations and more - so whoever you are, we hope you’ll see things our way, too.About LinxonShaping energy solutions to empower sustainable connectivity.We combine AtkinsRéalis project management expertise and Hitachi Energy’s deep technological knowledge to create a company dedicated to substations – we are Linxon.Linxon’s vision is to deliver the best market offering for turnkey substation projects through world-class power technologies and delivering the highest level of competence in managing infrastructure projects.As a leading engineering company, we help our customers with turnkey substation solutions in the field of power transmission, renewable energy, and transportation.In this role, you will have the opportunity to be part of a new company as it evolves and help shape it for the future. If you like new challenges, have an entrepreneurial spirit, and are interested in working with other motivated professionals with expertise in the Substations EPC business, then this is the new opportunity for you.To know more about the Linxon please click on the link below.Building the infrastructure to power the world - we are Linxon! - YouTubeJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Civil Engineering",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}