{
    "Job ID": "69873077",
    "Description": "The SOX Program Office - Vice President role supports the SOX Compliance Program Lead in managing the core operations of Citi’s SOX program, covering control scoping and risk assessment, control documentation, assessment, issues evaluation and other program activities, working closely with cross divisional stakeholders across the firm. Responsibilities:Assist in the annual / quarterly risk assessment and scoping processes to identify areas of focus for SOX program, working with cross-divisional stakeholders and SMEs (Accounting Policy, Controllers, etc.)\nLead or assist in providing subject matter expertise, guidance, training and support to process and control owners across the firm related to controls scoping, documentation, assessment and issues evaluation\nLead or assist in the evaluation and documentation of issues (identified through internal sources / external audit) using quantitative and qualitative factors to determine SOX severity classification as per defined methodology and materiality assessment framework\nLead or assist in the ongoing tracking of SOX issues remediation, working with cross-divisional stakeholders\nAssist in quarterly senior management reporting processes, including preparation of materials, review decks, memos, etc.\nPerform quality assurance procedures related to SOX controls scoping, documentation and assessment by firmwide process and control owners\nSupport engagement with the other risk and control functions across the firms - Internal Audit, Operational Risk, etc. as well as External Auditors\nAssist in the review and improvement of SOX Program methodology and practices, including innovation initiatives and maintenance of policies and procedures\nBe a change agent to deliver and maintain a best in class SOX program\nManage multiple competing priorities and meet strict deadlines, both internal and externalQualifications:Bachelor's degree in Accounting, related certifications (CA, CPA, CIA, CISA or similar) preferred\n8-12 years relevant experience, including within a public accounting firm (auditing of financial services a plus)\nExperience with SOX scoping and testing, SOX 404/302, FDICIA, or Internal Audit preferred\nWorking knowledge of internal control concepts including the COSO 2013 internal control framework preferred\nFinance or related experience with a focus on process design and improvement. Preference for experience supporting regulatory compliance, operational risk management, or financial reporting.\nUnderstanding of common financial products and processes in consumer banking, institutional banking, corporate treasury, and various other corporate finance activities\nExcellent verbal and written communication skills and negotiation skills\nEffective project management skills\nIntermediate to advanced knowledge of MS Word, Excel and PowerPoint\nExperience working with Workiva Wdesk a plus\nProven ability to work effectively with virtual teams, to set realistic deadlines, and to effectively manage one’s own time and priorities to meet those deadlines including regular communication and updates\nProcess oriented, data driven, and exceptionally well organized and detailed\nAbility to work individually or with cross functional teams on BAU as well as various projectsThis job description provides a high-level review of the types of work performed.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}