{"Job ID": "69872910", "Description": "Administrative activities:Makes patients and their families feel welcome in the hospital.\nExhibits care and service with empathy.\nProvides personalized service by identifying regular patients, greeting patients by name and maintains their details.\nMaintain the Key Result Areas (KRAs) / Key Performance Indicators (KPIs) related to each section as describing in details in “Orientation Checklist” in the appendices.\nsection Arranges for an interpreter as needed.\nRecognizes patients in need of immediate medical attention and activates appropriate response systems.\nFacilitates communication between Front Office Executives and patient/customer and other members of the health care discipline.\nCoordinates customer care services beyond the reception area.\nRelays feedback from patients and their families to the Front Office In Charge.\nGreets patients and their families and enquires about the nature of their visit / call and implements appropriate course of action.\nProtects patients' rights by maintaining confidentiality of personal and financial information.\nMaintains operations by following policies and procedures, reporting needed changes to the Customer Relations Manager.\nContributes to team effort by accomplishing related results as needed\nCompetence is demonstrated in all performance output areas\nMeet patient and customer expectations and maintain quality service principles \nManages complaints in a time sensitive manner \nDocument and resole complaint where applicable \nParticipate in Quality Improvement projects\nCompany values are demonstrated in behaviour\nParticipates in educational programs, in-service meetings and trainings as directed \nAttends meetings as requiredRecognizes patients in need of immediate medical attention and activates appropriate response systems.\nDirects patients to the right department by escorting them.\nFacilitates communication between Front Office Executives and patient/customer and other members of the health care discipline.\nCoordinates customer care services beyond the reception area.\nConduct daily patient satisfaction survey\nConduct daily patient visit\nRelays feedback from patients and their families to the Customer Relations ManagerAnswers incoming calls within 3 rings\nResponds to callers' needs in a professional, service-oriented manner and maintains the highest level of customer satisfaction by seeking first call resolution.\nAnswers caller's questions at the same time tries to obtain full understanding of what information is being requested.\nUnderstands the requirement of the callers and provides information accordingly. Provides accurate information about the services offered by the Hospital.\nDirects calls to the appropriate department/individuals; both external & internal calls.\nMaintains an accurate telephone directory to ensure connecting callers to the desired destination.\nConducts appointment bookings for the clinics.\nProvides physician referrals to callers.\nExhibits urgent call management techniques and diplomacy while dealing with difficult situations.\nResponds to caller query/ problems within assigned level of authority. \nReports in a detailed and accurate manner to the Call Center Supervisor, when required.\nEnsures the caller is on hold when transferring or briefly leaving the line and informs the caller prior to doing so.\nDirects complaints to the concerned department and transfers extremely difficult callers to the Call Center Front Office In ChargeRegisters new patients in the Information Technology system ensuring accurate information is collected and opens new medical record accordingly.\nMessages are taken and delivered to appropriate individuals within set time frame \nTelephone etiquette principles are followed \nPatient demographic data and accurate eligibility details collected and entered into system as per company standards \nSchedules appointments, collects payments, enters charges, performs back office work and issues receipts as specified in the duty rota. \nCommunicates all relevant information to Front Office In Charge on a daily basis.\nExpedites flow of visitors/patients and ensures that each person receives customer care service that exceeds expectations by providing a welcoming environment.\nProvides information about medical insurance coverage to patients and checks with the accounts/insurances department to ensure accurate information before sending the patient to the doctor.\nComforts patients by anticipating patients' anxieties; answering patients' questions; maintaining the reception area.\nRecognizes patients in need of immediate medical attention and activates appropriate response systems.\nPatient / Customer are welcomed and received according to company procedure \nRegistration forms are signed and filed. \nInsurance Card copies kept on patient files/system. \nPatient attendance confirmed by entering data into the system as per company standards. Patient medical records requested where applicable. \nFinancial Consent Form signed by patient/legal guardian \nAct as source of information about hospital/clinic services, policies and rulesPatients are pre-admitted as per pre-admission procedure \nPatients are informed of documentation required and relevant financial aspects, for admission \nPatients are discharged as per procedure \nDischarge records are completed and processed as per procedure Generation of timely and accurate bills, receipts and refunds as per hospital policy.\nCollecting and remitting cash. \nRemit all the bills/ cash accurately to finance at the end of the shift \nGeneration of cash/credit summary and reports on a daily basis \nDaily reconciliation of collection summary with cash remittance \nUpdating of patient accounts daily \nChecking on interim bills and following up on patients for further deposits \nReconciliation of charges posted bills not raised on a daily basisJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}