{"Job ID": "69872821", "Description": "JOB DESCRIPTION:About AbbottAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.Working at AbbottAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:·Career development with an international company where you can grow the career you dream of.·A company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.·A company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.Trade ManagerThis position works out of our Kuwait Office in AbbottNutrition DivisionOur nutrition business develops science-based nutrition products for people of all ages, from helping babies and children grow, to keeping adult bodies strong and active. Millions of people around the world count on our leading brands – including Similac®, PediaSure®, Pedialyte®, Ensure®, Glucerna® and ZonePerfect® – to help get the nutrients they need to live their healthiest life.What You'll doAccountable for the achievement of Kuwait Sales Target, Market Share and Profit Objectives in each channel (Kuwait Supply Company, COOPs, Modern Trade, eCommerce) through own people and 3rd Party Agents to deliver the Customer, Consumer & Shopper propositions at the point of purchase.\n\nLeverage business analytics and customer insights to conduct on-going analysis of growth potential throughout and create a strategy to establish Abbott as the brand of choice throughout the country.\n\nLeverage Marketing and Customer analytics, CRM data and other measures (as required) to track and hold the team accountable for territory / country progress against KPIs, by observing and coaching sales team and influence distributor network.\n\nAccelerate the development of digital knowledge and application in Supervisors through coaching and role-modeling.\n\nAct in alignment with compliance and regulatory expectations.\n\nLead integrated Business Plan (in coordination with marketing) towards achieving company objectives.\n\nOwn Promotional Strategies implementation & In-Store Execution through Merchandizing Team Management & in close coordination with sales team.\n\nTurns business intelligence data (IMS, off shelf, inventories, AC Nielsen) into actionable insights.\n\nMonitor and present sales trend on monthly basis.  Take corrective actions in view of negative variance vs sales forecast.\n\nMonitor tier 2 DOH with key customers.\n\nMonitor market trends and competitor activities.Business Outcomes:High performing, agile trade sales team sharing a collective understanding of business direction, goals, and how they contribute, strong talent pipeline of key talent.\n\nPreferred supplier status.\n\nAdherence to contractual obligations and compliance.Key Business Challenges:Driving growth and market share across in an increasingly complex market (i.e., ambiguity about future, decreasing access, differential expectations about ‘value’, etc.)\n\nContinuously improving digital knowledge and application within the team.\n\nCompartmentalization of data needed to inform strategy and optimize ROI.\n\nDeveloping and retaining talent of varying levels of capabilities, including creating adequate development opportunities and transitions to retain talent.\n\nBalancing adaptability with driving results, making decisions in the face of ambiguity and evolving information, while thinking strategically about execution.\n\nLeading and influencing within a large matrix organization, identifying, and accessing the right stakeholders to solve issues and drive performance through continuous transformation.Required Qualification:Min bachelor’s degree with major Business or Commerce, Master degree in same field is an advantage.\n\n10 years experience, minimum 2 years as Trade Manager or similar.\n\nProven record of working closely with or at trade channels is essential.\n\nEnterprise thinking.\n\nStrong business insight skills (integrating digital tools with traditional touchpoints across. channels & platforms, interpreting and translating online and offline customer behaviors into strategic activities)\n\nAbility to make new connections between data and insights, and to make these ideas understandable and actionable to others.\n\nStrong relationship building, stakeholder (internal) and customer (external) management.\n\nInvesting highly in team development, prioritizing, and valuing individual development planning and coaching, and a holistic approach to talent management.\n\nValid transferable Kuwait visa.Follow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life. Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.The base pay for this position isIn specific locations, the pay range may vary from the range posted.JOB FAMILY:DIVISION:LOCATION:ADDITIONAL LOCATIONS:WORK SHIFT:TRAVEL:MEDICAL SURVEILLANCE:SIGNIFICANT WORK ACTIVITIES:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Kuwait", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}