{"Job ID": "69870429", "Description": "Senior System Engineer (Microsoft)Job DescriptionResponsible for the maintenance, configuration, troubleshooting, and reliable operation of computer systems, network servers, and virtualization,\nUnderstand current architecture, analyze and optimize the performance of systems,\nIdentify points to be improved, eliminate bottlenecks, plan for capacity upgrades, and design long-term strategic goals and short-term tactical plans for managing & maintaining the infrastructure,\nTo ensure that the Container Platform architecture is designed, implemented, and up to date,\nDesign and implement monitoring systems and procedures for 7/24 uptime requirements of highly critical systems,\nDatacenter Hardware planning, Requesting, Installing and configuring, maintenance,\nResearch, analyze and recommend new edge technology, architecture, frameworks, and products that serve our product's needs better.Technical SkillsBachelor's degree in Computer Science or equivalent,\nHave a minimum of 5 years of experience in a similar position,\nAdvanced expertise in Microsoft operating systems,\nBackup and replication planning and management,\nKnowledge of Azure Active Directory,\nKnowledge of Kubernetes build, backup, and storage Technologies,\nVMware virtualization environments,\nWorking experience in TCP/IP, AD, DHCP, and DNS,\nHave certificates of AWS system administrator (plus),\nExperience in HPE - DELL server storage product,\nKnowledge of DC and DRC management processes.\nExperience in MS Exchange.SkillsExcellent communication skills, sense of urgency, accountability, and ownership,\nGood problem-solving and analytical skills,\nStrong collaboration skills, responsive to project needs and demands in a fast-changing environment,\nThe passion for learning and continuous improvement,\nAbility to work in a team environment as a reliable, responsible, and self-motivated team player,\nFluency in English.What We OfferMarket-competitive salary and pay-for-performance bonuses.\nWe care about your professional development; you can use your learning budget on any platform.\nWe provide an option plan to all Papara team members.\nWe care about you, private health insurance.\nFree access to all Papara services, 10% cashback on Papara Card payments, and 20% cashback on bill payments via Papara.\nTechnical equipment package that covers what you need.\nFree platform memberships; Spotify, YouTube, Netflix.\nNo politics; You will be a part of a team that focuses on productivity and success. You will have the opportunity to work in a dedicated team that cares about your development.\nWe are against any form of discrimination. We believe that every individual has a unique personality.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Istanbul, Türkiye", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}