{"Job ID": "69873231", "Description": "If you need assistance during the recruiting process due to a disability, please reach out to our Recruiting Accommodations Team through the Accommodation Request form. This form is used only by individuals with disabilities who require assistance or adjustments in applying and interviewing for a job. This form is not for inquiring about a position or the status of an application.Technical Operations AnalystThe Site Reliability Operations Insights team provides customer and system insights through customer feedback, live site monitoring, performance and service availability analysis. We focus on supporting and improving the production environment through detecting improvement opportunities, friction points and quantifying the impact to drive prioritization with our product, technology, engineering and conversation platform teams.What you’ll do:Actively supervise customer experience through signals from customer feedback and monitoring the production environment\n\nUse wide range of tools (internal / 3rd party) to troubleshoot and investigate the issues reported by customers and translate the findings into business recommendations\n\nIdentify and raise disruptions for any customer or agent-facing services or applications\n\nTranslate business impact on a global scale to support the determination of priority for a given issue\n\nWrite analytical narratives tailored to product needs that may push unlocked improvement opportunities in product backlogs\n\nEngage with internal product and technology teams to further analyze and gather information\n\nProvide reporting and analytics of customer insights and how they impact the business, including regular and ad-hoc reporting\n\nFind opportunities to automate processes eliminating manual work and driving efficiencies\n\nUnderstand and follow processes and knowledge documents with integrity\n\nCollaborate with other teams to understand and stay updated on potential opportunities and work cohesively towards common goals\n\nAssist on various projects and tasks as assigned by leadership\n\nEffectively interact with employees at all levels of the organization and work with a variety of people from diverse backgrounds\n\nShare complex content in simple language (verbal and written) and lead by example for the team to look up toWho you are:The qualified candidate possesses 3+ years of experience in the customer analytics space.\n\nStrong analytical and quantitative skills - experience pulling, manipulating, and deriving insight off of data; SQL, Tableau, Omniture, Splunk, Datadog, Qubole (data lake platforms)\n\nEntrepreneurial approach towards problems, meaning acumen and enthusiasm to solve abstract business problems by using data analytics.\n\nUnderstanding of Tech Ops workflows like incident management, production readiness and deployment, capturing failed customer interactions from live site monitors and identify signals for better customer experience.\n\nExperience using agile work management tools such as Jira, Trello or equivalent.\n\nCritical thinking skills and logical reasoning abilities are important for being effective in the role.\n\nImplementing the scientific method with the ability to correlate various data sources to strengthen investigation results with multiple lines of evidence.\n\nUse of good judgment and attention to detail to identify issues, perform analysis and share findings with product, engineering and business teams.\n\nCapable of efficiently prioritizing and executing tasks in an evolving environment\n\nA curious mind and interest to understand the nuances of a highly complex technology stack by performing self-motivated research to learn independently.\n\nA strong commitment and willingness to learn as well as share your knowledge with the team.\n\nExcellent written and verbal English skillsAbout Expedia GroupExpedia Group (NASDAQ: EXPE) powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, we help people experience the world in new ways and build lasting connections. We provide industry-leading technology solutions to fuel partner growth and success, while facilitating memorable experiences for travelers. Expedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™.© 2021 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50Employment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals to whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}