{
    "Job ID": "69872145",
    "Description": "Skills:\n- Strong leadership abilities: A floor supervisor should possess strong leadership skills to effectively manage motivate team of employees.\n- Excellent communication skills: Clear and effective communication is necessary to convey instructions, provide feedback, and resolve any issues among team members.\n- Organizational skills: A floor supervisor must have strong organizational abilities to ensure smooth operations and efficient utilization of resources.\n- Problem-solving skills: ability to quickly identify and address any issues or challenges that may arise on the floor is crucial for a successful floor supervisor.\n- Customer service orientation: A floor supervisor should have a customer-centric approach and be to resolve customer complaints or concerns in a timely and satisfactory manner.\n- Time management skills: To effectively manage work schedule, handle multiple tasks, and meet deadlines, a floor supervisor needs to have strong time management skills.\n-ibility adaptability: The ability to adapt to changing situations and handle unexpected challenges is important for a floor supervisor as operations may vary from day to day.\n- Attention to detail: Paying close attention to detail that all tasks are completed accurately and efficiently, and that the floor is well-maintained and presentable at all times.\n- Conflict resolution skills: A floor supervisor should be able to mediate and resolve conflicts that may arise between employees or with customers, while maintaining a professional and respectful demeanor.\n- Knowledge of safety regulations: An understanding of safety regulations and protocols is essential to ensure a safe working environment for all employees and customers.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Istanbul, Türkiye",
        "Company Industry": "Hospitality & Accomodation",
        "Company Type": "Employer (Private Sector)",
        "Job Role": "Other",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}