{
    "Job ID": "69873656",
    "Description": "About Product Marketing Manager roleResponsibilities (not exhaustive)●     Product messaging and positioning: develop and revamp product messaging along with relevant stakeholders. Proliferate differentiating features and capabilities using PMM assets.●     Product launch: lead product launches and new releases and work with the product management team for planning, release, and go-to-market initiatives.●     Competitive intelligence: Develop and update competitive intelligence and ensure that it is leveraged by sales and other teams.●     Subject matter expertise: develop subject matter expertise in terms of technical features and capabilities and the relevant SaaS market segment.●     Product-centric thought leadership: contribute towards development of product-centric thought leadership and drive effective distribution via various marketing channels. function as a subject matter expert for development of content marketing assets.●     Sales and partner enablement: contribute towards sales and partner enablement initiatives. Ensure that product marketing assets are utilized for driving commercial outcomes.●     Strategic marketing initiatives: lead ideation and delivery of strategic marketing initiatives leveraging PMM assets, including, thought-leadership webinars, virtual events, partner events and others.Education / skill set●   Prior experience in B2B SaaS product marketing.●   Strong interpersonal and communication skills. Should be able to effectively work across cross-functional teams.●   Ability to work independently, and manage multiple projects simultaneously.●   Bachelor of Technology (B.Tech) degree, with good understanding of SaaS and various architectural paradigms. Master’s degree in business or engineering preferred, but not necessary.●   Excellent written and communication skills.Experience●   Overall experience of 5 years, with at least 2 years’ experience in software/ SaaS product marketing.Abilities and traits●Product marketing: This dimension will evaluate you on how well you develop product messaging driving commercialization of Disprz’s products, develop subject matter expertise, and competitive intelligence for sales enablement. An exceptional performance in this area means that you are recognized as an SME for products in the marketing team.● Communication: This dimension evaluates the quality of your written and oral client communications, including email communications, formal written documents, oral presentations, meetings and discussions. An exceptional performance in this area means that your managers and peer group love to work with you and you are in control of the business workflow.location | Mumbai & BengaluruAbout disprzDisprz is an exciting growth stage series C SaaS company in the learning and skilling tech space. Serving over 2 million + learners,It has established itself as a leading start-up in this space in emerging APAC, a fact confirmed by the Government of India's Atma Nirbhar App award (#1 in the eLearning category) and its enviable client list of 300+ customers in every continent of the world, which includes the leading household names such as Amazon, Bajaj Insurance, Tata Motors, Uber, Pidilite, Indian oil, PETRONAS, DG Sharaf, to name a few. Disprz has recently forayed into developed markets and enjoys product-market fit and is now ready to scale in the US, UK and ANZ markets as well. Disprz boasts of a great culture code that empowers teams, values work-life balance and encourages innovation and experimentation.If you are driven, curious, and passionate about tackling technical challenges and driving innovation forward, we believe that you would be a great fit for our team at Disprz.Why Join disprz? / What we offer for you ?Diversity & inclusion - to value the right skills and ambitions, no matter what your age, experience, nationality, gender is.Top decile package - Happens to come as an added perk as we recognize the great work you do.Well being programs - To ensure that you are healthy and happy at all timesGlobal exposure - As we are growing and disprzing our presence across the worldLife at disprz is... Fast-paced yet Balanced | Cutting edge yet Classic | Challenging yet FunA Sneak-Peek into our Culture - https://youtu.be/GYlPdgY_C40?feature=sharedJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Mumbai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}