{
    "Job ID": "69874460",
    "Description": "Company Information: Hitachi Energy is a pioneering technology leader that is helping to increase access to affordable, reliable, sustainable, and modern energy for all. We help to power your home, keep the factories running, and our hospitals and schools open. Come as you are and prepare to get better as you learn from others. Bring your passion, bring your energy, and plug into a team that appreciates a simple truth: Diversity + Collaboration = Great Innovation. Visit us - www.hitachienergy.com About the business: The Hitachi Energy Indian Operations Center (INOPC) is a competence center with around 2300 skilled engineers who focus on tendering, engineering, planning, procurement, project Management, functional system testing, installation supervision, documentation and commissioning. However, over the last decade, it has evolved to become the largest Operations hub. The India Operations Centre team at Chennai, Bangalore and Gurugram supports Hitachi Energy’s units in more than 40 countries across a wide portfolio of all the four business units in Hitachi Energy To date, the team has executed engineering and commissioning for projects in more than 80 countries. Your Responsibilities: Ensures that the M&S Operations Support Team is organized, staffed, skilled and directed. Guides, motivates, and develops direct/indirect reports. Develops the skills and competences to create a highly effective and efficient team. Responsible for the overall guidance, governance, team setup as well as tracking and managing day to day activities and priorities of the M&S Operations Support team. Acts as the primary point of contact for all M&S Operations Support activities e.g., Web Content Management, SharePoint/Power Apps, PowerBI and Salesforce reporting and M&S Master Data. Reviews and ensures conformance with global and local M&S standards, rules, tools, policies, and processes supporting implementation and monitoring of utilization of M&S processes & tools. Proactively captures and documents business demand to understand the needs for support from the M&S community and ensures that Service Catalogue is always up to date and aligned with the capacity and capabilities of the M&S Support team. Reports to Sales Operations leadership about the development and status of the M&S support team capacity, competences, knowhow, infrastructure, etc. needed to address critical business demand. Together with the M&S Operations Support Team, plans and executes M&S Operations Support services and continuous improvement projects. Supports the Sales Operations leadership to define and deploy strategy, objectives, and targets in alignment with Hitachi Energy strategy across M&S to deliver continuous improvement via L6S methodologies. Defines Key Performance Indicators (KPIs) for L6S Deployment for Sales Operations. Ensures that performance of continuous improvement initiatives is regularly reported and audited. Facilitates the sharing of knowledge and best practices amongst change agents in the M&S community across the organization. Communicates and reports status of the M&S Operations Support activities to M&S stakeholders. Lives Hitachi Energy’s core values of safety and integrity, taking responsibility for their own actions while caring for colleagues and the business. As well as ensures that appropriate Health, Safety and Environment (HSE) and business compliance standards and regulations are implemented. Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Your Background: A bachelor’s degree in an applicable discipline. 5 or more years of experience with project management frameworks, methodologies and tools. Proven ability to lead, motivate, inspire, manage, and develop associates and team members. Demonstrated ability to effectively communicate to, motivate and inspire a diverse group of individuals, including senior management. Proficient English language skills. Proven ability to interact effectively in a cross-functional team. Strong project management skills with the ability to juggle multiple priorities simultaneously in a fast-paced environment. Strong attention to detail and ability to work under tight deadlines. Demonstrated ability to translate data into actionable recommendations. Solid analytical thinker with desire to drive business operations improvements. Excellent judgment and independent decision-making skills Experience in developing web-based applications (e.g., Java, dot Net). Exposure to Sales Processes and tools, e.g., Salesforce (SFDC) or other CRM systems.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}