{
    "Job ID": "69873073",
    "Description": "Our client, an Operator company, is urgently looking for a “Instrument & Control Lead\" willing to work under the following conditions for an upcoming project:Terms and ConditionsWork hours per day: 10 hrs./dayWorkdays per Week: 6 days/weekWorkday per Month: 26 days/monthContract Duration: 36 MonthsCurrent Location: Qatar, Onshore.Job Responsibilities Highlights:Ensure that the Contractor’s Instrument, Control and Telecom Topsides, Onshore Facilities (Offshore scope) Engineering, and Gas and MEG Pipeline designs comply with the Contract requirements including codes and standards. Provide guidance to the contractor to promote compliance.\nPlan and schedule the I&C engineering deliverables to enable efficient project execution, ensuring technical alignment and compliance with operational policies, standards of business conduct and project management system.\nSupervises and ensures that the Contractor’s Functional Safety Topsides, Onshore Facilities (Offshore scope) Engineering and Pipeline designs comply with the Contract requirements including codes and standards. Provide guidance to the contractor to promote compliance.\nParticipate to key design workshop and ensure that Instrument, Control, Functional Safety design recommendation are correctly implemented, and actions closed before the end of EPCI (Lessons Learned, Value Engineering, HAZOP, SIL, LOPA, engineering criticality assessment, etc.).\nSupervises the Engineering interface between the Instrument, Control and Telecom of Topsides, Onshore Facilities (Offshore scope) and Pipeline engineering and the following teams: Operations, Drilling, Well Management, the Jacket, the pipelines from the topside’s perspective, the Onshore Project Team.\nManage the Integrated Control and Safety Systems (ICSS) purchase order with the EPC Contractor and System Vendor in accordance with the roles and responsibilities given in the contract to ensure safe and seamless integration of the systems without any disturbance to the existing operating facilities.\nSupports Offshore Engineering Manager and Offshore Engineering Division Manager Pipelines in monitoring the contractor’s progress on delivery of the required documents in the Instrument Control and Telecom of Topsides and Pipeline disciplines.\nCoordinate with Subject Matter Experts with respect the disciplines involved in delivery of the Instrument Control and Telecoms related to Topsides and Pipelines Engineering and ensures endorsement of Process Technical deviations to Company specifications when required. Knowledge and/or Experience:Bachelor’s degree in Instrument & Control Engineering.\n15 years’ experience working in Instrument and Controls engineering, preferably in a major project environment within the Offshore and Onshore oil and gas industry and having a broad knowledge of engineering execution including design standards, specifications, codes, safety criteria, offshore facilities design, construction, and operations.\nPrevious knowledge of Brownfield engineering and execution required.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Qatar",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}