{"Job ID": "69874369", "Description": "Lead Design Engineer ProcessApply nowProvide technical guidance to the Process team in preparation/review of PFD, P & ID, HFD & Piping Material Specification, Sizing of Equipment, Utility Sizing, Heat Balance, Mass Balance, Hydraulic Calculation, Pump Selection, Process Instrumentation Datasheet, etc.\nProvide technical guidance in design/review using simulation soft wares namely, Bentley SisHyd, CHEMCAD & ASPEN, HTRI, CCTherm, B-JAC (HTFS), Mechanical design of Vessel, Reactor, column & Heat Exchanger as per ASME on PVElite, HAZOP and HAZIS\nProvide operational guidance and direction to maintain a high quality of technical performance through deliverables and successful overall project delivery.\nProvide and seek various approach and means for productivity improvement.\nProvide technical guidance in design optimization, value engineering, design innovation, automation and digital technologies.\nRoll out company new initiatives, digital delivery, innovation, associate business etc.\nChecking and review process of design deliverables and ensure high quality standards.\nPromote technical excellence through right design at first time and all the time.\nEnsure Safe by Design approach in all design at all times.\nManage inter-discipline conflicts and technical issues with clients.\nManage change control / variation process internally and with clients.\nDevise and guide efficiency improvement methodologies through engineers, designers and modelers\nMeasure and monitor performance of the team and motivate for increasing productivity.\nPromote standardization and workflow / sequences across the disciplines.\nAssess team competency and skills, identify specific trainings and development required, plan and implement.\nEnsure career development plan and talent management of the staff.\nManage recruitment through HR selecting right candidate on board ensuring pyramid organization structure.\nPromote / enhance Ownership and Accountability culture.\nGuide technical clinics to enhance technical skills and encourage technical presentation by the team for sharing knowledge and lessons learnt.\nChampion knowledge management through Standardization, SOP, Work Instruction Manual, Checklist, Design guidelines, Design calculation, standard specification, drawings and schedules, standard technical bid survey templates etc.Qualified Chemical Engineer from reputed university / institute preferably with master's in chemical engineering\nExperience in preparation of PFD, P & ID, HFD & Piping Material Specification, Sizing of Equipment, Utility Sizing, Heat Balance, Mass Balance, Hydraulic Calculation, Pump Selection, Process Instrumentation Datasheet, etc.\nExperience in Gas pipeline Network Hydraulic design with Bentley SisHyd.\nExperience in Process design & simulation with CHEMCAD & ASPEN\nExperience in Process Design of Heat Exchanger with HTRI, CCTherm, B-JAC (HTFS)\nMechanical design of Vessel, Reactor, column & Heat Exchanger as per ASME on PVElite & Designer desktop,\nExperience in HAZOP and HAZIS studies.\nGood experience with Process Design on Various Water Treatment & Wastewater Treatment software likes ROSA, CAROL, Aqua, CADIX, Purolite etc.\nProven track record of technical guidance with managerial and administrative capabilities\nGood communication and inter-personal skills\nWell versed with Indian and International Standards and local statutory norms\nStrong commercial grasping in terms of increasing staff productivity and efficiency and managing deliverables and completing projects within budgeted cost.\nProvide guidance on the approach to Sustainability.\nDelivered project for the industry / manufacturing sectors in chemical, pharmaceutical and industrial plants.\nMember of relevant institution with strong networking amongst fraternity.\nProactive and quality oriented, with a client-centric outlook, simultaneously with a high sense of accountability.\nA demonstrable track record of meeting exacting technical standards\nGood commercial awareness and communicator.Manage design review effectively ensuring no inter-discipline clash/interference.\nGuide professional excellence and increase profile through participation in technical symposiums and conferences, writing technical papers in journals, presenting in national/international conferences, participating in technical competitions and awards etc. by self and team.\nDrive Customer Feedback in all projects, work on the gaps and ensure Customer Satisfaction\nAssist BD and Proposal team through providing technical and commercial inputs, identifying technical and commercial risks and providing mitigation in Proposals to win projects, meet clients for demonstrating technical expertise and creating clients? confidence\nAssist Project team in identifying technical and commercial risks and providing feasible mitigation.\nA team player with good communication, logical and negotiation skills.Equality, diversity and inclusionAgile workingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Electric Power Production & Transmission", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}