{
    "Job ID": "69873159",
    "Description": "IntroductionYour Role and ResponsibilitiesSoftware Developer position for IBM SSW team. This professional will immerse in a innovative, dynamic and technical work environment, working side-by-side with experienced and bright professionals towards a common goalAct as a Software Development Engineer, responsible for understanding product functionalities, requirements, defects and enhancements to deliver these on new releases and patches, he /she will be involved in the software development cycle, requirements review, coding, test, test automation and client support. DevOps, SRE and Security are others areas that he or she will be engaged as part of daily work.Work on a daily basis with Product Owners, Architects, Release Managers and Engineering Manager, Other internal Teams, Sales, Business Partners in order to guide the product’s development.Proactively seek for improvements opportunities and innovation that matters by learning new technologies and methods that can positively impact the products.Required Technical and Professional Expertise2+ -5 years working as Software Developer.\nFunctional test creation;\nSoftware test phases and principles;\nWorked on various technologies like: Selenium Web Driver; Mobile testing / APPIUM;\nContinuous Delivery process. White box testing and Black box testing\nUnit Testing, Skill in Mobile test automation\nCypress, Skill in Performance, Load and Stress test\nJAVA, JavaScript, React, XML, JSON, SQL / NoSQL Database\nOracle, SQLServer and DB2\nOpen Shift, Kubernetes, Eclipse\nGithub, Jenkins, Docker\nShell Script, TravisPreferred Technical and Professional ExpertiseAgile development experience including using Github/Jira\nCommunication and teamwork collaboration\nIBM Maximo Technical skills\nMapping tools (ArcGIS, OpenLayers)\nApache Cordova, Cordova plugins\nArcGIS JavaScript API, ArcGIS REST API\nArcGIS replicas operations, Openlayers\nHTML5, CSS\nPython, Weblogic and Websphere\nMobile Application Development (IOS, Android and Windows)\nAbility to debug code, implement fixes and changes.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Ahmedabad, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}