{
    "Job ID": "69873409",
    "Description": "Assistant ServerFull timeFour Seasons Resort Dubai at Jumeirah BeachThe Four Seasons Resort Dubai at Jumeriah Beach with its unparalleled location, fresh approach to luxury and legendary personalized service, has exceeded the high expectations in the ultra- competitive Dubai market. At Four Seasons we believe that our most important asset is our team of employees. The Four Seasons has a tremendous commitment to the development and training of all employees. We ensure that the best packages and finest management structure are in place to guarantee a stable environment in which development is second nature for our employees. Successful Four Seasons candidates will be offered once- in-a- lifetime opportunity rich in personal and professional growth.Four Seasons Dubai at Jumeirah Beach includes five outlets options - from the beachfront Sea Fu restaurant to the rooftop Mercury Lounge, and it includes 237 Dubai luxury hotel rooms – including 49 suites – subtle Arabic design motifs blend with cool, contemporary style, featuring soft backgrounds of blue or green. Dubai is the second largest of the seven Emirates that make up the United Arab Emirates, Dubai is located on the southern shore of the Arabian Gulf. Has a Sub- tropical, arid climate.Join our TeamWork on a team that is built on mutual respect, collaboration, excellent service.\n\nFour Seasons provides employees with the same level of care that we expect to be shared with our guests.\n\nFour Seasons have been ranked in FORTUNE Magazine's 100 best companies to work for since 1998.ResponsibilitiesServer Assistant with the serving of food, set-up and clearing of china, glass, and silver from service as well as attend to guest needs and requests.\n\nProvide an expertly served dining experience conforming by clearing and resetting tables according to standards.Preferred Qualifications and SkillsExcellent communication and organizational skills.\n\nCan work efficiently and effectively in a fast paced demanding environment.\n\nPrevious experience in a similar role within 5* luxury hotel/brand standalone restaurant.What to Expect: You Will....Be part of a cohesive team with opportunities to build a successful career with global potential.\n\nHave the opportunity to engage in diverse and challenging work.\n\nBe recognized for excellence.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}