{"Job ID": "69874048", "Description": "BMS EngineerThe BMS Engineer will be responsible for the design, engineering, validation, programming, graphic screens for Building Management and Controls Systems (BMS) in accordance with the project specifications and time frame, engineering adopted codes and good engineering practices.HoneywellWith over 125 years of proven building solutions, Honeywell is building ecosystems that put the occupant at the center and fostering environments of efficiency, productivity, and collaboration. Honeywell customers have saved $6B in Energy & Operational Savings since 1979 and we have completed approximately 6,000 guaranteed efficiency projects for our customers.\nTransform the way buildings operate to be safer, more productive and more energy conscious. Key ResponsibilitiesStudy and Evaluate BMS and HVAC systems all technical drawings, documents, products, components, application and any revisions thereon.\nVerify and prepare all the required design of BMS control systems (i.e. Compliance Statement, BAS Material Submittal, Control Schematic diagrams, BAS system architecture, I/O points lists, BOQ, cable schedules, wiring and termination drawings, installation details... etc.). \nSelection of material and equipment according to the calculations and the project specifications. \nEnsure compliance with specification.\nPreparing project engineering submittals (Material Submittals, Method Statements, Shop drawings, Operation and Maintenance manuals, and other project documentation) as required in line with company and client requirements as well as standards and codes of practices.\nGenerate logic function block diagram and download to controller and do T&C.\nBuild-up BMS project database.\nProvide configuration for system alarming, trending, and reporting services.\nDevelop and implement high level integrations with different low current systems.\nDevelop and implement low level integrations with 3rd party equipment.\nMaintain knowledge transfer amongst peers upon collected experience/assigned trainings and contribute with technical support as needed.\nEnhance and develop standard process.Degree in an Engineering discipline; Electrical, Mechatronics or Mechanical.\n3-5 years of experience in Building Management System.\nRigid knowledge of Standard BMS integration and communication protocols Modbus/Mbus/KNX/OPC/Lon/BACnet etc.\nRigid experience in DDC programming and commissioning.\nFamiliar with different systems databases (SQL, Postgre. …etc.)\nRemarkable troubleshooting and problem-solving skills.\nAdvanced understanding of HVAC process, Building Automation, Energy Management, or LV systems.\nRigid experience of handling CAD drawings and ability to analyze technical details of system drawings and schematics, with advanced understanding of mechanical and electrical symbols.\nExperience and understanding of Honeywell products and software Care/Comfort Point/EBI/Niagara/ is a plus.\nExperience of PLC control processes and tools and SCADA systems is a plus.\nExperience of web-services and APIs is a plus.\nExperience of Fire alarm system is plus.\nExperience of MS Visio is a plus.Committed and acts with sense of ownership and rapidly responds to urgency.\nAbility to transfer knowledge and helps practical experience progression.\nDemonstrates teamwork aspects\nDemonstrates customer facing attitude and presentable communication skills.\nAdapts to changes in the work environment; manages competing demands; changes approach or method to best fit the situation; able to deal with frequent change, or unexpected events.\nMeets challenges with resourcefulness; develops innovative approaches and ideas.\nSets and achieves challenging goals; demonstrates persistence and overcomes obstacles; take calculate risks to accomplish goals.\nKeen to learn, able to self-study, self-motivated.\nAbility to enhance the process with sense of development and creativity.\nAbility to comprehend solution & present it.\nExcellent command of English language both written and spoken\nStrong interpersonal, written, and oral communication skills.\nRemarkable PC skills and knowledge of Microsoft software, databases.\nProject Management skills, and good understanding of the financial aspects of engineering.JOB ID: req415856\nCategory: Engineering\nLocation: Taha Hussein St, Cairo Festival City-fifth settlement,,Building A2, Southern, level2,New Cairo,CAIRO,171-11835,Egypt\nExemptJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}