{
    "Job ID": "69875659",
    "Description": "It’s an exciting time to be at Infoblox. Named a Top 25 Cyber Security Company by The Software Report and one of Inc. magazine’s Best Workplaces for 2020, Infoblox is the leader in cloud-first networking and security services. Our solutions empower organizations to take full advantage of the cloud to deliver network experiences that are inherently simple, scalable, and reliable for everyone. Infoblox customers are among the largest enterprises in the world and include 70% of the Fortune 500, and our success depends on bright, energetic, talented people who share a passion for building the next generation of networking technologies—and having fun along the way.We are looking for a HR Business Partner I to join our global People & Places team in Bangalore, reporting to the India HRBP site lead. In this role, you will be responsible for translating business objectives into effective and reasonable organizational solutions and outcomes. You will also assist in the alignment of the organization toward the business strategy plan, to ensure we have the right talent and that the level of resources within business groups are aligned appropriately to meet ever-changing business needs.You are the ideal candidate if you enjoy working closely with an organization’s senior leaders to develop an HR agenda that closely supports the overall aims of the organization. You are a skilled communicator who is passionate about creating differentiated employee experiences and making data-driven decisions.What you’ll do:Learn how to work in a global, matrixed environment and be actively engaged as a strategic HR Business Partner\nGuide and coach at all levels of management on how to appropriately manage and resolve complex employee relation issues\nAssess organizational capabilities, identify competency and talent gaps, and ensure development of talent\nProvide proactive and tactical consultation with both employees and managers to systematically identify, address, and resolve root causes of human resource issues\nParticipate in company-wide programs and initiatives such as performance reviews, merit, workforce planning, and organizational changes for assigned clients\nHandle more complex administrative activities related to HR programs and projects, ensuring that these tasks are completed on time and are accurate\nAnalyze data pulled from multiple systems for trending, internal equity analysis, administrative organizational breakouts by functional groups, and data gathering for information\nManage and handle additional HR related tasks and projects on an ad-hoc basis\nPartner and build relationships with other HR professionals to facilitate organizational development initiatives, programs, and processes to support business objectives and strategy implementation\nCollaborate with the People and Places team to identify trends affecting the business and develop plans to address them, including assisting with local facilities for support and coordination of employee eventsWhat you’ll bring:Minimum 3 years of HR Business Partner experience\nDemonstrated ability to successfully partner with business group leaders to develop and implement human resources strategies\nProven track record in managing employee relations issues\nExcellent consulting skills, including the ability to develop alternatives to meet business priorities\nA history of partnering well with senior leadership teams and partners to develop a culture of innovation, excellence, and openness\nCritical thinking and data analysis skills with success in working cross-functionally to implement solutions to business issues\nViewed as credible with a demonstrated ability to inspire trust throughout the organization\nExceptional communication and problem solving skills\nA “roll-up your sleeves” attitude to get the tactical tasks done\nImpeccable integrity, including sound judgment and professionalism, and a forthright approach and willingness to give and receive open and candid feedback to improve leadership and ensure business success\nExcellent technology skills, Microsoft and Google Apps, Workday, or Oracle HCM knowledge a plus\nAbility to build credible relationships with all stakeholders\nAbility to operate in a positive, helpful, and proactive manner\nBachelor’s and/or master’s degree in business administration or human resources highly preferred\nSPHR or PHR certification highly desiredWhat success looks like:In the first six months, you will…Develop excellent business relationships with key stakeholders in Bangalore\nBe a part of the planning committee to Return to Office once safe\nParticipate in the performance review cycle process and employee engagement initiativesAfter about a year, you will…Develop key relationships with Bangalore employees and local HR teams\nAdvise and support employees on issues and help them perform well in the organization\nPlan strategic HR initiatives and support employee development activities across the Bangalore site\nParticipate in multiple projects within People & PlacesWe’ve got you covered:Our holistic benefits package includes coverage of your health, wealth, and wellness—as well as a great work environment, employee programs, and company culture. We offer a competitive salary and benefits package, including industry-best insurance benefits and generous paid time off to help you balance your life. We have a strong culture and live our values every day—we believe in transparency, curiosity, respect, and above all, having fun while delighting our customers.Speaking of a great work environment, here are just a few of the perks you may enjoy, depending on your location…Delicious and healthy snacks and beverages\nElectric vehicle charging stations\nAmenities include onsite gym, table tennis, pool table, and courtyard\nNewly remodeled offices with state-of-the-art amenitiesWhy Infoblox?We’ve created a culture that embraces diversity, equity, and inclusion and rewards innovation, curiosity, and creativity. We achieve remarkable results by working together in a supportive environment that focuses on continuous learning and embraces change. So, whether you’re a software engineer, marketing manager, customer care pro, or product specialist, you belong here, where you will have the opportunity to grow and develop your career. Check out what it’s like to be a Bloxer. We think you’ll be excited to join our team.\n\n#L1-SK2Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}