{
    "Job ID": "69873031",
    "Description": "Job Description:Job Title- Engineer (AVP)Location- PuneRole DescriptionOur goal is to build & offer simple self-service shared platforms for clients to consume and in turn run their own business applications on. We’ll use a combination of open source and vendor technologies coupled with Cloud native services where appropriate and use automation for efficiency and accuracy.This role for Platform as a Service (PaaS) sits within Application Platforms.  The Application Platforms mission is to build the commercial, technical, architectural and operational frameworks that will allow DB to operate successfully and securely. PaaS is the strategic application hosting platform of the bank and hosts more than 50% of bank’s workloads. Responsible for the delivery of on-premises and public-cloud based Platform as a Service using third party vendor solutions that leverage Docker and Kubernetes. It will provide on-demand access to technology services needed to build, host and manage bank applications using a variety of infrastructure solutions. Strong knowledge of Linux, Containers, Ansible, OpenShift and Splunk technologies is required to fill this role.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesResponsible for building shared solutions in collaboration with architects, product managers and other key stakeholders.\nResponsible for build, configure, and manage software on Cloud and/or on-prem for IaaS and PaaS solutions.\nProduction support of PaaS infrastructure which includes incident, change, problem management with a focus on maintaining the platform secure and stable.\nGood knowledge on network configuration and Firewall configuration.\nCollaborate with engineering, Customer success teams to host containerised workloads using above technologies in the standardized, governed and bank-approved manner.\nWork closely with various vendors and internal teams, to ensure compliance with technology roadmap and security requirements on application, infrastructure, and operating system level.\nEnhanced operational activities with trouble shooting and resolving issues requiring system functional knowledge and advanced knowledge of the underlying technologies being supported.\nAutomate manual interactions with our systems. Define and implement self-healing and self-management for the platforms.\nMaintain and improve our observability tools such as Prometheus, Grafana and Splunk\nEnsure continuity of service through capacity planning.Your skills and experienceStrong experience and commitment to deliver in Agile process highlighting change while accelerating delivery.\nMinimum 8+ (for AVP), 5+ (for Associate), 3+ (for Analyst) years of overall hands-on experience in scripting, programming and log analytics tools such as Splunk\nExcellent communication and problem-solving skills with team culture.Specific Technology SkillsStrong working experience of Linux, Containers, Ansible like configuration/automation tools, OpenShift and Splunk technologies\nExperience with monitoring stack like Grafana and Prometheus will be handy in daily activities.\nExposure to middleware technologies like Splunk, WebLogic, JBoss, Tomcat is required.\nExperience of operating/programming for Openshift or Kubernetes\nGood understanding and basic programming skills in Python, Ansible and Go is preferred.\nWork experience in operations, infrastructure models with strong troubleshooting skills including basic networking knowledge.\nStrong knowledge and experience with ITIL process is required to perform BAU activities.\nAny experience with Google Cloud Platform is an added advantage.\nGood communication skills are required to collaborate with engineering and applications teams at various stages.How we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}