{
    "Job ID": "69873138",
    "Description": "Experienced Scrum MasterCompany:Job ID:Date Posted:Location:Job Description Qualifications:OverviewBoeing is the world’s largest aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.In India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.Technology for today and tomorrowThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, ModelBased Engineering, and Additive Manufacturing, shaping the future of aerospace.People-driven cultureAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected.  No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.At Boeing, we are inclusive, diverse, and transformative.   With us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.Boeing ecommerce team is currently looking to hire Experienced Scrum Master for Boeing India Engineering (BIE) Software to join their team in Bengaluru, India. This position will focus on supporting the Boeing Global Services (BGS) IT organization. The selected individual will work in the Boeing India Engineering and Technology Center (BIETC) in Bangalore, India. As an Experienced Scrum Master, the selected individual will work with the Boeing India teams and its partners and stakeholders to develop, maintain and improve the ecommerce applications.Position Responsibilities:Exhibits Lean-Agile Leadership - Helps the team embrace SAFe Core Values, adopt and apply SAFe Principles and implement SAFe practices.\nFacilitates preparation and readiness of ART Events - Work with the team/other Scrum to effectively plan the Program Increments\nCapacity Planning: Check availability of resources in one’s own team/dependent resources from any other team\nUnderstand the priority of the requirements from business and work with /guide the team to estimate in story points and commit based on the known average velocity/capacity of the team\nWork with the Product Owner/Business team in effective Pre-PI Planning\nPrepare Internal Team Milestones with dates and ensures they are in line with the PI Milestone dates. Reviews with RTM and publishes to team/business.\nRisks/Issues are documented, addressed and escalated as appropriate.\nOrganize and facilitate Scrum Ceremonies during every PI\nFacilitates the team’s progress toward team goals - Plan and track the team's progress regularly to ensure PI commitments are met. Report any risks and issues on delivery commitments as early as possible to the RTM. The Scrum Master ensures that the team is fully functional and productive. Works towards improving the productivity of the development team in any way possible.\nHelps coordinate inter-team cooperation and helps team operate well on the Agile Release Train - Collaborates actively with other Scrum masters\nDiscussing any dependencies\nShare team updates\nAdopting and sharing any best practices\nCommunicate any change requests, its analysis and the solution proposal from the team to the RTM.\nProvide all needed support to the Scrum Team using a servant leadership style and leading by\nGuide & coach the Scrum Team on how to use Agile practices and values. Goal: Happy Self Organization- Issues should be removed by the team wherever possible. Makes the development team aware of the Scrum values.\nSupports the team rules - Guide and coach the Scrum Team regularly on applying the Agile mindset/best practices/rules to their work processes. Drives Agile behavior in teams & ensures that the team is fully functional, productive and valuable. The Scrum Master is responsible for reinforcing them.\nFacilitate discussion and decision-making on identifying gaps and how to fill them appropriately.\nFosters team collaboration and helps in resolving conflicts\nSupports the PO- Support/Discuss with the Product Owners, especially with the objective to refine and manage the respective product backlog.\nLeads team efforts in relentless improvement- Identify and propose areas for improvement and issues affecting effectiveness that the Teams themselves might not be aware of.\nEliminates Impediments - Remove impediments for the development team by finding the right personnel to remove the impediment.Employer will not sponsor applicants for employment visa status.AttributesThrives on Responsibility - to maximize the throughput of the team, assumes no authority, Showcases Leadership and guidance to team\nHumble – Willing to do whatever is necessary to help the team achieve its goal, leads by example to recognize the value in all team members\nCollaborative – Ensures a collaborative culture exists within the team, if not, create such an environment for team to have open and honest conversations.\nCommitted – To following Scrum ceremonies, cadence, addressing impediments, supporting team in meeting the commitments\nInfluential – Should know to exert influence without resorting to being dictatorial; Active participation in spreading Agile mindset within the business unit / organization through coaching, trainings, leading CoEs/CoPs across the company\nKnowledgeable – Have technical known-how (enough to effectively lead the team), product and market understanding or other specialized knowledge to help the team pursue its goal.\nManages external interfaces as needed\nPeople issues – Engineering Manager\nProject Issues – RTM\nTechnical Issues if not possible to be resolved internally – ArchitectCommunicationEncourage/coach team members to communicate in a simple and positive manner.\nCommunicate regularly with the Engineering manager regarding issues identified within the team, steps taken to correct, any help needed.Basic Qualifications (Required Skills/Experience): (9 -12 years)Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 9+ years' related work experience or an equivalent combination of education and experience (e.g. Master 8 years' related work experience.\nMinimum 9 years’ experience in software development, of which at least 4-5 years successfully performing Scrum Master Role.\nDemonstrated capabilities in full scale web app Build, integration and Debugging in Simulated and integration Environment\nProven Experience in Software development using following tech stack :Angular, HTML, JavaScript, CSS, Foundation or Bootstrap (ReactJS, AngularJS, NodeJS, Bootstrap, HTML5, CSS3, Javascript, JQuery, Java8/J2EE Docker, Kubernetes, Cloud-based managed services)\nGood Exposure to Cloud (AWS/Azure/PCF)\nStrong Knowledge of agile methodology and frameworks like Scrum, Kanban, XP, etc.\nGood Fundamentals on Agile Methodology is mandatory.\nExposure to Tools like JIRA, JAMA, and Confluence is preferred.\nMentorship skills to coach team how to follow agile scrum, which really works.\nUnderstand the basic fundamentals of iterative and incremental development.\nGood Knowledge about tasks, backlog tracking, burn down metrics, velocity, and user stories\nKnowledge of other Agile approaches, like: Kanban, Crystal, FDD, XP, etc.\nKnowledge about other methodologies other than Agile-Scrum, so that he can explain other methodologies to motivate his team.\nBasic knowledge of software development processes and procedures to understand your team needs.\nGood Knowledge about Agile techniques like: User Stories, Continuous Integration, TDD, Continuous Testing, Pairing, Automated Testing, Agile Games.\nAbility to take and understand your commitment to deliver the product on time.\nKnow about the value of metrics and incremental delivery.\nPractical knowledge of software requirements development.\nUnderstanding and demonstration of:\nActor Diagrams\nClass Diagrams\nActivity Flow Diagrams\nBusiness Service Diagrams\nSequence\nUse Case ModelingDemonstrated ability to use office automation to include:Identifies critical issues with ease.\nExhibits confidence and an extensive knowledge of emerging industry practices when solving business problems.\nMust have experience working with cross-functional teams spread across multiple products and locations within Boeing and external partners, across different cultures and time-zones.\nPushes creative thinking beyond the boundaries of existing industry practices and client mindset\nAnalytical mind with a problem-solving aptitude\nPossesses understanding in the areas of software development.\nExperience of Agile methodology in a software environment\nPossesses understanding in the areas of software development, database and system design.\nUnderstands Internet and client/server architectures in a web-based application.\nGood understanding and experience of Distributed systems design considerations\nGood understanding and experience with Micro services based architecture\nGood understanding on container technologies Docker, Kubernetes.\nGood understanding of public cloud AWS and Azure.\nExperience of Agile methodology in a software environment.\nProject scheduling and Financial modelling.\nPlanning, Scheduling, Budgeting, Execution.\nGood hands on experience on tools like MPP, spreadsheet templates for project management, power point presentation etc.\nProblem Solving\nMicrosoft Office software\nSoftware application experience:\nAssists in the facilitation of team and client meetings.\nDelivers informative, well-organized presentations.\nUnderstands how to communicate difficult/sensitive information tactfully.\nExcellent verbal and written English, including grammar.\nTechnical UnderstandingDesired Skills (Preferred Skills):Certified SCRUM MASTER\nKnowledge on Standards for Processing Aeronautical Data (DO-200) or DO178Typical Education & Experience:  Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 9+ years' related work experience or an equivalent combination of education and experience (e.g. Master 8+ years' related work experience.Relocation:This position offers relocation based on candidate eligibility.At the highest level, diversity and inclusion are part of Boeing's values.  Having diverse employees, business partners and community relationships is vital to creating advanced aerospace and defense products and services for our diverse customers around the world. The company's commitment to diversity means providing a work environment for all employees that is welcoming, respectful and engaging, with opportunities for personal and professional development.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Export Control Requirement:Safety Sensitive:Contingent Upon Award ProgramExperience Level:Job Type:Job Code:Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}