{"Job ID": "69875365", "Description": "Some careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team as an Associate Project Manager.In this role, you will:Manage programme strategy and the programme approach across a series of projects or component activities, building stakeholder buy-in around plans, commitments and changes. Assist business stakeholders with the decomposition of complex business requirements into Epics and User Stories that can be delivered by Technology teams via respective backlogs with minimum cross product co-ordination\nDelivery, governance & reporting to stakeholders including the Product owner in the business, leadership of a service line or Product within Technology.Facilitate Agile rituals, identifying and driving opportunities for service improvement\nDrive continued adoption of DevOps and Agile across delivery Pods.Track and report progress to the central HRIT Practices Workstream. Work with the domain lead to maintain superior control of finances for the workstream. Work across business and technology to establish effective controls, procedures and quality assurance processes for the product in line with the Business Transformation Framework and HSBC Risk and Controls framework\nEnsure reporting of progress, issues, dependencies and risks are raised to appropriate audience across the Reporting and Analytics domain. Assists with recommendations in order to influence decisions to agreed resolution.\nEstablish and maintain relationships with business & IT stakeholders and their delegates to evolve business requirements into workable solutions, establishing and validating acceptance criteria against deliverable solutions and identifying opportunities for reuse\nCollaborate with Product Owners and the Analyst and developer community to ensure the continuous delivery of change across the HR IT estate and beyond.Support the Product Owner in the evolution of the Product roadmap, creation of epics, writing of user stories and management of the product backlog. Ensure measurable improvement into delivery environments across all disciplines. Create analysis of customer journeys and product functionality. Encourage and provide coaching in the adoption of Agile practices across the HRIT analyst community\nHelp to define and track metrics and Performance Indicators for the product.Establish and maintain highly collaborative, communicative relationships with both internal (onshore/offshore) and external to the Bank as a representative of the analytics domain\nGuide the Agile Team performance and outcome metrics as required. Deliver fair outcomes for our customers and ensure own conduct maintains the orderly and transparent operation of financial markets.Understand risk exposure to the bank and help senior colleagues manage itJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}