{
    "Job ID": "69873301",
    "Description": "Job Number 23167905 Job Category Housekeeping & Laundry Location W Dubai - The Palm, West Crescent, Dubai, United Arab Emirates, United Arab Emirates VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management POSITION SUMMARY Our jobs aren’t just about giving guests a clean room and a freshly made bed. Instead, we want to build an experience that is memorable and unique. Our Guest Environment Experts are skilled in a wide range of housekeeping functions with responsibility for maintaining the appearance and cleanliness of the whole hotel. They are empowered to move about their space and do what needs to be done. Whether delivering guest requests, stocking carts, cleaning rooms and public spaces, or other similar responsibilities, the Guest Environment Expert makes sure the spaces in the hotel help create a great guest experience. No matter what position you are in, there are a few things that are critical to success – ensuring a safe work place, following company policies and procedures, maintaining confidentiality, upholding quality standards, and ensuring your uniform, personal appearance, and communications are professional. Guest Environment Experts will be on their feet and moving around (stand, sit, or walk for an extended time) and taking a hands-on approach to work (move, lift, carry, push, pull, and place objects weighing less than or equal to 50 pounds without assistance). Doing all these things well (and other reasonable job duties as requested) is critical for Guest Environment Experts – to get it right for our guests and our business each and every time. Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. W Hotels’ mission is to Ignite Curiosity, Expand Worlds. We are a place to experience life. We’re here to open doors and open minds. We are constantly inspired by new faces and new experiences. A tuned-in, up-for-anything spirit is at our core and has made us renowned for reinventing the norms of luxury around the globe. Whatever/Whenever is our culture and service philosophy that brings our guests’ passions to life. If you are original, innovative, and always looking towards the future of what’s possible, welcome to W Hotels. In joining W Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}