{"Job ID": "69875828", "Description": "Job RoleWe are seeking a skilled Senior SAP MM Consultant to join our IT department, that mainly contributes and consults with his team at different phases of internal company projects including discovery, solution generation, design/architecture and the detailing of the overall process. The role involves recommendation, configuration, evaluation and deployment of high-quality solutions that enable our internal clients to meet the changing needs of the automotive business landscape.Job ResponsibilitiesDiagnose reported issues and try to resolve them using available information resources and researches.\nEscalate unresolved issues or those requiring urgent attention to concerned consultant or Senior consultant.\nLearn and understand the Business & IT environments including; understanding business processes, automotive and Al-Mansour businesses, SAP, assigned modules and the implementation of assigned SAP module/s.\nParticipate in the development and update of user manuals.\nParticipate in the on-the-job training and preparation and update of training materials to end users.\nPrepare activity reports.\nRespond to requests for support/assistance in person, via phone or electronically.\nStay current with system information, changes and updates.\nTrack requests and document resolutions.EducationRequired Qualifications & SkillsMinimum Qualifications:\nITI Diploma in Software Engineering, ERP Track, SAP MM is a must, other SAP Modules are an advantage.Minimum Experience:4 to 6 years of experience in implementing SAP MM module.\nExposure to the automotive industry is a significant advantage.\nExposure to SAP IS-Automotive is a plus.Job specific Skills:\nGood interpersonal, communication and presentation.Customer orientation (show a service attitude).\nProblem analysis & solving.\nSelf-initiation and -motivation.\nReliable and quality oriented.\nFast learner.\nTeam player, \nGood knowledge of business English in word and writing.\nFlexible and is able to work extended hours or out of regular working hours when needed.\n #LI-PL1Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Egypt", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}