{"Job ID": "69872614", "Description": "Job Requisition ID #Position OverviewThe Renewals Specialist for Territory is responsible for driving, forecasting, and closing renewals opportunities within the Territory region. This role primarily works to drive renewals closure in-directly through close partner engagement and day to day monitoring and management. This role will also engage customers directly to drive the renewals opportunity to closure when needed.ResponsibilitiesAchieve assigned sales quotas\n\nOpportunity Pipelines and Forecast Management for Territory accounts\n\nMay drive partner forecasting for territory business in some regions\n\nProvide deal-specific primary and secondary sales support, i.e., deal creation, development, presentation, negotiation and closure\n\nServes as an escalation point for all renewal issues that impact the customer's retention, and it is responsible to drive risk mitigation execution\n\nIdentifies customer upsell and expansion opportunities\n\nSales results reporting and analysis by customer segment, region, sales channel, and product\n\nCoordinate and execute collaborative channel partner, Territory sales and customer sales meetings to increase renewals performanceMinimum QualificationsComplexity: works to resolve complex issues and can exercise sound\n\njudgement in solution\n\nNegotiation: Undertake complex negotiations with customer and\n\npartners\n\nInfluencing: Able to influence partners in driving the right renewals outcome\n\nPreferred Experience and Skills\n\n4+ years sales/renewals experience\n\nProven ability to negotiate $10k+ complex sales/renewals deals\n\nWorking knowledge of SFDC#LI-SV2Learn MoreAbout Autodesk\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.We take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.When you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!Salary transparencySalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.Diversity & Belonging\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belongingAre you an existing contractor or consultant with Autodesk?Please search for open jobs and apply internally (not on this external site).Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}