{"Job ID": "69872684", "Description": "Position:Location:Qualification: Engineering degree in Electrical engineering,\nExperience: minimum 15 years’ experience as Electrical engineer in Oil and Gas offshore activities.\nAt least 3 years of experiences as Lead Electrical Engineer supervising a team.\n Extensive experience in Electrical engineering with relevant experience within the offshore oil and gas production industry,\nComputer literate, especially in Electrical calculation software and AVEVA Electrical Product.\nStrong leadership skills and good communication skills.\nGood analytical skills.\nFamiliar with Total general specifications is a plus, and with relevant codes and standards,\nLanguage: fluent English,\nAbility to work on projects in a complex and multicultural environment.\nEnsure Engineering Dossier are delivered with a robust electrical engineering definition and fit for purpose design that can be procured, fabricated, transported, installed, and operated safely, meeting the requirements of NOC standard, project basis of design, and SOR.\nEnsure assigned project tasks within electrical discipline are well managed in accordance with the project execution plan and contractual requirements that includes:\nThorough, efficient, and timely review of project Electrical discipline documents, realization of potential derogations to the standards, and challenge the design to achieve an optimize and fit for purpose outcome.\nAssisting to project studies and meetings related to the Electrical discipline as per project approved gate levels and design maturity.\nIdentifying potential risks and scope changes within the Electrical discipline, conducting impact assessment to provide detailed information to Package Engineering Manager for decision making.\nHigh performance, competency, and availability of the resources within the Electrical team in close coordination with Package Engineering Coordinator/Lead.shruti.kadam@nesfircroft.comJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Doha, Qatar", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}