{
    "Job ID": "69873125",
    "Description": "Job Description:Job Title – Rates Business Management & ControlLocation - Mumbai  Role DescriptionThe Business Management Specialist is responsible for ensuring the execution of activities from the wide range of Business Management tasks, either directly responsible for task execution or indirectly responsible via the efforts of other team members.  The Business Manager Specialist’s responsibilities may include all or some of the following, financial planning and business forecasting, reporting output quality and performance metrics, ensuring satisfactory infrastructure and control function service level delivery and supplier sourcing and pricing negotiations. In addition, the Business Management Specialist may be responsible for analyzing the impact of changes and evaluating the corresponding changes to cost and the impact to the forecast. The Business Management Specialist is responsible for defining, implementing and continuously improving policies, processes and procedures that deliver consistent and reliable products and services. The Business Management Specialist may oversee the work of Lead Business Management Analysts and/ or Business Management Analysts.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilitiesSupporting business performance deep dives and year end planning\nExtensive support on expense analysis and cost reduction initiatives.\nSupporting New business initiatives via NPA, NTAs\nSupport the business in audit and regulatory requests/reviews.\nPro-actively tracking and resolution of control gaps identified via Audit findings, SII’s etc.\nSupporting the team in effectively running governance forums (NFR, Product Forum, Volker Review meetings).\nOnboarding of Dealer-to-Dealer counterparties on venues for risk sweeps\nAssist the desk with Control projects around monitoring of Cancels, Corrects & Amends (CCA) cases, ensuring timely PnL signoffs, Trader Mandate breaches, advisory role on Accountable Client Owner (ACO)/ Know Your Client (KYC), Vendor Risk Management, etc.\nBuilding and maintaining strong partnerships with stakeholders across Front Office and Infrastructure domains.Your skills and experienceUnderstanding of the Rates asset class.\nControl mindset with ability to network and engage with first- & second-line partners to identify control gaps implement solutions.\nStrong interpersonal and excellent verbal and written communication skills\nProactive attitude and strong analytics skills.\nHighly motivated & organized individual who is able to work to tight deadlines and minimum supervision.How we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}