{"Job ID": "69875347", "Description": "Some careers have more impact than others.If you’re looking for a career where you can make a real impression, join HSBC and discover how valued you’ll be.HSBC is one of the largest banking and financial services organisations in the world, with operations in 62 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role ofGlobal Head of Controls, Chief Technology OfficeThe Chief Control Office (CCO) plays an important role in enabling the bank to operate within its risk appetite, by ensuring efficient and effective risk and control management. CCO achieves this by providing operational risk and control expertise, conducting high quality reviews of the bank's control environment, conducting end to end control assurance reviews on key controls, maintaining robust risk governance focused on material risk and issues, and evolving a culture of continuous and consistent risk management. Principal responsibilitiesThe role holder will partner with the HSBC Chief Technology Office (CTO) to ensure delivery of risk based, strategic outcomes globally, including informing and advising on relevant risk and control based issues, initiatives and updates that impact the Group.\nYou will be a leader within the Global Chief Control Office (GCCO) Function that directly supports the\nGlobal Head Technology Chief Control Office within HSBC. The purpose of the CCO function is to enable colleagues within HSBC DBS to deliver safe and secure services to all our customers, colleagues and the Bank itself. This will be achieved by:oEnforcing robust risk governance and ensuring all stakeholders have visibility of key risks and anyoremediation activity.oPartner and advise on setting, communicating and monitoring risk appetite in line with businessorequirements, including appropriate support and challenge.oConducting high quality and efficient reviews of our control performance.oFacilitating controls remediation where required.oRaising awareness and understanding of risks, controls and risk management.oContinuously improving the control and monitoring of risk, including behaviours.oEmbedding the Bank’s Risk Management FrameworkThe role holder will be responsible for global CCO activity supporting Chief Technology Office (CTO)\nThe role will have global responsibility and ensure that partnership support is provided to entities as appropriate.\nThe role holder will be responsible for delivering robust risk management practices and control governance across DBS to ensure Chief Technology Office (CTO) risk management is transparent and clear to all Global Business and Functions (GB/GF), regions and entities\nThe role holder will be expected to demonstrate the ability to lead the CCO Chief Technology Office (CTO) team to a value based, and outcome focussed way of working, including driving cultural change across to driver strong integrated risk management across Chief Technology Office (CTO) and the business.\nSupport CCO operating model, service catalogue, procedures, and toolkit\nAct as a key contact point between 1LOD and 2LOD/3LOD partners – drive risk and audit reviews and subsequent actions through to resolution by partnering with 1LOD/CIO teams\nLeading the Team of trusted advisers for senior management within remit area on how to accurately manage their operational risk i.e. risk assessments, control environment, issues management\nDevelop and manage stakeholder relationships with CCO Tech and CTO, Architecture, Data\nConstructive challenge on control environment and assessment of risk\nManage executive updates to IT ExCo and DBS CCO ExCo\nSupport consistent and insightful reporting and escalation of identified issues\nDrive consistency of reporting and Risk & Control management across the HSBC Group\nOversight of emerging risks, strategic business initiatives and local change activity and new/materially\nPromote accountable risk and control decision-making based on quality data and commercial analysis, actively challenging poor, inefficient or excessive controls, related tasks and behaviours\nProvide specialist risk and control knowledge and insights, leading efforts to continuously improve the control environment and monitoring of risk, including behaviours\nIdentify trends to anticipate future developments in the risk and control environment\nInfluence and shape the development and implementation of future-fit risk management and regulatory frameworks\nProvide Senior Management with updates on any relevant changes to policy or projects related to operational risk that have an impact on their area of responsibility.\nLeading ad hoc programmes supporting Vision 27 and key CCO and wider DBS initiatives\nPlans effectively around delivery constraints and optimizes the plan to maximize benefits and minimize risk. Develops the plan within constraints, considering the delivery approach, key milestones and dependencies within the plan, requirements and scope, effort and resources, budgets and quality\nDrive consistent communication clarifying impact of change on risk and control environment for HSBC\nEnsuring lessons learnt in one line of business/impacting incident are properly understood for all of Technology with associated actions implemented in a timely manner\nApply programmatic approach to resolving key Control issues across Technology\nEffectively manage stakeholder relationships across CCO, 2Lod, 3Lod, Tech and CCO communities\nEmbed risk culture and change delivery capability across the CCO Tech function\nDrive continuous improvement of processes, policies and tooling across CCO Tech\nActive and engaged member of the CCO Tech leadership team\nLead by example, demonstrate core behaviour and values including professionalism, teamwork, focus, drive and determination Leadership & Teamwork·Manage CCO Chief Technology Office (CTO) headcount·Effectively manage stakeholder relationships across CTO, Architecture, Data, CCO, 2Lod, 3Lod, Tech and CCO communities·Define core delivery targets for the Team and ensure team delivery on commitments made·Contribute to the overall CCO Tech Strategy to drive increased value to the Technology Businesses·Role model for inclusive behaviors and actively manage poor performers or behaviors·Track records of developing diverse talent and multi skilled teams that works together to deliver results·Coaching team membersJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}