{
    "Job ID": "69874789",
    "Description": "Join our successful and dynamic team of coating experts by delivering premier services to our customers and ensure Hempel is positioned as a trusted partner!Hempel services has an ambitious growth strategy. This is your opportunity to join a global company, responsible for leading and developing a team of highly skilled coating advisors and partnering up with commercial teams to develop the service business.As services experts, we bring value to our customers by offering technical coatings/corrosion protection solution, advice, management, technology and training of the entire coating process to accompany our outstanding products and encourage confidence from the end user.This is a new key position where you will report directly to our Service Operations Director, EMEA. You will be based at our offices in Turkey - Tuzla Istanbul, and be regionally responsible for our technical services in Turkey, Greece, Romania and Bulgaria. You will have the outstanding opportunity to collaborate with our customers as well as many internal stakeholders like commercial, marketing, R&D and other teams to understand our customers’ needs and ensure we deliver the right solutions with the right quality to our customers.Main responsibilities:Management responsibilities of a diverse team\nTechnically lead, direct and evaluate a team of coating advisors to ensure the service is completed on-time and according to technical service data sheets, standard operating procedures and customer requirements.\nBuild up the proficiencies of the team according to service and company strategy\nEnsure the team is following all the guidelines, tools and processes\nDevelop a technically and commercially competent service team in the country\nSupport sales of services strategy in the area\nPartner up with sales bringing value to the customers according to our service strategy\nAcquisition, maintenance, calibration and managing of inspection instruments\nSupporting on projects when neededWhat does it take to become our new team member?We are looking for your high collaborative skills, innovative and modern way of working, eagerness to bring some cross-border partnership and your leadership-by-example style that inspires your team to perform with excellence.As our ideal candidate you are customer centric, technical savvy and enjoy working across a wide variety of European and Global cultures, with cross-functional internal teams, customers, and collaborators of the industry.Additionally, you should also have:Proven experience as a manager in sales/ service sales /business development/ technical manager with validated results - preferably in the Oil & Gas, Wind, Infrastructure and Marine segments\nExperience leading and building up a diverse team\nGood leadership, presentation, and communication skills; able to gain followership\nFROSIO III or similar is appreciated nut not mandatory\nDecision-making, problem-solving and conflict resolutions capabilities\nProficient at Microsoft Office platforms and applications including Word, Excel, Power Point\nOutstanding ability to communicate in a clear and consistent way English and Turkish both written and verbally.Be a part of a trusted teamOne of the joys of joining our team within Services is the chance to earn the trust of our customers and colleagues, and to work together to deliver the best quality to our customers.Global career possibilitiesIn Hempel we offer a variety of global career possibilities and many cross functional and cross-cultural working relationships. We strive to create the right conditions for personal and professional development.Attractive salary and excellent compensation and benefits package are also part of the advantages of being part of our team.Join a global company where the employees are truly passionate about delivering the best in everything they do. With business in mind and people at heart we always work together to influence our road ahead. We want you to be part of our growth journey and of a great, global family.Application and further informationTo apply for this position, please submit your application letter with a CV in English via our recruitment system by clicking the link ‘Apply for position’ at the top-right corner.Application dueSeniority LevelJob FunctionsIndustryChemicalsAcross the globe, Hempel’s coatings solutions protect surfaces, structures and equipment. They extend asset lifetimes, reduce maintenance costs and make homes and workplaces safer and more colourful. Hempel was founded in Copenhagen, Denmark in 1915 by J.C. Hempel, and is solely owned by the Hempel Foundation, which not only ensures a solid economic base for the company, but is dedicated to making a difference in the world by empowering children to learn, supporting coatings science and sustaining biodiversity.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Türkiye",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}