{
    "Job ID": "69873281",
    "Description": "Basic Function:Supervisory Position in Food & Beverage ProductionRole and ResponsibilitiesTo ability be punctual on shift with clean uniform grooming 5 minutes before every shift started and it was part was follow Department P&P.\nThe ability to follow instructions by Senior chef and be open on accepting coaching and changes.\nThe ability to assist senior chef on daily operation needs and work closely with others colleagues.\nAssisting junior colleagues on daily receiving pick up, vegetables cleaning, dry store pick up, butcher pick up and proper storage in kitchen.\nThe ability to follow kitchen P&P and SOP while doing cutting, cooking and follow food presentation that been set by Outlet Chefs in order to maintain high quality and consistency of product.\nThe ability to plan and organize daily operations in proper way, in order for junior staff to assist and follow.\nFollow up on daily Misen plus preparation, Vegetables cutting, meat/seafood cutting and marinate before storage.\nThe ability to avoid wastages by utilizer all ingredients in all food preparation with minimum wastage.\nThe ability to perform task for daily operations, willing to work longer hours if required.\nThe ability to be flexible on working hours and assisting others outlets during peak seasons and when it required.\nThe ability to follow Four Seasons hygiene SOP in order to avoid food contaminations and food poisoning.\nThe ability to assist outlet chef on cooking by follow proper standard recipe.\nThe ability to maintain a cooperative working relationship with fellow employees.\nThe ability to respond properly to any hotel emergency or safety situation.\nThe ability to perform other tasks or projects as assigned by hotel management and staff.\nThe ability to take initiative and responsible when tasks been assigned.\nThe ability to act in a professional manner at all times to reflect the high standards of Four Seasons Hotels and encourage Staff to do the same.\nThe ability to perform task for daily operations, willing to work longer hours if required.\nThe ability to conduct oneself in a professional manner at all times to reflect the high standards of Four Seasons Hotels and encourage Staff to do the same.\nThe ability to handle and reporting incident paste on urgency of the incident, no matter how minor.\nFollow up on daily market list ordering, receiving, rejecting (bad quality products) by reporting to Outlet’s section Head Chef.\nFollow up on daily mis-en-plus preparation, double check all ingredients and make sure all products available and in fresh conditions before business hours.\nAbility to manage and control fast selling and slow moving items, without over produce and cause wastage.\nThe ability to take charge and act in professional way on solving kitchen problems when Chef not around.Requirements: Reading, writing and oral proficiency in the English language.\nHigh school graduate and an apprenticeship, cooking school or culinary institute education.\nGood level of creativity and good organizational skills.\nAble to show great leader ship skills by showing lead by example to the junior staffs.\nAble to work under high pressure without losing control.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}