{"Job ID": "69873611", "Description": "<p><b>Job Title:</b> Technical Manager</p><p></p><p><b><span>What can you expect?</span></b></p><p></p><ul><li>An opportunity to understand end to end lifecycle of Re-insurance Broking</li><li>A place to enhance your knowledge and leadership skills</li><li>Immense opportunity to lead Change Management initiatives as teams are undergoing system/process migration</li><li>Within the first 30 days, we expect you to gain in-depth knowledge of the service you would handle & understand the role requirements. Within 60 days, attain competency & have a good understanding of process and systems & finally within 90 days be able to technically lead the team and be a single point of contact for all technical escalations, process improvements.</li><li>Lead discussions and build relationships with Clients / Re-insurers / Business units as well as Placing brokers</li></ul><p></p><p></p><p><b><span>What is in it for you?</span></b></p><p></p><ul><li>Solid platform to demonstrate your technical skills</li><li>Build strong technical connects across our organization</li><li>Enhance your skills via various development programmes offered in-house</li><li>All benefits as per the location HR policy will be applicable</li></ul><p></p><p></p><p><b><span>We will count on you for:</span></b></p><p></p><ul><li>Lead/Participate in knowledge sharing forums across onshore / offshore locations</li><li>Collaborate with peers on complex or contentious reinsurance developments. Support and provide training, mentoring and guidance within the team and/or department for all aspects of reinsurance service processing.</li><li>Provide insights into complex technical jargons and clarify procedures</li><li>Participate in System Release Testing (Enhancement, Regression, report bugs)</li><li>Mentor and train team members to grow technically and professionally within the organization</li><li>Management of assigned client portfolio, Duties to support client base include transactional processing, follow up and securing reinsurance recoveries, collateral and timely and accurate system entry of all assigned client activity.</li><li>Assess and submit client and/or reinsurer presentation materials and communications to resolve questions and secure reinsurer agreement and payment of claims and account balances.</li><li>Work with Fiduciary and/or collections to assist collection of funds.</li><li>Manage settlement of funds to and from client in a timely manner ensuring all applicable payment warranties and/or conditions are met and take ownership of the end to end process.</li><li>Interacts with other company areas (Compliance, Finance etc.) on sensitive topics</li><li>Networks with external groups to increase own knowledge of the technical area.</li><li>Ensure Compliance adherence to internal and external regulators guidelines</li><li>Participate in Internal/External audits at Team Level and ensure team adherence to various compliances mandates</li><li>Identify & implement process improvement opportunities.</li></ul><p></p><p></p><p></p><p><b><span>Knowledge and Skills:</span></b></p><p></p><ul><li>Demonstrates knowledge of technical/functional insurance and reinsurance concepts, terms and contract clauses.</li><li>Demonstrates basic knowledge of market practices within technical domain areas.</li><li>Act as a mentor and coach to develop team colleagues; build passion and commitment towards team, department and organisational goals</li><li>Positive attitude, willingness to offer and execute ideas and solutions to enhance processes within a changing environment</li><li>Know-how of markets/legislations/regulators/procedures governing our business</li><li>Technical aptitude, analytical skills and ability to acquire subject matter expertise on existing and new processes</li><li>Well-read and updated on recent developments and happenings impacting our business</li><li>Able to engage, influence and negotiate with Clients, Markets and Colleagues in a professional manner. </li><li>Consistently provide guidance by mentoring and/or training Colleagues.</li><li>Consistently deliver superior Client service. </li><li>Strong ability to successfully manage workload considerate to varying demands to manage expectations of all Customers and Stakeholders</li><li>Proven track record with delivery of change, including but not limited to process and people impacts and process improvement to enhance the provision of service</li><li>Act as a role model by example, attitude and displaying of consistent behavior committed to a ‘can do’ culture.</li></ul><p></p><p></p><p><b><span>Education:</span></b></p><p>Graduate (Commerce preferable)</p><p></p><p></p><p><b><span>Eligibility:</span></b></p><p></p><ul><li>10+ years of experience in Re-insurance broking in the operations area</li><li>Should have undertaken the responsibility of coaching / mentoring technical experts</li><li>In -depth knowledge of Reinsurance concepts, Market systems, general business trends, financial and regulatory impacts on the organization</li><li>Proficiency in Microsoft Office Applications (Word, Excel, PowerPoint) required</li></ul><p></p><p></p><p><b>What makes you stand out?</b></p><p></p><ul><li>CII certification</li><li>Post-Graduation/Certificate Courses in Insurance</li><li>Adaptable communicator, facilitator, influencer and problem solver</li><li>Excellent Team Management Skills</li><li>Good relationship skills, Proven ability to work on own initiative as well as in a team </li><li>Ability to multi-task and prioritize time effectively</li></ul><p>Understanding of RPA / various process enhancement tools</p>Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}