{"Job ID": "69873061", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Finance Analyst - Accounts ReceivableWhat this job involves:Raise PO or request PO from client system (if included in SOW)\nRun E1 Funding report\nRaise funding to client and ensure all required supporting documentation attached\nEnsure invoices/credit notes are raised in accordance with client PO\nRequest invoices/credit notes to be raised in PeopleSoft or for outsourcing provider\nEnsure invoices/credit notes sent to client in order with invoicing instructions (email, portal upload or hard copy delivery)\nLog invoice in JDE E1\nResolve any client queries in consultation with Client Finance Analyst\nOnce funding received log receipts on relevant financial systems\nFollow up unallocated cash payments with clients / chase for remittances\nPerform AR Write Offs and Maintenance\nPrepare any relevant reports: AR ageing, invoice volumes, etc as requested by client teams\nCalculate and post aging provision to the GL and prepare provision report\nSupport financial reporting and reconciliation process.Sound like you? To apply, you need to be:1-3 years\nMotivated, positive and flexible in approach to work.\nProactive in identifying issues and potential solutions.\nSelf – supporting; diligent.\nAbility to work methodically and efficiently.\nProcess-driven approach to work.\nAbility to deliver to tight deadlines.Ability to learn quickly, and desire to develop.\nCustomer Service: Commitment to solve requests and problems.\nExcellent interpersonal, presentation and communication skills.\nIntermediate / Advanced PC skills, proficient in Office tools, such as Microsoft Outlook Word & Excel.\nFamiliarity with JDE E1 financial is advantageousWhat we can do for you:At JLL, we make sure that you become the best version of yourself by helping you realize your full potential in an entrepreneurial and inclusive work environment. We will empower your ambitions through our dedicated Total Rewards Program, competitive pay and benefits package.Apply today!Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500 company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}