{
    "Job ID": "69873013",
    "Description": "Why Patients Need You We're looking to bring medicines to the world faster and we are not willing to compromise on excellence and integrity. Adhering to local and global regulations is essential and the ever-changing regulatory environment requires forward thinking and attention to detail. Your dedication and expertise will help expand and accelerate patient access to Pfizer medicines and vaccines.What You Will AchieveYou will represent Pfizer as an approval liaison in the regulatory affairs team. You will play the critical role of providing strategic product direction to teams while interacting with regulatory agencies and negotiating with them to expedite approval of pending registrations. Due to your expertise, you will be the regulatory liaison on the project team throughout the product lifecycle and a regulatory representative to marketing or research project teams and government regulatory agencies. Your understanding of regulatory procedures will help in development of submission of product registration, progress reports, supplements, amendments and periodic experience reports.As an associate, your focus on the job will contribute in achieving project tasks and goals. Through your domain knowledge and commitment, you will create a collaborative teaming environment for your colleagues.It is your hard work and focus that will make Pfizer ready to achieve new milestones and help patients across the globe.How You Will Achieve ItContribute to the completion of project milestones and organize own work to meet project task deadlines.\nEnsure compliance of the team to the submission standards, procedures and policies framed by Global Regulatory Affairs.\nResponsible for the preparation and finalization of Global Regulatory Strategy Documents (GRSD), Comparative Toxicogenomics Database (CTD) sections of supplements / variations for Lifecycle Management (LCM) submissions and ensure effective data presentation and quality, by self or under guidance.\nProvide regulatory support to the cross functional teams for the assigned products, participates and provides inputs in technical reviews and strategic discussions on regulatory submissions.\nProvide regulatory inputs for the approval of promotional materials following applicable regulatory requirement, Pfizer policies, procedures, and practices.\nIdentify and assess regulatory risks associated with assigned projects and timely communication to the team to quickly mitigate the risks.\nLiaise with key stakeholders to ensure the filing strategies are defined and executed, and Board of Health (BoH) requirements are met, ensuring a submission ready dossier.\nEnsure commitments made to health authorities are entered into tracking systems and are tracked to closure.\nManage continuous improvement of selected processes relating to Human health submissions and selected drug and non-drug specific projects and related activities.\nEnsure timely approval according to product registration plan.\nMaintain the required regulatory databases to ensure compliance.\nKeep abreast of the external regulatory environment, including competitor intelligence, local product and international regulatory and commercial strategies.QualificationsMust-HaveBachelor's Degree\nProven ability to manage complex regulatory or drug development issues\nKnowledge of the regulations and guidelines in the various markets\nStrong relationship with the local health agency and other relevant stakeholders and pro-actively manages issues with key external stakeholders\nGood skills on communication, collaboration, negotiation and problem solving\nFluent in English, written and spoken\nComputer literacy and ability to learn new systemsNice-to-HaveKnowledge of regulatory processes and documents, knowledge of therapeutic areas\nThinks strategically with good project management skillsPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}