{"Job ID": "69872765", "Description": "Wood is currently looking for CSU Electrical and Instrument (PACO ) Engineer  to strengthen our team in Iraq. This is 28/28 days rotation. we are only considering applications from local Iraqi nationals preferably residing in Iraq, Basra.The Primary purpose of this role is to plan, coordinate, and provide discipline Precom and CSU support to Production Projects to achieve targets in a safe and efficient manner; to ensure projects deliver on original promises for production, ramp-up, availability, and are fully ready for the introduction of hydrocarbon and start up. This position requires the CSU PACO Engineer to play a critical role in helping to deliver the projects using Client standards, processes and procedures and he will normally be present at the work sites daily to oversee the projects.The CSU PACO Engineer will also provide support to Client plant improvements, turnarounds and major overhaul activities, as such strong experience in an operational maintenance role is an advantage.Provide technical expertise and deliver requirements for Commission and Startup projects at the various locations in accordance with industry best practice.\nProvide discipline technical support to other asset services activities, e.g. asset integrity reviews and improvement activities, shutdowns, maintenance and reliability.\nSupport and advise punchlisting of systems and closeout of punchlist items\nExecution of the Commissioning & Start Up Plan and Pre-Commissioning/Commissioning Execution Plan.\nProvide input to Pre-Commissioning and Commissioning Procedures, including Systems Testing Procedures.\nAssist and contribute to the Flawless start-up initiative.\nSupport the Project to Asset Handover strategy to align with Operations handover requirements.\nProvide quality assurance and coaching on systems acceptance and punch listing activities undertaken by the Client Operations team\nPromote a Flawless Project Delivery (FPD) approach within the Project Teams and Operations to ensure a cost effective and quick ramp up to targets\nWork closely with project and operations to help develop SU team skills and competency requirements\nParticipate in Peer reviews on start up and operating procedures\nWork closely with Project and Operations personnel to meet the commissioning and start up milestones.\nLiaise with the Client projects and contractor teams\nEnsure risks to the CSU schedule are identified and raised early\nAssist to Produce punch lists, acceptance documentation, site and technical queries.\nAssist to ensure close out of outstanding work and punch items, prior to systems being accepted for commissioned.\nProvide input into the preparation of the maintenance plans in line with Operations & Maintenance philosophy, Maintenance/Integrity strategies; ensure maintenance tasks are developed based on best practices, vendor’s recommendations, results of appropriate analyses;\nProvide input to the definition and preventive maintenance requirements for SCE’s\nAssist in the review of relevant Operational Excellence elements\nProvide input to the CSU Safety Strategies and promote safe practice for personnel and safe operation of production assets\nCSU PACO Engineers are required to work daily in the operating worksites, leading improvements by maintaining full compliance with PPE and safety standards in challenging conditions\nAbility to work effectively with all different functions in the JV and with Project Teams\nObtaining equipment maintenance information including status , results, etc., in a site with minimal original construction or maintenance records\nPhysically challenging working environment\nSimOps support to ensure flawless integration of rehabilitated, rejuvenated and newly constructed facilities within facilities still in productionTechnical Certifications, 5+ years experience in a gas and oil industry\nMinimum 2 years in senior position, CSU experience preferred.\nGood technical communication skills;\nAbility to interact with members of projects, contractor and BGC asset teams;\nCapable of giving direction and guidance on CSU planning & reporting;\nGood understanding of instrumentation, control, and safe guarding  equipment,\nGood understanding of materials, construction, commissioning, and startup\nExtensive knowledge of plant instrumentation systems in order to evaluate and rank risks\nKey Competences required\nDemonstrated evidence of Enterprise first values and behaviors will be taken into account during the selection process.\nCommissioning & Start Up of Facilities: Skill\nFlawless Project Delivery: Knowledge\nBuilds Shared Vision: Skill\nChampions Customer and Stakeholder Focus: Knowledge\nMaximizes Business Opportunities: Awareness\nDemonstrates Self Mastery: Knowledge\nDemonstrates Courage: Skill\nMotivates, Coaches and Develops: Skill\nValues Difference: Knowledge\nDelivers Results Through Others: Knowledge\nProvide Leadership in HSSE: Knowledge\nApply Effective Management of HSSE Risk: Knowledge\nUnderstanding of relevant standards, procedures, business processes and methodologies: Skill\nControl, Measurement, Automation & Safeguarding Systems: Skill\nFacility Layout, Equipment & Piping: Knowledge\nWork Planning Resource & Schedule Management : KnowledgeWood is a global leader in consulting and engineering, helping to unlock solutions to critical challenges in energy and materials markets. We provide consulting, projects and operations solutions in 60 countries, employing around 35,000 people. www.woodplc.comWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Iraq", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}