{"Job ID": "69875665", "Description": "Embee is hiring!Noventiq’s story is one of change. We grew, expanded, and adapted, learning more at each step. Now effecting change is at the heart of everything we do. And that doesn't just apply to our customers, it’s how we feel about everyone who works with us.Noventiq (the brand name of Cyprus-registered Softline Holding plc) is a leading global solutions and services provider in digital transformation and cybersecurity, headquartered and listed in London. The company enables, facilitates and accelerates digital transformation for its customers’ businesses, connecting 75,000+ organizations from all sectors with hundreds of best-in-class IT vendors, alongside its own services and solutions.With a turnover of US$ 1.1 billion in the fiscal year of 2021, Noventiq is currently one of the fastest-growing companies in the sector. In October 2021, the company \"Softline Holding plc\" got its primary listing on the London Stock Exchange (LSE:SFTL). Noventiq’s growth is underpinned by its three-dimensional strategy to expand its geography, portfolio and sales channels. The strategy is supported by Noventiq's active approach to M&As, enabling the company to take advantage of the ongoing consolidation in the industry.Now we’re looking for an Azure Cloud Native, you’ll be a part of our Embee team.About you:Professional\nExperience at least 5-8 years of related experience in Azure Cloud Native & Apps technical service delivery and support.\nAcademic Qualification: bachelor’s degree in computer science, OR master’s degree in computer science\nTechnical\n3-4 years of experience in Azure cloud hosted environment and Azure Kubernetes Services.\nAzure AKS - experience working with pods, configuring the pods, exec into containers and review logs, etc.\nExperience in supporting both the K8s layer, as well as supporting the deployment of workloads into Kubernetes via CI/CD.\nSupport, maintain the Kubernetes capability, and support delivery of containerized workloads.\nHands-on experience with Azure DevOps, Git, Octopus Deploy, and Agile methodologies. Integrate AKS with continuous integration and continuous deployment (CI/CD) pipelines.\nknowledge with Networks, Palo Alto, Firewalls and Security in a Cloud based environment.\nExperience in Terraform.\nExperience with scripting languages like PowerShell, Bash, or Python for automation tasks. Scripting skills are valuable for creating automation scripts.\nCompliance: Ensure that AKS clusters comply with industry and organizational standards and regulations. This involves aligning security and configuration practices with compliance requirements.\nAutomation: Develop and maintain scripts or automation tools to streamline AKS cluster provisioning and management. Automation helps reduce manual tasks and ensures consistency.\nTroubleshooting: Identify and resolve issues related to AKS clusters and applications running on them. Troubleshooting skills are crucial for maintaining the availability and reliability of AKS environments.\nCI/CD Integration: Integrate AKS with continuous integration and continuous deployment (CI/CD) pipelines. Experience in Jenkins, or GitLab CI.\nCompliance: Ensure that AKS clusters comply with industry and organizational standards and regulations. This involves aligning security and configuration practices with compliance requirements.\nNetworking: Understanding of Azure networking concepts and network security groups. Knowledge of networking is necessary for configuring AKS networking.\nCertifications: Certifications such as Azure Administrator Associate or Kubernetes Certified Administrator (CKA) or CKAD are a plus What we offer:Working in an international environment with a team all over the globe in more than 65+ countries;\nAn inspiring corporate culture with an ability to grow and develop every day;\nFascinating compensation package with advantages from motivation programs (Long-Term Employee Partnership Program (LTEPP) and Employee Share Purchase Program (ESPP).Don’t forget to include your CV and cover letter. We receive a lot of applications, but we try to notice each of our potential candidates.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}