{
    "Job ID": "69874641",
    "Description": "Mission Statement : We are seeking an R&D Cybersecurity Analyst (Product Security Engineer) to join our team and assist with cybersecurity, penetration testing, and product security research and development. The successful candidate will be responsible for analyzing and evaluating security measures for our products, conducting penetration testing to identify potential security threats, and developing solutions to address security vulnerabilities. You will be the primary contact and driver to ensure security hardened Products and Systems also including security related knowledge management and rollout in the Enterprise Software Solutions organization. Your Responsibilities : Conduct cybersecurity research and analysis to identify potential security threats. Perform penetration testing to evaluate the security of our products. Analyze and evaluate security measures and controls for our products. Develop solutions and recommendations to address security vulnerabilities. Assist in the development of cybersecurity policies and procedures. Stay up-to-date with the latest trends and technologies in cybersecurity and product security. Work collaboratively with the R&D team to ensure cybersecurity is integrated into the development process. Ability to work in a multinational team with agile mentality. Overall driver for the consistent implementation of HE Cyber Security strategy, processes and communication within Enterprise Software Solutions. Responsible for tracking, auditing and reporting as per internal Security Development Lifecycle. Ensure a timely and consistent process for handling of security vulnerabilities in Enterprise Software Solutions products – including detection, assessment, correction and knowledge distribution. Creating and keeping a comprehensive understanding of global cybersecurity risks and market requirements, including regulations and standards. Alignment with product management and R&D project leaders to ensure security lifecycle planned within product development roadmaps. Anticipate and influencing current and future technologies and trends and leading internal knowledge sharing. Actively contributing to find, manage and reduce cybersecurity risks – both today and in the future. Preparation and execution of internal awareness and training programs. Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business. Your Background : Graduated with a degree in Computer Science, Cybersecurity, or a related field. Candidate with 2-5 years of relevant experience. Familiarity with cybersecurity principles, penetration testing, and product security. Understanding of common vulnerabilities and exploits. Experience with at least one programming language, such as Python, C# or C++. Familiarity with cybersecurity tools such as Kali Linux, Metasploit, and Nessus. Ability to work independently and collaboratively with a team. Excellent verbal and written communication skill.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}