{
    "Job ID": "69875909",
    "Description": "Bosch Global Software Technologies Private Limited is a 100% owned subsidiary of Robert Bosch GmbH, one of the world's leading global supplier of technology and services, offering end-to-end Engineering, IT and Business Solutions. With over 22,700 associates, it’s the largest software development center of Bosch, outside Germany, indicating that it is the Technology Powerhouse of Bosch in India with a global footprint and presence in the US, Europe and the Asia Pacific region.Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.\nMinimum of 10 years of hands-on experience in software product development.\nProvide technical leadership and guidance to software development teams, ensuring adherence to best practices, clean coding standards, and source control procedures.\nCollaborate closely with Architects, understanding their vision and translating it into actionable development plans. Contribute to the creation of Technology Foundation proposals aligned with the organization's digitization strategy.\nSolve complex technical challenges faced by development teams by offering innovative and effective solutions.\nDrive the establishment and enforcement of development standards, ensuring code quality, security, scalability, and maintainability.\nLead by example in terms of implementing best coding practices, design patterns, and continuous integration/continuous deployment (CI/CD) processes.\nMentor and coach team members, fostering their professional growth and promoting a culture of continuous learning and improvement.\nCollaborate with Product Owners and stakeholders to understand requirements, propose technical solutions, and contribute to the product roadmap.\nArchitect and implement high-performance, reliable, and scalable software solutions using Microsoft technologies like .NET, Azure, .NET Core, Blazor, and Power Platform.\nLead refactoring efforts, performance optimizations, and technology upgrades to enhance the overall quality and efficiency of our software products.\nStay current with emerging technology trends and bring innovative ideas to the table, driving the adoption of new technologies when relevant.Mandatory Skills:Extensive expertise in Microsoft Technology Stack, including .NET, Azure, .NET Core, Blazor, and Power Platform.\nProficiency in setting development standards such as clean coding, source control practices, and CI/CD pipelines.\nProven experience (minimum 2 years) collaborating with Architects and contributing to technical decisions.\nStrong understanding of low-code platforms and their applications.\nExcellent problem-solving skills, with the ability to devise effective solutions for complex technical challenges.\nStrong communication skills to interact with technical and non-technical stakeholders.Mandatory certification ( if Any):.Net and Azure certificationsGood to have skills :\nPrevious experience in a leadership or technical lead role within a software development environment.\nFamiliarity with other programming languages and technologies outside the Microsoft ecosystem.\nDemonstrated ability to drive innovation and leverage technology trends to improve product offerings.\nExperience in Agile/Scrum methodologies and project management tools.B.E/B.Tech10+Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}