{"Job ID": "69873684", "Description": "Transportation Financial Systems (TFS) owns the technology components that perform the financial activities for transportation business. These systems are used across all transportation programs and retail expansion to new geographies. TFS systems provide financial document creation & management, expense auditing, accounting, payments and cost allocation functions. Our new generation products are highly scalable and operate at finer level granularity to reconcile every dollar in transportation financial accounts with zero manual entries or corrections. The goal is to develop global product suite for all freight modes touching every single package movement across Amazon. Our mission is to abstract logistics complexities from financial world and financial complexities from logistics world. There are ample opportunities in the team to build domain expertise in financial system as well as transportation.\nJob description:\nThe Transportation Support Team is looking for a Software Support Engineer who can provide support for production software application issues and internal customer issues in Transportation Financial Services organization. Support Engineer will be specializing in application support of Trans Financial Systems. Your solutions will impact our customers directly! This job requires you to constantly hit the ground running and your ability to learn quickly and work on disparate and overlapping tasks will define your success. High Impact production issues often require coordination between multiple Development, Operations and IT Support groups, so you get to experience a breadth of impact with various groups.\nPrimary responsibilities include troubleshooting, diagnosing and fixing production software issues, developing monitoring solutions, performing software maintenance and configuration, performing user acceptance test, implementing the fix for internally developed code (Perl, Ruby, Java), performing SQL queries, updating, tracking and resolving technical challenges. Responsibilities also include working alongside development on Amazon Corporate and Divisional Software projects, updating/enhancing our current software, vulnerability remediation, automation of support processes and documentation of our systems.\nThe ideal candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, able to juggle multiple tasks at once, able to work independently and can maintain professionalism under pressure. You must be able to identify problems before they happen and implement solutions that detect and prevent outages. You must be able to accurately prioritize projects, make sound judgments, work to improve the customer experience, and get the right things done.\nWe are open to hiring candidates to work out of one of the following locations:\nHyderabad, TS, IND\n- 4+ years of software development, or 4+ years of technical support experience\n- Experience troubleshooting and debugging technical systems\n- Experience in Unix\n- Experience scripting in modern program languages\n- Experience in agile/scrum or related collaborative workflow\n- Experience troubleshooting and documenting findings\n- Knowledge of distributed applications/enterprise applications\n- Knowledge of UNIX/Linux operating system\n- Experience analyzing and troubleshooting RESTful web API callsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}