{
    "Job ID": "69873670",
    "Description": "Position status: This opportunity is for a secured role that is due to commence in September subject to approval. If you would like to be considered as we progress with this position, please click to apply.The opportunityTo be responsible for providing accounting support to the company's departments and ensuring that financial records are accurate and compliant with International Financial Reporting Standards (IFRS).They will also work with the group financial controller to develop and implement financial reporting systems and procedures.This role is on contract for six months.Mace is an inclusive employer and welcomes interest from a diverse range of candidates. Even if you feel you do not fulfil all of the criteria below, please apply as you may still be the best candidate for this role or another role within our organisation. We are also open to discussing part time, flexible, and hybrid working options if suitable within the role. Should you require any adjustments to assist during the application/hiring process please advise us.Your responsibilities will include:Reconciling and preparing schedules for each balance sheet account and ensuring they are in line with the International Financial Reporting Standards (IFRS)\n\nAssisting in the month-end and year-end closing activities for the whole Mace Operate Group.\n\nAssisting in the preparation or review of tax returns for the whole Mace Operate Group which will include transaction analyses, gathering supporting documentation and coordinating with 3rd party tax consultants.\n\nSupporting the preparation of annual statutory financial accounts which includes a statement of financial position, financial performance and cash flows.\n\nAssisting with a yearly budget and monthly forecasts.\n\nWorking capital management, (including forecasting and intercompany reconciliations).\n\nContributing to continually improving the finance processes and procedures.\n\nMaintaining a good working relationship with all internal and external stakeholders.\n\nContinuing to be flexible and adaptable to the rapid expansion and changing needs of the business.About youYou will ideally have one of the following qualifications ACCA, ACA, CIMA, CPA, or CMA certifications. You have experience in managing financial and accountancy systems and an understanding of payment systems. Implementation of new finance system experience would be an advantage. You have working knowledge of MS Word, Excel and PowerPoint.You are digitally savvy, can build lasting client relationships and lead strong, motivated teams. You will ideally have some knowledge of the FM industry although not essential, you will be hungry to grow your career and enjoy the opportunities Mace has to offer.If you would like to make a confidential enquiry, please contact Beverley Giles in the recruitment team.Please remember the Employee Referral Scheme and if there are any talented people you can recommend, just click the button and use the ‘Refer a friend’ feature found within the relevant job.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Dubai, United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}