{"Job ID": "69873410", "Description": "Associate Manager, Solution Engineering – Pune, IndiaWould you like to be a part of great work happening in Western Union to reimagine the customer experience enabling the vision of making the digital banking, cross-currency, cross-border money movement seamless for our customers? Are you interested in joining a globally diverse organization where our unique contributions are recognized and celebrated, allowing each of us to thrive? Then join Western Union as an Associate Manager, Solution Engineering.Western Union powers your pursuit.We are looking for Associate Manager, Solution Engineering who will work in partnership with other groups within Western Union. In this unique role, you will form and lead a highly technical and dynamic team. This team will be responsible for building and maintaining our next-generation software. As an Associate Manager, you will be responsible for the implementation of a service delivery model supporting assigned platforms through a predefined framework. The broad range of responsibilities include leading engineering and configuration teams, partnering with key stakeholders, both off-shore and on-shore, and delivering on the service level agreements.Role ResponsibilitiesYou will be accountable to mentor technically and spearheading technical teams, develop and implement new software, maintain, and improve existing software, and applications in Production etc.\nYou will be responsible for the implementation of a service delivery model supporting assigned platforms through a predefined framework.\nTroubleshooting application issues in a complex code base.\nInteracting with customers to solve issues and discuss technical questions.Role RequirementsTo perform this role, you should have 10+ years of experience in software development, Experience in developing and implementing web-based solutions.\nexperience in architecture and design concepts, object-oriented design, and techniques.\nExposure to EAI design patterns is expected. Experience of relational databases is a must.\nExperience in Agile and Iterative development methodologies.\nTechnical areas of expertise like Strong Core JAVA, J2EE concepts or experience in CEP (Complex event processing) based tools like TIBCO Business Events.\nExposure to relational databases, NOSQL is a plus. Experience on Core Java including OOPS, exception handling, Collections Framework, abstraction, inheritance etc.\nExperience in using J2EE APIs like JPA, JTA, JMS, JDBC etc.\nStrong experience in Spring framework including IOC, Spring boot etc.\nexperience in containerization, API Gateways is a plus. Experience with cloud native, cloud enabled applications is required.\nExperience with EAI (Enterprise Application Integration), MOM (Messaging oriented Middleware) is required, CEP (Complex event processing) is a plus.We make financial services accessible to humans everywhere. Join us for what’s next.Western Union is positioned to become the world’s most accessible financial services company transforming lives and communities. To support this, we have launched a Digital Banking Service and Wallet across several European markets to enhance our customers’ experiences by offering a state-of-the-art digital Ecosystem. More than moving money, we design easy-to-use products and services for our digital and physical financial ecosystem that help our customers move forward.Just as we help our global customers prosper, we support our employees in achieving their professional aspirations. You’ll have plenty of opportunities to learn new skills and build a career, as well as receive a great compensation package. If you’re ready to help drive the future of financial services, it’s time for the Western Union. Learn more about our purpose and people at https://careers.westernunion.com.BenefitsYou will also have access to short-term incentives, multiple health insurance options, accident and life insurance, and access to best-in-class development platforms, to name a few\n(https://careers.westernunion.com/global-benefits/). Please see the location-specific benefits below and note that your Recruiter may share additional role-specific benefits during your interview process or in an offer of employment.Your India specific benefits include:Employees Provident Fund [EPF]Gratuity Payment\nPublic holidays\nAnnual Leave, Sick leave, Compensatory leave, and Maternity / Paternity leave\nAnnual Health Check up\nHospitalization Insurance Coverage (Mediclaim)\nGroup Life Insurance, Group Personal Accident Insurance Coverage, Business Travel Insurance\nCab Facility\nRelocation BenefitWestern Union values in-person collaboration, learning, and ideation whenever possible. We believe this creates value through common ways of working and supports the execution of enterprise objectives which will ultimately help us achieve our strategic goals. By connecting face-to-face, we are better able to learn from our peers, problem-solve together, and innovate. Our Hybrid Work Model categorizes each role into one of three categories. Western Union has determined the category of this role to be Hybrid. This is defined as a flexible working arrangement that enables employees to divide their time between working from home and working from an office location. The expectation is to work from the office a minimum of three days a week.We are passionate about diversity. Our commitment is to provide an inclusive culture that celebrates the unique backgrounds and perspectives of our global teams while reflecting the communities we serve. We do not discriminate based on race, color, national origin, religion, political affiliation, sex (including pregnancy), sexual orientation, gender identity, age, disability, marital status, or veteran status. The company will provide accommodation to applicants, including those with disabilities, during the recruitment process, following applicable laws.#L1-RP #LI-Hybrid Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}