{"Job ID": "69874778", "Description": "Coursera was launched in 2012 by two Stanford Computer Science professors, Andrew Ng and Daphne Koller, with a mission to provide universal access to world-class learning. It is now one of the largest online learning platforms in the world, with 129 million registered learners as of June 30, 2023.Coursera partners with over 300 leading university and industry partners to offer a broad catalog of content and credentials, including courses, Specializations, Professional Certificates, Guided Projects, and bachelor’s and master’s degrees. Institutions around the world use Coursera to upskill and reskill their employees, citizens, and students in fields such as data science, technology, and business. Coursera became a B Corp in February 2021.Join us in our mission to create a world where anyone, anywhere can transform their life through access to education. We're seeking talented individuals who share our passion and drive to revolutionize the way the world learns.We at Coursera are committed to building a globally diverse team and are thrilled to extend employment opportunities to individuals in any country where we have a legal entity. We require candidates to possess eligible working rights and have a compatible timezone overlap with their team to facilitate seamless collaboration. As a remote-first company, our interviews and onboarding are entirely virtual, providing a smooth and efficient experience for our candidates.Job Overview:Coursera is bootstrapping a new development center in Pune, India. This is an unique opportunity to be part of the founding team that would not only own a mission critical charter but also play a significant role in shaping the culture for the location. We are looking for individuals with an entrepreneurial mindset who are excited by the prospect of building impactful 0 to 1 products.&nbsp;As an engineer on the degrees team, you would be making revolutionary learner focussed degrees from world class universities accessible to millions of learners all over the world. Coursera’s mission is to become the world’s #1 destination for working adults to discover and enroll in affordable, job-aligned degrees. Specifically on the degrees integration team, you will build data integrations with various university systems and surface actionable insights via internal and end-user facing dashboards &amp; notifications. The goal of this team would be to own and improve the time to launch new degrees on Coursera. You will work closely with a cross functional team of product, design, QA and peers from data engineering, infrastructure and SRE. You must be comfortable working in a fast-moving team environment (we deploy many times a day!)Responsibilities:Design and implement scalable &amp; robust frontend applications\nMeasure your work thoroughly, analyze results, and generate hypotheses to drive new product changes through A/B testing\nWrite and review technical documentation for the components owned by your team\nDevelop and deploy your high-quality code (in Java, Scale or similar languages) following industry best practices and track key service level indicators (SLIs)\nDebug and fix production issues, lead blameless retrospectives, and participate in the on-call rotation to ensure adherence to the service level agreements (SLAs)\nCollaborate and mentor team members, and contribute to teams' success improving processesBasic Qualifications:5+ years of experience working in a relevant frontend software engineering role\nProficiency in the core technologies of the web: Javascript, HTML, and CSS, experience in at least one modern UI framework (e.g. ReactJS, AngularJS,&nbsp; etc), and experience in building large-scale web applications\nProficiency in implementing responsive web designs, writing unit, integration and e2e tests\nFervent belief in engineering quality and building technical leverage for others\nComfortable working in a fast-moving team environment (we deploy many times a day!)\nData-driven and strongly motivated by success and learnings through experiments and metrics analysisPreferred Qualifications:&nbsp;Candidates with prior experience in start-up environments are preferred, specifically those who have been part of a bootstrapping team, small start-up team, or expansion team.\nDemonstrated ability to work in a fast-paced and dynamic environment, and navigate through ambiguity and uncertainty with confidence.\nExperience collaborating with cross-functional teams to deliver high-quality products or services.\nProven track record of delivering results in a resource-constrained environment with limited guidance and supervision.If this opportunity interests you, you might like this course on Coursera:Google Cloud Engineering Professional Certificate\nFront-End Web Development with React\nHTML, CSS, and Javascript for Web DevelopersJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "General Engineering Consultancy", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}