{"Job ID": "69873702", "Description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of over 50,000 pioneers around the globe. Our teams at Henkel Adhesive Technologies help to transform entire industries and provide our customers with a competitive advantage through adhesives, sealants and functional coatings. With our trusted brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.Dare to make an impact?Executes local sales plans (short, mid, long term) in line with SBU strategy to maintain and develop existing / acquire new customers.\nManages customer roadmap and closes respective CRM tool (ACE) growth opportunities.\nBuilds and maintains relationships with customers and distributors.\nProvides input to manager on customer needs, business trends, competitive situations in territory.\nCoordinates with TCS to conduct line trials / (re)solve customer requests and complaints.Possesses at least 2-3 years of Industrial Sales experience, prior experience from furniture / building material related industry an added advantage.\nValue Selling.\nCrisis handling and objection Management.\nCustomer research ability and prospecting.\nIdentifying key player roles and proposal generation.\nStrong communication skills and team player.Henkel is an equal opportunity employer. We look for a diverse team of individuals who possess different backgrounds, experiences, personalities and mindsets.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}