{
    "Job ID": "69875662",
    "Description": "3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas. Here, you can apply your talent in bold ways that matter.Job Description:Job Title: CS eOrdering Support Specialist (m/f/*) (New Health Care Company)3M is establishing two industry-leading companies, creating value through the spin-off of its Health Care business, while 3M will continue to be a global material science leader, focusing our innovation to win in favorable global megatrends and attractive end markets. This new Health Care Company will be a leading global diversified health technology company with:     Proven category leadership  \nExposure to attractive end-markets  \nInnovation mindset driving improved patient outcomes  \nCollaborative customer relationships  \nDeep global regulatory experience  \nOperational excellence and strong cash flow  \nStrong sales growth and profitability with significant recurring sales  We expect the creation of the two companies will be completed by the end of 2023. For now, we will continue to operate as one global company. This role is positioned to drive the success of the \"New Health Care Company”.  This position provides an opportunity to transition from other private, public, government or military experience to a 3M career.The Impact You’ll Make in this Role\n As a CS eOrdering Support Specialist*, you will have the opportunity to tap into your curiosity and collaborate with some of the most innovative and diverse people around the world. Here, you will make an impact by:customer facing aspects of eOrdering support, including bCom & ePOP (ePOP – no technical expertise needed, but coordination between GSC and local team),\nmaintenance & support of EDI market places/portals/providers,\nparticipate in/run clean-up projects : old orders, old blocks, old SFDC cases, old returns,\nsupporting customers with coordination and implementation of EDI connections as well as supporting project/issues with OCR tools used within ordering process\nmay be responsible for more technical tasks related EDI connection: including requirements definition, data integrity, testing, training and reporting as well as monitoring of daily EDI operations (verification of EDI transmissions, compliance assurance, troubleshooting and performance of root cause analysis, data exception handling, and re-processing when necessary.Your Skills and Expertise To set you up for success in this role from day one, 3M requires (at a minimum) the following qualifications:Experience in Order management as user, super user, support function, integrating electronic flow management (Electronic Data Interchange, Optical Characters Recognition, web platforms…)\nSAP experience (including other stream than OTC such as LEX-Logistic Execution)\nBachelor’s Degree with an accredited University / College\nAdvanced EnglishAdditional qualifications that could help you succeed even further in this role include:Experience working with different EDI standards and formats, iDoc reprocessing\nSystem mapping experience\nCapability to manage multiple projects in parallel, including technical/supply chain dimensionsFor current employees, internal transfer restrictions may not apply. For more details, contact your local recruiter/HR team.Work location:Work Your Way Eligible (Employee choice to work remote, on site, or hybrid)Must be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status).Supporting Your Well-being 3M offers many programs to help you live your best life – both physically and financially. To ensure competitive pay and benefits, 3M regularly benchmarks with other companies that are comparable in size and scope. Chat with MaxFor assistance with searching through our current job openings or for more information about all things 3M, visit Max, our virtual recruiting assistant on 3M.com/careers.(*) At 3M, diversity & inclusion are essential to innovation. We seek and value differences in people! This Job ad is addressed to all potential candidates. As an equal opportunity employer 3M will not discriminate against any applicant for employment on the basis of religion, sex, sexual orientation, gender identity, national origin, age or disability.Please note: your application may not be considered if you do not provide your education and work history, either by: 1) uploading a resume, or 2) entering the information into the application fields directly.3M Global Terms of Use and Privacy StatementCarefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms.Please access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}