{"Job ID": "69873337", "Description": "Job Number 23167911 Job Category Management Development Programs/Interns Location The Abu Dhabi EDITION, Al Bateen Marina, Abu Dhabi, United Arab Emirates, United Arab Emirates VIEW ON MAP Schedule Full-Time Located Remotely? N Relocation? N Position Type Non-Management Build upon your classroom studies through our Hotel Internship Program opportunities. You will learn first-hand about a hotel's operations. Our Hotel Internship Program allows you to truly experience the industry from the ground up, where our founders and many of our leaders began. You will get immersed in Marriott's culture and business and find your true calling in the travel industry. Our internships are typically available in many different areas of the hotel. By gaining hands-on experience in the exciting world of hotel management, you'll be better prepared to pursue opportunities post graduation. Here's to exploring, kickstarting your dream career, and joining us on your journey! To be considered for an internship, you must be a current college or university student. Want to join us? Apply now! Marriott International is the world's largest hotel company, with more brands, more hotels and more opportunities for associates to grow and succeed. We believe a great career is a journey of discovery and exploration. So, we ask, where will your journey take you? marriotthotelinternship Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. EDITION Hotels combine the visionary genius of boutique hotelier Ian Schrager, the service delivery of a world-class luxury hotel, and the global reach of Marriott International to create an entirely new experience in the world of hospitality. EDITION delivers the best of both worlds in a delicate balancing act – polish with personality, perfectionism with individualism, and comfort with charisma and charm. The brand targets sophisticated, knowledgeable consumers who understand quality, originality, design, and service excellence, but who want it without limitations – breaking the bounds of convention and demanding an attitude and a feeling wrapped in a package that showcases the exceptional. But to create this magical experience, we need you. We are looking for outgoing, authentically amazing people who are looking for a place to work that inspires them, challenges them and makes them proud to come to work. A place where service comes from the heart, not from a handbook. A place that delivers a never-ending theatrical performance that continuously delights and enchants each and every one of our guests. We invite you to join us today. In joining EDITION, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Employer (Private Sector)", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}