{"Job ID": "69873207", "Description": "Req ID:434269 We create smart innovations to meet the mobility challenges of today and tomorrow. We design and manufacture a complete range of transportation systems, from high-speed trains to electric buses and driverless trains, as well as infrastructure, signalling and digital mobility solutions. Joining us means joining a truly global community of more than 38 900 people dedicated to solving real-world mobility challenges and achieving international projects with sustainable local impact.Project Quality ManagerWe create smart innovations to meet the mobility challenges of now and the future. We design and manufacture a complete range of transportation systems, from high-speed trains to electric buses, autonomous subways, signalling and digital mobility solutions. Joining us means joining a truly global community of 36 300 people dedicated to solving real-world mobility challenges and achieving international projects with sustainable local impact.www.alstom.comAbout Alstom in IndiaAlstom has established a strong presence in India. Currently, the company is executing metro projects in several Indian cities including Chennai, Kochi and Lucknow where it is supplying Rolling Stock manufactured out its state of the art facility at SriCity in Andhra Pradesh. In the Mainline space, Alstom is executing Signaling & Power Supply Systems for the 343 Km. section on World Bank funded Eastern Dedicated Freight Corridor. Phase 1 in the construction of the new electric locomotive factory for manufacturing and supply of 800 units of 12000HP locomotives is also complete at Madhepura, Bihar while the depot at Saharanpur, Uttar Pradesh is ready to commence operation. Alstom has set up an Engineering Centre of Excellence in Bengaluru, and this coupled with a strong manufacturing base as well as localized supply chains, is uniquely positioned to serve customers across the globe. Today, Alstom in India employs close to 3600 people and in line with Government of India’s ‘Make in India’ policy initiative, Alstom has been investing heavily in the country in producing world class rolling stock, components, design, research and development to not only serve the domestic market, but also rest of the world.www.alstom.com/ IndiaOrganisational ReportingReports to the Project head and Head of Quality, Systems & InfraKey Network & LinksInternal (50%): Project Head, infra quality head, Supplier Quality, Engineering, Operations Work Packages leaders etc.External (50%): Customers, Consultants, Subcontractors, suppliers etc.Key ResponsibilitiesTask ManagementUnderstanding customer needs, contract and other requirements to develop effective quality control processes\nWell versed in ISO 9001-2015 requirements and impletion as per project requirement\nDevising and reviewing specifications and quality plans for products or processes in line with contract\nSetting requirements for products and equipment’s for suppliers and monitoring their compliance\nOrganizing Factory Acceptance Test (FAT) and receipt inspection at Warehouse  \nLiaise with third party inspectors as pe requirement\nSupervise inspectors, technicians, other staffs and provide guidance and feedback\nOversee all product development procedures to identify deviations from quality standards\nInspect final output and compare properties to requirements\nApprove the right products or reject defectives\nKeep accurate documentation and perform statistical analysis and effective presentation for management review (project and HO level)\nSolicit feedback from customers to assess whether their requirements are met\nBe on the lookout for opportunities for improvement and develop new efficient procedures and implementation of continuous improvement initiatives\nIndependently determine approach and assigned tasks\nGood understanding and monitoring on project V cycle and organizing gate reviews\nGood understanding the MIS system for regular monitoring, control and reporting\nTendering Skills\nKnowhow of Safety Clearances/ Safety Norms for T&C activities\nAlstom internal process controlPeople ManagementProviding training to field engineers and guide to project team members of various functions to make aware of quality requirements, processes.\nAttending training as per identified requirementsRelationship ManagementLiaise with Process Improvement team for effective implementation of PI initiatives and best practices within the team\nLiaise and communicate with customers, consultants, suppliers, internal customers etc.SkillsKnowledge of quality management systems and quality control procedures/Tools\nGood understanding of ISO 9001:2015 and requirements\nUnderstanding of engineering drawings and manufacturing processes\nAbility to work in a diverse and dynamic environment\nPlanning and prioritising activities; keen eye on detailed and result driven approach\nGood communication and interpersonal skills\nAbility to present data effectively\nProblem-solving skills\nTeam working and leadership skills\nAnalytical skills, proficiency in MS office\nUnderstanding of cost and financial impacts\nAbility to work on own initiative\nCertification of quality control is a strong advantage (ISO 9000 etc.)Qualifications and Experience Levels:BE/B. Tech in Electrical/ Electronics\nAt least 10 years overall experience with 4- 5 years’ experience in Quality (Rail/Metro Project site)\nExperience of dealing with customers, consultants and suppliers\nMembership of an industry related professional body would be added advantageDescribe the degree of business comprehension required in order to carry out the role (knowledge of the entire organisation, some functional areas within the organisation, domestic market, international market…) eg                                                                                                                                                               1 lowest            4 highestKnowledge of Alstom                                                                   1  2  3  4\nKnowledge of other functional areas within the organisation     1  2  3  4\nKnowledge of the domestic environment                                    1  2 3  4\nKnowledge of the international environment                              1  2  3  4Educational RequirementsBE/B. Tech in Electrical/ElectronicsExperienceBroad Knowledge of railway systems, operating requirements, available equipment and systems.At least 7 years of experience in Engineering / Technical functions including at 2- 3 years in experience in Site Quality activitiesFunctional Know How- Apply ALSTOM Discipline and Processes- Use Seasoned Judgement- Use Business Indicators- Use Technical and Industry Experience- Create Enthusiasm- Promote Teamwork- Foster Open Dialogue and Listens- Manage Conflicts of Ideas- Act as a Team PlayerOperational and Leadership Know How- System Engineering practices\n- Safety\n- QCD methodology\n- Experience of People Management\n- Fluent in English, and fluent in contract language\n- Wide knowledge of the rail environment appreciated\n- Good co-ordination and communicationJob LocationLocated in MumbaiAn agile, inclusive and responsible culture is the foundation of our company where diverse people are offered excellent opportunities to grow, learn and advance in their careers.  We are committed to encouraging our employees to reach their full potential, while valuing and respecting them as individuals.   Job Type:ExperiencedJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Mumbai, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}