{"Job ID": "69875883", "Description": "At Vialto Partners we create the connections that build global careers and societies, bridging\nthe gap between people and their aspirations. As the world of work continues to\nevolve, we are bringing together the individuals, ideas and technology to unlock\nbusiness and human growth.The Learning & Career Development function’s goal is to create a highly engaging learning environment through consulting, advising, and providing learning resources and programs that help people grow and move in their careers.The team is responsible for ensuring the organization continuously builds and develops its leadership, functional and technical skills so that our people can deliver the business strategy and achieve future goals. Our new digital-first learning and development strategy includes building a skills-based learning curriculum that incorporates best-in-class learning content (digital, virtual, and in-person) and is supported by robust learning technology and processes. The Digital Learning Administrator will:Administer learning systems.Responsible for overall running/administration of Workday learning\nUpskills/trains Workday Learning administrators and superusers.\nAdds content to learning paths and assign to different learner groups.\nCustomizes design of launch pages for different learner groups\nCoordinates with HR Information Systems and digital vendors on troubleshooting and content uploads\nSupports Talent Marketplace technical integration.\nSupports future LXP implementation.L&D administrationMaintains and contributes to L&D standard operating processes and tools.\nManages face-fo-face (virtual and in-person) event administration from beginning to end.\nMonitors cancellations and no-shows\nAnalyzes evaluation results and reports on feedback.\nManages measurement/reporting dashboards for L&D team and stakeholders (e.g. VVN, Risk & Compliance, HRBPs)\nSupports the CPD/CPE credit administration and reporting process.We are looking for someone who is excited to work in Learning and Career Development and truly wants to be part of creating an extraordinary experience for our people.3+ years' experience in managing learning tools.\nWorkday Learning experience is strongly preferred.\nYou are organized, methodical and have superb attention to detail.\nYou enjoy taking ownership and completing tasks to a high standard.\nYou work well remotely and in a global team, located across multiple time zones.\nYou enjoy a challenge and thrive in a fast-paced, dynamic environment.\nYou have strong interpersonal and collaboration skills. You are a clear communicator and can confidently influence without authority.\nYou are committed to developing your own skills and enabling others to grow.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}