{"Job ID": "69873254", "Description": "Secretarial Responsibilities:\n\ni. Various compliances of Registrar of Companies, SEBI, RBI etc.\n\nii. Work relating to Incorporation of Companies, Change of Name of Company, Change of Articles, Memorandum, Change of registered office etc.\n\niii. All day to day working of secretarial compliances of listed & unlisted companies Preparation of Directors- Report, Management discussion Analysis, Annual Return and filing  .\n\niv. Preparation & filing of various forms, documents with under the Companies Act Drafting of- resolutions, Notice, Agenda & Minutes & updation of statutory registers and records.\n\nv. Correspondence and General Liasioning with ROC, Government Authorities etc.\n\nvi. Handled payment of dividend to large number of shareholders and the entire work relating to dividend payment such as co-ordinating with RTA, - Banks - and shareholders.\n\nvii. Conducting board meeting, committee meetings and shareholders- meeting independently.\n\nviii. Transfer of unpaid/unclaimed dividend and shares to IEPF Authority Providing necessary functional & operational support to other departments.\n\nix. Managing and conducting all the board meetings of Co ,there-by supporting the Board in all the Board matters.\n\nLegal Responsibilities ( Litigation and Non- Litigation):\n\ni. Drafting and vetting of Agreements, Contracts, MOUs, NDAs for business transactions.\n\nii. To take lead in Negotiations with Customers for finalization of contracts.\n\niii. To provide- pro-active legal support and advice to the business units and key stakeholders, and to assist them in achieving their core strategic objectives.\n\niv. To provide Risk Management Analysis along with the Mitigation Principles.\n\nv. To take lead and ensure Legal compliances. Interacting and supporting the cross-functional teams internally, including Business Heads, as well as Liasioning with external advocates.Key Skills:\n\n- Should have dealt with the Board Members and conducted Board Meetings for at least the last 3 years.-\n\n- Should be fully conversant with the Companies Act and the Listing requirements of SEBI and all recent amendments to both.-\n\n- On the legal side, Candidate should have  experience of reviewing and advising on Customer contracts and Supplier agreements. Ability to review the contracts with the object of Risk Mitigation and identifying Negotiating points will be a great advantage. In other words, a commercial bent of mind will also be a great advantage. -\n\n- Experience in handling court cases, real estate matters, foreign subsidiaries, banks, etc will be an added advantageJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Pune, India", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}