{
    "Job ID": "69873577",
    "Description": "Careers that Change LivesWe are looking for a competitive and trustworthy Sales Supervisor to help us build up our business activities. You will be responsible for to prepare & implement Business strategic blueprint for the assigned region. One Should have strategic experience and managed multiple territories. Distributor onboarding, Management, maintaining DSO as per business requirement.To achieve sales targets, increase market share, drive secondary sales focus and ensure alignment of organizational objectives and Engage and motivate Territory and Area Manager on their performance against goals, mentor and develop the subordinates to ensure that everyone is performing as per objectives. On job Technical & Product training for sales executives. We value what makes you unique. Be a part of a company that thinks differently to solve problems, make progress, and deliver meaningful innovations.A Day in the Life·Focus and lead the sales team on delivering value for customers ensuring no compromise in case supports.·Reinforce and promote Medtronic’s core mission, vision, values and Code of Conduct and Demonstrate Medtronic traits in Day to day work.·Ensure timely reporting from Territory & Area Managers, Channel partners pertaining to key parameters like Secondary sales, Market Share data, and distribution issues and Marketing initiatives.·Responsible for achieving primary and secondary AOP in terms of product units and revenue.·Prepare accurate monthly/quarterly/annual sales plan and meet the planned AOPs.·Ensure the sales teams are driving the value proposition so that the Average Selling Prices are protected, thereby delivering better margins for the products.·Exceed sales plan & increases market share while managing expenses within budget.oResponsible for forecasting the Sales trend for the future.·Maintain and expand existing DBS business and develop new business opportunities for Pain and Pelvic therapy.oTo develop strategies around divisional objectives and drive implementation in the region.oDrive growth across basic & advance product portfolio by identifying barriers to therapy and planning initiativesto overcome the sameoIdentify, establish and maintain good working relationship with key decision makers, customers and channel partners as external stakeholders.oWork closely in terms of engagement with Key decision makers and influencers within the region.Must Have – Minimum Requirements·BE/ Any Science Graduate·PG degree in Business Management is preferred·Minimum 8 to 12 Years of Experience in Sales or Business Development role in Medical Devices.·Prior experience in managing Diabetes products sales·Experience of handling a Concept selling based Therapy·Exceptional interpersonal skills.·Computer literacy including sound knowledge of the MS Office suite of software.·Willing to travel extensively·Ideally demonstrated success in a sales function of technical equipmentNice to Have·Excellent communication and interpersonal skills: Good verbal communicator and presenter·Professional presentation and \"Presence\"·Can work autonomously but is also a team player·Self motivated and positive·Outgoing and friendly:Enthusiastic, energetic·“Can do” attitude·Ability to quickly establish credibility with all levels of customer base·Good time manager:Well organized, able to set and reset priorities·Willingness to learn, especially technical informationPHYSICAL REQUIREMENTS:\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers.ABOUT MEDTRONICTogether, we can change healthcare worldwide.  At Medtronic, we push the limits of what technology can do to help alleviate pain, restore health and extend life.  We challenge ourselves and each other to make tomorrow better than yesterday.  It is what makes this an exciting and rewarding place to be.We can accelerate and advance our ability to create meaningful innovations – but we will only succeed with the right people on our team.  Let’s work together to address universal healthcare needs and improve patients’ lives.  Help us shape the future.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}