{
    "Job ID": "69874514",
    "Description": "Supporting the tender manager on financial aspect, providing input to negotiations on commercial issues and input in local risk review process\nProviding input to the Project Execution Plan on financial aspects, preparing project invoices, financial accounting and reporting (including project site accounting). Drive and seeking for optimization of Project Cash Flow, Revenues and GM contribution together with Project Director overseeing currency risk, bonds and guarantees and tax issues. Is responsible for the correctness of project balance sheet and income statement as well as for cash flow and monthly/quarterly forecast\nParticipating in opportunity/risk identification, monitoring that all required mitigation actions are timely implemented, joint responsibility with the Project Manager for all Financial aspects of the project including estimate at completion and related Cost-to-complete, forecasted Revenues and Cash Flow, Risks and opportunities assessment and ensure alignment with other functions including Project Controls, planning/scheduling\nSupporting the Project Manager in coordinating and preparing monthly project reviews, participating in preparing the project cost report and verifying the substance for cost to complete. Providing support on claim management, back-charges and insurance cases and monitoring the proper follow up together with the Contract Manager/Project Manager up-stream (towards customer), side-stream (towards consortia partner) as well as down-stream (towards suppliers)\nSupporting the Project Manager in adherence to: corporate governance, integrity, assurance, internal control, group charter, business specific finance directives and instructionsBachelor's degree in finance or accounting field.\nMinimum 4 years of experience in a similar role is required.\nHigh level of business acumen and strong understanding to the industry and business segment.\nExceptional written and verbal communication skills, with fluency in English & Arabic.Retirement planJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Cairo, Egypt",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}