{"Job ID": "69873024", "Description": "JLL supports the Whole You, personally and professionally.Our people at JLL are shaping the future of real estate for a better world by combining world class services, advisory and technology to our clients. We are committed to hiring the best, most talented people in our industry; and we support them through professional growth, flexibility, and personalized benefits to manage life in and outside of work.  Whether you’ve got deep experience in commercial real estate, skilled trades, and technology, or you’re looking to apply your relevant experience to a new industry, we empower you to shape a brighter way forward so you can thrive professionally and personally.Portfolio Strategy and Transactions Financial AnalystWorkplace DynamicsThe role is part of a dedicated JLL team that works with one of our most dynamic & fast-growing Clients in the technology sector. JLL partners with the Client to deliver a wide range of corporate real estate services.Portfolio Strategy supports the Client with strategic decisions with regards to their corporate real estate office portfolio. It is a very dynamic function, as we work closely with multiple stakeholders from various parts of the organisation across the globe. We collect inputs and data from multiple sources, analyse and ultimately produce the strategic recommendations to our Client.The analyst will join the GREF Finance team to support with data gathering, validation and analysis required for our strategy and transaction recommendations. The analyst will work collaboratively with the Portfolio Strategy and Transaction Management teams, whilst also frequently engaging with the other real estate functions, such as Occupancy Planning and Design & Construction.The analyst will mainly be responsible for undertaking financial analysis and portfolio strategy analysis to support strategy papers, and also deliver workbooks to support spend approval documents. Additionally, the analyst will support development of new tools, reports and processes for the team.What this job involves:Gathering, evaluating and validating real estate data, ensuring correctness and completeness\nEngaging and cooperating with various internal teams to collect portfolio information, data and relevant metrics\nUndertaking financial analysis to support key strategic decisions, including cashflow, NPV and P&L modelling\nPreparing scenario analysis and other portfolio strategy analysis to support the production of strategy papers\nWorking closely with the Transactions Management team to produce financial workbooks for internal real estate spend approvals\nDeveloping new tools, processes and reports, to ensure we are consistently improving the quality of our analysis and deliverables to the Client\nPreparing Client-facing documentation, including Excel reports and PowerPoint presentationsEvery day is different, and in all these activities, we’d encourage you to show your ingenuity.Sound like you? To apply you need to be / have:Fluent in English\nA Bachelor’s degree, with a focus in Real Estate, Economics or Finance desired\n2-5 years of work experience (real estate industry experience is not necessary, but it will be a plus)\nProficient in MS Excel, Word, and PowerPoint. Power BI, Smartsheets and Tableau proficiency desired\nStrong communication skills (experience in stakeholder engagement and management will be a plus)\nCreative, but also highly analytical, pragmatic and detail oriented\nCurious mindset, eager to learn, with the ability to see the big picture and think outside the box\nTeam oriented, enthusiastic about working collaboratively with other team members to achieve the best outcomesWhat you can expect from usYou’ll join an entrepreneurial, inclusive culture. One where we succeed together, across the desk and around the globe. Where like-minded people work naturally together to achieve great things.Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay.Join us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sights and imagine where JLL can take you...JLL is an Equal Opportunities Employer and encourages applications from all sections of the community. Apply today!Location:If this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements.  We’re interested in getting to know you and what you bring to the table!About JLL –For over 200 years, JLL (NYSE: JLL), a leading global commercial real estate and investment management company, has helped clients buy, build, occupy, manage and invest in a variety of commercial, industrial, hotel, residential and retail properties. A Fortune 500® company with annual revenue of $20.9 billion and operations in over 80 countries around the world, our more than 103,000 employees bring the power of a global platform combined with local expertise. Driven by our purpose to shape the future of real estate for a better world, we help our clients, people and communitiesSEE A BRIGHTER WAY. JLL is the brand name, and a registered trademark, of Jones Lang LaSalle Incorporated. For further information, visitjll.com.JLL Privacy NoticeJones Lang LaSalle (JLL), together with its subsidiaries and affiliates, is a leading global provider of real estate and investment management services. We take our responsibility to protect the personal information provided to us seriously. Generally the personal information we collect from you are for the purposes of processing in connection with JLL’s recruitment process. We endeavour to keep your personal information secure with appropriate level of security and keep for as long as we need it for legitimate business or legal reasons. We will then delete it safely and securely.For more information about how JLL processes your personal data, please view our Candidate Privacy Statement.For additional details please see our career site pages for each country.For candidates in the United States, please see a full copy of our Equal Employment Opportunity and Affirmative Action policy here.Jones Lang LaSalle (“JLL”) is an Equal Opportunity Employer and is committed to working with and providing reasonable accommodations to individuals with disabilities.  If you need a reasonable accommodation because of a disability for any part of the employment process – including the online application and/or overall selection process –  you may contact us at Accommodation Requests. This email is only to request an accommodation. Please direct any other general recruiting inquiries to our Contact Us page > I want to work for JLL.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}