{
    "Job ID": "69873496",
    "Description": "Director, Program Management - Chennai, IndiaREFID948699So where do you fit here? NIQ technology projects, like our clients, span the globe and require managers that can connect the dots for the big-picture strategy. We are building out our Program Management organization to consist of highly motivated, analytical, and dynamic individuals to achieve our goals in Product, Technology, and Operations.As a Program Director at NIQ, you will be part of this organizational transformation as you drive and directly oversee our largest, most complex programs. You will not only lead complex, high-visibility initiatives throughout the project lifecycle, but will also lead a team of program managers responsible for program execution. Your team’s projects will cut across time zones, clients, and technologies and it is your job to motivate, allocate work, manage execution, and communicate to senior stakeholders.At NIQ, we empower our Program Management team to drive results and change. If you thrive in high-energy environments, and if you love the idea of working across every business function, you would be a great fit for our team!RESPONSIBILITIES:● Facilitate cross-team prioritization between Stakeholders and Technology teams in order to create release plans and continue to manage throughout the program lifecycle● Allocate work to and provide coaching to program managers or program leads● People management responsibilities for a team of 4-8 program managers or program leads● Define and roll out program management processes, best practices, and tools to theorganization● Responsible for the execution of portfolio and program deliverables and tracking of program health● Manage portfolio and program scope (documentation, change control, communication)● Facilitate conversations to ensure Cross Functional Team Dependencies are planned, identifying gaps, and mitigating risks● Track and communicate program objectives and progress to upper management and stakeholders (Program Status, Initiative level Jira Boards, and/or Kanban)● Facilitate weekly Portfolio meetings or Scrum of Scrum meetings as needed & execute release level retrospectives● Track and ensure prompt resolution of issues; manage risk● Ensure production readiness (Sign-offs & Documentation)● Ensure the execution of end-to-end software deployments across technical teams is driven by the program team● Use and drive Agile and SAFe methodologies● Communicate agile team metrics & drive compliance to Technical Leads● People Management – Provide career guidance, evaluate performance. Work with HR to mitigate any open resource requirements● Aid with driving program and/or business unit financials• 15+ years in program and project management or similar role running large projects in operations, technology or engineering• 9-10 years in a leadership role, running large scale initiatives and providing strategic direction• 7+ years of people management responsibilities• Practical experience with agile techniques and methodologies• Superior communication skills (interpersonal, verbal, presentation written, email)• Proven ability to influence & gain buy-in at multiple levels, across divisions, functions, and cultures• Comfort working with senior-level management and virtual teams• Ability to prioritize, manage, and deliver on multiple projects simultaneously; highly motivated and able to work against aggressive schedules• A strong bias toward action, flexible, resourceful, and able to operate effectively within a dynamic, fast-paced environment• You are the glue of a happy, high-performing, cross-functional team• Positive attitude, team player, self-starter; takes initiative, ability to work independently• Preferred: data warehousing or data science experienceEDUCATION:• Bachelor's degree in business, computer science, or related field• Scrum Alliance certifications (i.e. CSM, CSPO, etc.) preferredEnjoy a flexible and rewarding work environment with peer-to-peer recognition platforms. \nRecharge and revitalize with help of wellness plans made for you and your family. \nPlan your future with financial wellness tools. \nStay relevant and upskill yourself with career development opportunities. About NIQNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™.NIQ, is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com.Want to keep up with our latest updates?Follow us on: LinkedIn | Instagram | Twitter | FacebookOur commitment to Diversity, Equity, and InclusionNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us.We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide.Learn more about how we are driving diversity and inclusion in everything we do by visiting the NielsenIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion/NIQ or any of our subsidiaries will never ask you for money at any point of the recruitment or onboarding process.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Chennai, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}