{"Job ID": "69872911", "Description": "Ensuring coverage of claims, guiding staff for correct use age of claim forms, approval papers. \nGetting approval for medical procedures.\nCoordinating with insurance companies for obtaining information on new policies and their coverage.\nExplaining coverage of medical benefits to patients when required.\nAssisting invoicing department in insurance processing and billing.\nEntertains patient queries regarding their eligibility and entitlement.\nEntertains patient’s quires regarding unpaid balance.\nChecking insurance card for details like (Card No, Policy No, Network coverage, validity and member benefits) \nResponsible for filling and tracking insurance claims and informing patients of their claims status. \nPrepares insurance forms and associated correspondences. \nCoordinating, liaise with insurance companies regarding eligibility, payments, approvals, reconciliation and other requirements.\nTo liaise with patients regarding their eligibility and entitlements. \nTo maintain strict confidentiality related to medical record and other data.\nTo coordinate and co-operate with colleagues of the same department and other related departments for smooth running of Insurance operations.\nAttending OSH programs of BIH as a mandatory requirement.\nComplies with all OSH policies, procedures and legal requirements regarding OSHMS.\nConducts his/her task in a healthy and safe manner at all times.\nReport any untoward events that will impact the occupational, safety & health of patients, staffs, contractors, facilities, operations, etc.\nAll employees are personally accountable for their actions and are responsible for ensuring that they comply with infection prevention and control policies. \nHealth care workers are responsible for identifying infectious conditions that require specific controls to protect themselves and their patients. In addition, they are responsible for notifying the infections prevention department.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}