{
    "Job ID": "69876232",
    "Description": "About VERITASVeritas Technologies solves what no one else can. As the leader in secure multi-cloud data management, over 80,000 customers – including 91% of the Fortune 100 – rely on Veritas to help ensure the protection, recoverability, and compliance of their data.Veritas has a reputation for reliability at scale, which delivers the resilience its customers need against the disruptions threatened by cyberattacks, like ransomware. No other vendor is able to match Veritas’ ability to execute, with support for 800+ data sources, 100+ operating systems, 1,400+ storage targets and 60+ clouds through a single, unified approach. Powered by Cloud Scale Technology, Veritas is delivering today on its strategy for Autonomous Data Management that reduces operational overhead while delivering greater value. Learn more at Veritas.com.Veritas Global Security OfficeGroup: Global Physical Security (GPS)Role: Sr Physical Security SpecialistJob Title(s): Program Manager, Global Security SystemsReports to: Head of Global Physical SecurityHighest Level Responsibilities:Identify and protect the company from tactical and strategic risk\nAct as trusted professional security and safety advisor to the Veritas Global Physical Security management\nManage the Veritas Global Physical Security Systems Program and other Corporate Security programs in coordination with the Head of Global Physical Security\nDevelop and cultivate strategic relationships with internal and external stakeholders to consistently deliver high quality solutions to company staff and leaders  Accountable For:Day to day physical security systems management at all Veritas offices and facilities globallyMonitoring and assessing the performance of the global physical security systems (Genetec, Avigilon, Alert Enterprise)\nManaging a global systems budget, vendor relationships, and reporting metrics\nProviding first-level systems support to Veritas staff and team members\nAnalyze global security systems architecture and processes to identify critical gaps and strategic value opportunities\nWorking in a fast-paced environment to deliver world-class, consistent, quality, and customer focused security products and services\nCoordinating and facilitating the operations and initiatives of the Veritas Global Physical Security organization\nEnabling Veritas regional leadership and business teams by providing trusted professional resources and subject matter expertise in risk management, security systems, security design principles\nCommunicating and collaborating among cross-functional teams in a multi-national environment\nParticipating in and leading cross-functional teams inside and outside GPS to increase security effectiveness and awareness and to drive value to the Veritas businessQualifications:Bachelor’s degree or equivalent experience in a relevant field (security system integrator, security, criminal justice, electrical engineering, etc)\nExpert-level customer service skills\nExpert-level project management skills\nAbility to speak fluently in English\nKnowledge and experience with business tools (e.g. MS Excel, Word, PowerPoint, Project, Visio, Adobe, AutoCad, etc); procurement processes and tools (e.g. Oracle)\nExperience managing Genetec, Avigilon, and Alert Enterprise is preferredWorking at Veritas\nNearly 90% of Fortune 500 companies already use Veritas core solutions and these solutions catalogue the 1.5% of target rich data today. Veritas helps customers transform their data into information, and those insights into competitive advantage. At Veritas, you will enjoy an open, flexible, and supportive environment which lets you bring your ideas to life. Our commitment to development and diversity sparks innovation.\nIf impact, innovation and a winning culture are important to you, consider a career at Veritas.At Veritas, we care about the causes close to your heart and enable you to volunteer, donate, and do good. If you only meet some of the asks for this role, that's OK! We value a diverse range of backgrounds and ideas and believe a more diverse and inclusive workforce makes a winning team. If you have the curiosity to learn and appetite to teach what you know, we encourage you to apply. Come as you are! Interested? Apply and find out more about #TeamVeritas!Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}