{
    "Job ID": "69873187",
    "Description": "Req ID:[[435395]] We create smart innovations to meet the mobility challenges of today and tomorrow. We design and manufacture a complete range of transportation systems, from high-speed trains to electric buses and driverless trains, as well as infrastructure, signalling and digital mobility solutions. Joining us means joining a truly global community of more than 75 000 people dedicated to solving real-world mobility challenges and achieving international projects with sustainable local impact.  Job Title :Trainlab Engineer (TLE) Tier3  (EN-VR-14_003)Purpose of the Job: To manage design, development and implementation of Test platform configurations for validation needs.Position in the OrganisationOrganisation ReportingHierarchical manager:RS Trainlab ManagerNetwork & LinksEDU Leaders\n Train Validation Engineer (TVE)\n Train System Engineer (TSE)\n Train Control Engineer (TCE)\n Train Design Engineer (TDE)\n Train Electrical Engineer (TEE)\n Validation and Test Engineer (VTE)\n Software Development Engineer (SDE)MissionsPerformance Measurement/KPI’sQuality of his/her delivery (included sub-contractor delivery)\n100% on time delivery\nLevel of application of standard Methodologies and Processes:\nContinuous improvement or Return on Experience (RoE) management from previous projects:ResponsibilitiesTo define the Test platform architecture required for validation needs\nTo coordinate the development and validation of Train Electrical schematic models, Train subsystem models etc.\nTo prepare TrainLab configuration with Hardware in Loop (HIL) , Software in Loop (SwIL) or Model in Loop (MIL) approach\nTo Validate  TrainLab configuration\nTo coordinate Hardware development of Test platforms - Integration and Network Configuration .\nTo coordinate the Implementation of Automation Tools with Python, NI Test stand etc.\nTo implement Configuration Management and documentation management,\nTo prepare planning documentation and manage projectsJob SpecificationsKnowledge & Experience:Educational Requirements: - B.E/B.Tech. or M.E/MTech - Electrical/Electronics/Mechanical/Instrumentation/Aerospace etcTechnical Knowledge / ExperienceExperience (Min 2 years) in the development of Test platforms with Hardware-in Loop (HIL), Software-in Loop (SwIL) methodologies, System modelling and Simulation expertise, Test Automation .\nExperience in any communication protocols will be an added advantage\nSkill set - Matlab/Simulink, Labview, NI Test stand,Python,C/C++ etc.\nExperience in Test Rack development (Design, Integration and comissioning )Team size: Individual ContributorInnovation: Patents etcAn agile, inclusive and responsible culture is the foundation of our company where diverse people are offered excellent opportunities to grow, learn and advance in their careers.  We are committed to encouraging our employees to reach their full potential, while valuing and respecting them as individuals.   Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}