{"Job ID": "69873133", "Description": "Job Description:Job Title: Data Governance SpecialistLocation: Pune, IndiaRole Description:The given role will help design, improve and effective implementation of DB’s Data Management framework across the bank. The role involves delivering value in key areas like data governance, data quality and controls, data lineage and compliance metrics and KPIs by leveraging innovative thinking, data governance technologies and automation of workflows.What we’ll offer youAs part of our flexible scheme, here are just some of the benefits that you’ll enjoyBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and aboveYour key responsibilities:Design standards, improve processes and monitoring approach to strengthen DB’s Data Management frameworks and to facilitate their implementation in an efficient way by divisions across the bank.\nDesign and deliver KPIs and reporting capabilities that drive improvement of the bank’s data landscape, and provide value-added insights that identify opportunities for innovation and improvement.\nProvide expert and considered advice to stakeholders across the bank on how to implement the bank’s data management framework, on topics such as data governance, data lineage, data quality and controls, and data sourcing.\nProvide reporting, metrics and content updates to relevant data governance forums.\nDesign and implement automated methodology to capture end to end lineage and tag flows to scope\nDesign and implement methodology to capture additional metadata associated to Authority sources to identify strategic vs. non strategic sources utilized for sourcing data\nDesign and implement methodology to track progress against planned Data Management gap closure plans from Divisions with drill down capabilitiesYour skills and experience:10+ years’ strong experience in the area of data management, data lineage, data quality, regulatory compliance\nExperience with tools like Collibra, Solidatus\nStrong problem solving and analytical skillsHow we’ll support youTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needsAbout us and our teamsPlease visit our company website for further information:https://www.db.com/company/company.htmOur values define the working environment we strive to create – diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer.We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation.Visit Inside Deutsche Bank to discover more about the culture of Deutsche Bank including Diversity, Equity & Inclusion, Leadership, Learning, Future of Work and more besides.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}