{
    "Job ID": "69873234",
    "Description": "Job DescriptionPhilips is a global leader in health technology, committed to improving billions of lives worldwide and striving to make the world healthier and more sustainable through innovation. Driven by the vision of a better tomorrow.But it’s not just what we do, it’s who we are. We are 80,000, wonderfully unique individuals, with two things in common. An unwavering sense of purpose and a relentless determination to deliver on our customers’ needs. It’s what inspires us to create meaningful solutions – the kind that make a real difference – when it matters most.The world and our customers’ needs are changing faster than ever before and while we are proud of what we do already, we know we can do more. That’s why we need you, to help us tackle increasingly complex challenges posed by ever evolving health and well-being needs.In this role, you have the opportunity to make life betterLooking at the challenges the world is facing today Philips’ purpose has never been more relevant. So whatever your role, if you share our passion for helping others, you’ll be working towards creating a better and fairer future for all.You will be part of the Philips Group Tax team.You will be responsible toLead planning and expeditious resolution of Tax matters relating to Corporate Tax, Transfer Pricing\n\nLead Merger & Acquisition and restructuring projects of the Company\n\nEnsure Tax and regulatory compliance, including Corporate Income Tax, Transfer Pricing and TDS\n\nResponsible for all Tax assessments, Appeals and Transfer Pricing litigation with authorities\n\nDeliver and implement tax saving initiatives to create long-term value for Philips\n\nDeploy tax strategy, processes, Transfer Pricing policies and guidelines for Philips\n\nAdvise local management in close alignment with Group Tax on all tax-related matters, including Transfer Pricing and tax efficient cash management\n\nShould be a team player and be able to interact and influence on technical matters\n\nInitiating / supporting automation of tax processes at every opportunity where new IT systems are being implemented\n\nEnsure first time right Tax Accounting and Reporting\n\nShould be able take up tax technical matters in the various industry forums and make representation to the govt bodies\n\nMonitoring all relevant tax developments and strategize the impact on the Company’s business and update all the amendments related to direct tax to various stakeholders\n\nMonitoring of all cross border transactions and analyse various tax treaties to assess applicable taxTo succeed in this role, you’ll need a customer-first attitude and the following:Chartered Accountant with at least 12 years’ relevant experience\n\nKnowledge and working experience of Direct with any large MNC\n\nShould be a team player and be able to interact and influence various teams on technical matters.\n\nShould be able take up tax technical matters in the various industry forums and make representation to the govt bodies.\n\nEssential attributes:\n\nGood at communication (written/verbal)\n\nGood at interpersonal relations\n\nGood team player\n\nGo getter.In return, we offer youWork life balance with lot of learning, collaborating with team across market.Our hybrid working model is defined in 3 waysWe believe in the importance of impactful collaboration: There's a certain energy when everyone’s in the same room that can heighten idea generation and creative friction needed for problem-solving.We embrace flexibility: Choosing where, when and how to work can vary according to task and team schedules. Flexibility isn’t office or online, it means choosing the space that works best for you, your teams and our customers on a case-by-case basis.We want to be at our best: The way we work and our workspaces are designed to support our well-being, offer career advancement opportunities, and enable us to be at our best.How we work at Philips There are three core ways that define our ways of working – embracing flexibility, being at our best, and impactful collaboration. We believe this enables us to deliver an outstanding experience to our customers and create the best place to work for people who share our passion.We know just how important direct interactions are and work is more engaging when we are more frequently face-to-face, and that we experience better collaboration which drives innovation. While we have many different types of roles across Philips most require a combination of in-person collaboration with colleagues and partners, usually at a Philips location, and individual focus time, which can be done remotely.Why should you join Philips?Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on innovative, customer-first health technology solutions. Help us improve the health and well-being of billions of people, every year. Ultimately creating a career that no one could have planned for. Even you.Visit our careers website to explore what it’s like working at Philips, read stories from our employee blog, find information about our recruitment process and answers to some frequently asked questions.#L1-PHILINJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}