{
    "Job ID": "69873335",
    "Description": "Req ID:435407 Leading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwide JOB TITLEPI Engineer  IN-ES-03-001PURPOSE OF THE JOBProvides field engineering leadership, assist and support to projects & PI team for investigation, troubleshooting and resolution of technical/quality issuesORGANISATIONOrganization structure (job belongs to..)Product Introduction Management of Site, Country, Cluster, Region or PlatformReports directly to:PI Customer Site ManagerOther reporting to:Project PI Manager within project organizationDirect reports:noneNetwork & LinksInternalParticipating Units and/or Subsystem Managers\nCustomer Site PI team\nPI Support team (Back-office)\nRAMS team\nProject Engineering team\nQuality team (mainly PrQSM and SQ)\nInstallation and Test & Commissioning team (if applicable)\nInternal Supplier representatives (Components/PU)\nSourcing and Contract Manager\nIntegrated Service Readiness (ISR)\nMaintenance/Service team (if Alstom)\nGlobal System representatives (if applicable)ExternalTrain drivers\nCustomer site team\nCustomer maintenance team (if not Alstom)\nExternal SuppliersMAIN RESPONSABILITIES  Key accountabilities:Support any technical activity on Alstom products during PI period as well as Commissioning, Warranty (and Validation & Certification phase if applicable)\nDiagnoses cause of malfunction/failure of operational equipment and recommends preventative and corrective actions\nDefine troubleshooting methodology\nProvides technical guidance and supports technicians in troubleshooting and repairs\nProvides feedback on technical documentation deficiencies.\nAdvises PI management regarding customer satisfaction, product performance, and suggestions for product enhancements\nDrive Kx (8D) issues with Quality and internal & external Suppliers as support of PrPIM\nEnsure completeness and quality of input to Failure Management data base for RAMS exploitation\nDrive Reliability Growth through failure/event investigation and reliability forecast implementation (with RAMS support).\nDrive and support containment to avoid reoccurrence of failures\nSupports as-maintained Alstom product configuration control and relevant documentation management\nSupport technical reviews with internal and external Suppliers, partners, customers, authorities\nEnsure & facilitate information flow within the PI Customer Site, PI functions and project teams. Provides status and transparence on PI activities, key technical issues, to PrPIM.\nApply EHS requirements on site with the support of EHS team representatives\nDrive technical Return of Experience/reporting/feedback as support of PrPIM\nSupport Obsolescence Management (if applicable)\nSupport preparation and implementation of Field Modifications (FM)Performance measurements:Achievement of contractual reliability (milestone) targets\nAchievement of contractual availability (milestone) targets\nContainment and solution of K1S/K2/K3 issues on time\nCompleteness and Quality of failure/event diagnosis/data and relevant documentation\nReliability improvement after FM implementation\nAchievement of PI Dashboard\nAchievement of configuration updates\nAchievement of REX implementation\nAudit results (internal and external)\nCompliance with EHS rules and work-related processesMAIN REQUIRED COMPETENCESMandatory:Graduate in Engineering or Industrial (“Internal Graduation” (“cadre interne” in F) acceptable)\nInternal EHS training\nEnglishDesirable:Master’s degree in EngineeringExperienceJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Kanpur, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}