{
    "Job ID": "69873333",
    "Description": "Company DescriptionAt AECOM, we’re delivering a better world.We believe infrastructure creates opportunity for everyone. Whether it’s improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive.Our clients trust us to bring together the best people, ideas, technical expertise and digital solutions to our work in transportation, buildings, water, the environment and new energy. We’re one global team – 47,000 strong – driven by a common purpose to deliver a better world.Here, you will have freedom to grow in a world of opportunity.We will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.We will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.We offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.When you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.Job DescriptionDevelop and implement a testing and commissioning plan for projects or systems.\n\nDefine objectives, scope, and schedule.\n\nCreate detailed test procedures and protocols.\n\nSpecify testing equipment, tools, and resources required for the process.\n\nEnsure that testing methods comply with industry standards and regulations.\n\nOversee and coordinate testing activities on-site.\n\nIdentify and resolve issues, defects, or deviations from standards.\n\nMaintain detailed records of testing and commissioning activities.\n\nPrepare test reports, commissioning documentation, and compliance certificates.\n\nImplement quality control procedures to ensure that systems meet specified standards.\n\nEnsure that all testing and commissioning activities adhere to legal and safety requirements.QualificationsPrevious experience in overseeing and managing Testing & Commissioning MEP projects construction of major projects t\n\nMinimum 15 years experience\n\nDegree educated in a relevant disciplineAdditional InformationAbout AECOMAECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM.Freedom to Grow in a World of OpportunityYou will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.All your information will be kept confidential according to EEO guidelines.ReqID: J10054061Business Line: Construction ManagementBusiness Group: DCSStrategic Business Unit: ME and AfricaCareer Area: ConstructionWork Location Model: Please SelectJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Saudi Arabia",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}