{
    "Job ID": "69872505",
    "Description": "The Project Controls Lead will reports to the Managing Director and a functional reporting line to the Regional Data Analytics & Assurance Director (DAAD) and as a member of the Senior Leadership Team (SLT) of the PD&E business.  The role is focused on:Project Controls – Schedule, Cost, Risk & Earned Value Management\n\nOperations & Governance\n\nResource ManagementThey will drive the strategy process and then monitor the delivery of the strategy against forward-looking KPIs as part of a balanced scorecard using a data-driven approach. This will be a centralized role. However, it could be based in any Middle East office. The successful candidate will be responsible for, but not limited to:Project Controls:Oversees the direction of the project controls team within PD&E.\n\nDevelops and maintains the project control system for the PD&E business that includes but is not limited to:\n\nDevelopment of L1, L3 & L5 schedules\n\nCost forecasting\n\nIntegration of cost & schedule through earned value\n\nRisk & Opportunity management\n\nDevelopment of the Engineering Progress & Performance Reporting (EPPR) System\n\nManages staff coordination and workload and directly supervises project controls team.\n\nTracks and analyses the project costs, including budgets, commitments, actuals, accruals, and forecasts.\n\nAssists in analysing project control requirements as part of the bid review process to ensure all requirements are incorporated.\n\nSupports the development of the earned value management system\n\nProvides senior level, project management support as necessary (e.g., financial/operational budgeting, consolidation, analysis, forecasting; business development; pricing; billing; key client/consultant relationship management).\n\nCarry out all required duties of that of a supervisor, Performance management etc.\n\nAlign the management of the P, D&E project controls job family with the DAAD.\n\nLiaise with (or manage) quality assurance process in relation to design delivery.  Work with relevant departments to provide oversight of BMS implementation.\n\nGenerally implement and promote a data driven culture to improve business and project performance to support EBIT growth in region.\n\nWork with the MD, DAAD and Business Unit Leads to implement strategy & promote a culture of collaboration;Define the strategy and lead the design and implementation of a common project management methodology, standards and tools to drive and facilitate the successful delivery of projects\n\nMonitor and report against strategic plan and actions;\n\nIn conjunction with Business Unit Leads, continually assess priority markets and services to position short and long terms growth;\n\nContribute positively as a member of the PDE SLT and support Managing Director on any other strategic matters.\n\nSupport the execution of project governance, reporting and review framework to provide a holistic view of all organisational programme activity.\n\nManage interdependencies and coordination across projects within the business to ensure that information relating to project deliverables, risks and issues are effectively communicated between stakeholders and that KPIs are monitored and evaluated.\n\nIdentify and define the major strategic issues for the organisation and integrate diverse stakeholder interests with the broader agenda to inform the development and prioritisation of initiatives and to proactively understand and mitigate risks.\n\nDefine governance strategies and organisational policies to enable the strategic coordination of multiple projects and initiatives to improve the efficiency and effectiveness of projects.Resource Management:Work with practice leads in maintaining a consistent system for resource management.\n\nSupport the Business Unit Leads and GTC (offshore design office in India) in maintaining a resource look ahead based on hard backlog & pipeline work\n\nMonitor the deployment of staff to projects in conjunction with business unit leads & practice leads.\n\nDrive a utilisation culture, and ensuring we have staff deployment accurately planned\n\nConsider bidding effort and input requirements working with business and practice leads.Commercial Reporting & Finance InterfaceWork closely with finance team to ensure commercial and project performance measure are aligned and feed into financial reporting.\n\nWork with PD&E finance director to establish business unit and department cost breakdown structures that drive business reporting\n\nWork with finance to measure and ensure continue improvement to project and business performanceRelevant experience & QualificationsBachelor’s Degree level or equivalent professional qualification\n\nMinimum of 15 years in project controls (Cost, Schedule & Risk)\n\nExpert problem-solving skills\n\nExpert presentation skills\n\nExpert in MS tools excel, including visual basic, access & PowerBi\n\nProficient in P6\n\nProficient in the set up of the Earned Value Management SystemsJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "United Arab Emirates",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}