{"Job ID": "69873036", "Description": "Business Unit:Company Details:Job Details:Job Summary: The Shared Services Manager II will be responsible for overseeing and optimizing all aspects of the center’s accounts payable, accounts receivable, and collections teams and will include managing a diverse team of managers and individual contributors, ensuring efficient delivery of high-quality services.  This role requires a deep understanding of accounting principles, strong leadership abilities, a continuous improvement mindset and a proven track record in managing diverse teams. This role is Hybrid, with US working hours. (2pm-11pm India).Essential Job Duties and Responsibilities:Team Leadership: Lead and mentor a team of managers and professionals fostering a collaborative and results-driven work environment. Provide guidance and support to team members, ensuring their professional growth and development.Operational Excellence: Coach the team to develop and implement streamlined processes and procedures to maximize efficiency and accuracy in accounting operations. Monitor key performance metrics and take proactive measures to meet or exceed service level agreements.Client Relationships: Build and maintain strong relationships with co-leaders understanding their unique needs and providing exceptional service. Act as the main point of contact for inquiries, addressing concerns and ensuring satisfaction.Performance Management: Co-own performance evaluations for team members, providing constructive feedback and setting performance goals.  Identify training needs and coordinate relevant training programs to enhance team capabilities.Continuous Improvement: Identify opportunities for process improvement and innovation, recommend and work closely with the leadership team to implement changes to enhance overall service quality and efficiency.Cross-functional Collaboration: Collaborate with other departments within CAO and Finance, IT,HR, and Legal to address operational and organizational needs.Minimum Job Requirements:Four-year college degree in Accounting or Finance with at least 7 years progressive accounting and shared services experience, 5 years in a leadership or managerial role\nStrong analytical and problem-solving skills, with the ability to make sound decisions under pressure. Excellent communication and interpersonal skills to effectively interact with clients, team members, and stakeholders\nManagerial experience to include managing managers as well as individual contributors\nPrior experience managing Accounts payable and accounts receivable is highly desired. along with demonstrated success in building and managing effective teams and experience building strong partnerships with colleagues, regional controllers and internal stakeholders\nAbility to identify areas of under-performance and agree plans to rectify\nDemonstrate experience of design and implementation of business process with a continuous improvement mindset\nDemonstrates influencing skills, able to problem solve and find effective and timely resolutions. Demonstrates excellent interpersonal skills with a willingness to share knowledge, coach and collaborate effectively with individuals and other departments\nStrong organization and planning skills with the ability to multitask and prioritize. Prior experience in a manufacturing environment and service-based organization are highly desirable. Proficient with Microsoft Office Suite or similar software, prior experience of SAP preferred but not essentialCondition of Employment:Successful outcome of a National Police Check and background check. The description provided above is not intended to be an exhaustive list of all job duties, responsibilities, and requirements.  Duties, responsibilities, and requirements may change over time and according to business need.Worker Type:Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}