{"Job ID": "69875832", "Description": "Expect more. Connect more. Be more at Diebold Nixdorf.  Our teams automate, digitize, and transform the way more than 75 million people around the globe bank and shop in this hyper-connected, consumer-centric world. Join us in connecting people to commerce in this vital, rewarding role.Position OverviewWe are looking for a Linux/AIX Specialist role who will be primarily responsible to take care of entire LINUX/AIX Infra and Administer/Maintain. Collaborate with other team members to develop automation strategies and deployment processes. You will become an integral part of the team, supporting escalations and solving them accordingly.You are responsible forDay to Day Linux Administration of OEL/Redhat/SUSE/IBM AIX servers.\nTake immediate action on identified vulnerable servers related to OS & Configurations. (SSH/TLS/CVE/JAVA/etc..)\nMaintain the Entire UNIX/LINUX Infra in Compliance with Security team Standards.\nDevelop and maintain key servers like Kickstart/Yum/Jumpservers\nStrong knowledge on Shell Scripting\nCoordinate with DC team to rack/stack H/W Cisco UCS, Dell, HP and replacement of failed hardware \nExpertise in installation, configuration and upgradation, patching, administration and storage implementation\nMonthly Patching of entire UNIX/LINUX infrastructure through Tanium Patch Management tool.\nServer Build and Migration of Physical and VM’s.\nKnowledge in Firmware upgrade and Hardware issue diagnosing\nWork on Projects\nExperience in Veritas Cluster\nUp-to-date technical knowledge by attending educational workshops, reviewing publications\nParticipate in 24X7 on call rotation.\nManage and administer AIX LPAR’s and HACMP environments.\nUpgrade AIX environments to latest patches and fix vulnerabilities.QualificationsDeep technical knowledge of Linux OS (IBM AIX, OEL, Rehdat, SUSE)\nStrong knowledge on H/W (Cisco UCS, Dell, HP).\nGood working knowledge on KS/Yum repository servers.\nSound knowledge on NFS/SAN in OS part.\nSound knowledge on Microsoft AD, LDAP, Azure AD and DNS\nSound Shell scripting knowledge\nSound knowledge of OS Security and compliance features\nSound knowledge on OS roles and licensing plans.\nGood communication and interpersonal skills\nAbility to work under pressure, with minimum supervision and proactively.\nSelf-driven, motivated, Preferred RHEL/Oracle Linux Certified.Preferred QualificationsShould be a Graduate in Computer/Electronics Stream.Why should you join Diebold Nixdorf?Brightest minds + technology and innovation + business transformation  The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce. Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability. –Diebold Nixdorf is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.** To all recruitment agencies: Diebold Nixdorf does not accept agency resumes. Please do not forward resumes to our jobs alias, Diebold Nixdorf employees or any other organization location. Diebold Nixdorf is not responsible for any fees related to unsolicited resumes**#LI-PS1Why should you join Diebold Nixdorf?Brightest minds + technology and innovation + business transformation  The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce. Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability.–Diebold Nixdorf is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.** To all recruitment agencies: Diebold Nixdorf does not accept agency resumes. Please do not forward resumes to our jobs alias, Diebold Nixdorf employees or any other organization location. Diebold Nixdorf is not responsible for any fees related to unsolicited resumes**We are a global Company operating in multiple Locations and Entities. As we are keen to find the best solution for our candidates several legal entities might be applicable for a Job offer. A List of our operating entities can be found here - https://www.dieboldnixdorf.com/en-us/about-us/global-locationsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}