{"Job ID": "69873127", "Description": "This position within Global Consumer Banking will develop CCAR/CECL models for unsecured portfolios (e.g., credit cards, installment loans, ready credit etc.)\n\nThe responsibility includes but not limited to the following activities:\nObtain and conduct QA/QC on all data required for CCAR/CECL model development\nDevelop segment and/or account level CCAR/CECL stress loss models\nPerform all required tests (e.g. sensitivity and back-testing)\nValidate/recalibrate all models annually to incorporate latest data. Redevelop as needed\nDeliver comprehensive model documentation\nWork closely with cross functional teams, including country/region’s business stakeholders, model validation and governance teams, and model implementation team\nPrepare responses/presentations to regulatory agencies on all CCAR/CECL models built\nQualifications:\nAdvanced Degree (Masters required, PhD preferred) in Statistics, Applied Mathematics, Operations Research, Economics, MBA (Finance), or other highly quantitative discipline\n2- 5 years’ experience in performing quantitative analysis, statistical modeling, loss forecasting, loan loss reserve modeling, and particularly econometric modeling of consumer credit risk stress losses\nExperience with dynamics of unsecured products a strong plus\nActive role in performing some analytical components of an econometric modeling-driven stress loss process (data collection, data integrity QA/QC/reconcilements, pre-processing, segmentation, variable transformation, variable selection, econometric model estimation, sensitivity testing, back testing, out-of-time testing, model documentation, and model production implementation)\nExposure to various stress loss modeling approaches at the segment or account level preferred\nAble to communicate technical information verbally and in writing to both technical and non-technical audiences\nProficiency in SAS/SQL/Oracle/Unix/Microsoft Word, Excel and PowerPoint\nWork as an individual contributor-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}