{"Job ID": "69875821", "Description": "The RoleEssential duties and responsibilities:Own the marketing relationship & opportunity with our partners in India.\nExecute partner marketing programs that deliver on our broader business strategy.\nProvide strategic support to internal product and business development teams to develop and execute Go-to-Market strategies across partner channels for maximizing Netflix exposure on new and existing partnerships.  \nWork closely with the cross functional teams; our content, marketing and PR teams to identify opportunities for partnerships and subsequently, the right partners for executing those opportunities.\nDevelop and launch highly creative & conversation-driving marketing partnership programs that advance exposure for Netflix content or the brand in a way that benefits Netflix and our partners.\nCollaborate with partner marketing creative teams to elevate the campaign creatives and introduce our content to consumers in unique and unexpected ways. \nEvaluate performance against marketing goals with partners through established review rhythm and define corrective actions to improve effectiveness and results.The role will be based in our Mumbai office and will require occasional travel.Qualifications:Extensive knowledge and 15+ years of experience in India in connected industries like Consumer Tech and Entertainment. \nStrong experience in consumer marketing with natural partner management and influencing skills.\nProven record of strong negotiation skills with an ability to develop rapport and translate established partner relationships to programs that impact the business.\nAbility to analyze and apply data to business strategy and goals.\nExperience and passion for building great content partner marketing programs that are unique and scalable.\nExperience working with Entertainment properties (movies, tv series, video games, music, etc) is essential.\nAbility to manage multiple time-sensitive projects simultaneously without the support of a large team, working both independently and in close collaboration with a wide variety of stakeholders, mainly remotely.\nStrong cross-team collaboration skills and ability to promote innovation through a creative collaboration process that transforms different input into one actionable output. \nKnowledge or experience with telco/ISP industries or previous experience working with CE and/or retail partners is a plus.\nA desire to thrive in our unique culture.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}