{"Job ID": "69872679", "Description": "A unique blend of contemporary design and urban chic, Fairmont Dubai is an icon in the business heart of the city. Fairmont Dubai brings together luxurious surroundings and modern amenities with renowned Fairmont service.Strive to exceed Guest expectations and take the Culinary team from good to great.  Always act in a professional manner using the company’s Mission, Vision and Values. Reporting to the Head Chef, responsibilities and essential job functions include but are not limited to the following:Summary of Responsibilities:Conduct daily shift briefings in absence of Head Chef.\nPromote a fun, professional and disciplined work environment.\nLead by example using Fairmont’s Mission, Vision & Values.\nSupport, coach, lead and motivate Colleagues.\nActively share ideas, opinions and suggestions in daily shift briefings.\nEnsure storeroom requisitions are accurate to minimize repeat visits.\nEnsure all culinary Colleagues are aware of standards and expectations.\nPromote Health and Safety at all times.\nEnsure proper hygiene as per Dubai Municipality.\nEnsure all grooming, spot check, and temperature control sheets are filled as required.\nMaintain cleanliness and proper rotation of product in all chillers.\nMinimize wastage and spoilage.\nMaintain consistent on the job training sessions for culinary Colleagues.\nLiaison daily with Head Chef to keep open lines of communication and Guest feedback.\nStrive to maintain and improve all food preparations and presentations.\nAct as an extension of Kitchen Managers to communicate food consistency & quality.\nDaily checks of all mise en place to ensure freshness and quality standards.\nStrive to develop as a Leader by attending training.\nAssign and follow-up tasks as dictated by business volumes.\nPerforms any other reasonable duties as required by the Department Head.\nOther duties as assigned.Previous culinary experience in a 5-star luxury hotel environment is required.\nDiploma Certification in a Culinary discipline preferred.\nStrong supervisory and communication skills.\nFood Hygiene and Safety trained.\nEnthusiastic and with outgoing personality who is very guest driven. Physical Aspects of Position (include but are not limited to):Constant standing and walking throughout shift.\nOccasional lifting and carrying up to 30 lbs.\nFrequent kneeling, pushing, pulling, sitting.\nOccasional ascending or descending ladders, stairs and ramps. Visa Requirements: Please note that you must be eligible to live and work in the United Arab Emirates. We will assist successful applicants with the visa process and provide flights and accommodation.Why work for Accor?\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality. We support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/Do what you love, care for the world, dare to challenge the status quo! #BELIMITLESSJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}