{
    "Job ID": "69873196",
    "Description": "What you will be doingoProcessing of transactions across different asset class for Private Equity clientsoMonthly and Quarterly P&L booking to Investran GLoQuarterly Valuation Process and Fund Valuation creations in CRMsoMaintaining data repository in Data ExchangeoCommunicating and interacting with the business unit for query resolution.oReport discrepancies that arise in a prompt and professional manner to the client, ensuring follow up and reconciliation in a timely manner.oProvide on the job training to new staff and assists new staff with attainment of understanding job responsibilities.oReview tasks performed by processor.oProvide floor support on queries raised by the team membersoElevate unresolved issues/problems to Senior Client Support Specialist.oCustom and regulatory reporting. What you bring: Knowledge / ExperienceoShould carry 4-7 years of experience in Financial services, preferably Fund Accounting (Hedge Funds, Mutual funds, Insurance Funds).oDomain knowledge of financial products like Syndicate Loans, CLO, CDO, Bonds, Mutual Funds, Derivatives, Equities, MBS is mandatory.oKnowledge of reconciliation (Cash, Stock), Fund accounting, Trade processing and settlementsoExperience of working on FIS products i.e IntelliMatch, Investran, VPM would be Added advantage.SkillsoStrong understanding of Capital markets, Reconciliation (Assets, Cash), Portfolio Accounting, Security Setup’s.oProficient in Microsoft Excel. VBA Macro will be an added advantage.oStrong written and verbal communication skillsQualificationsoMaster’s Degree in Commerce.CompetenciesoCollaborative – Collaborate with different groups and complete the assigned task.oHighly analytical, organized, detail oriented, self-motivated individual who can handle Multi-Tasking.oSelf-starter but team mindset - work as part of a global team.oReady to work in Flexible shifts to support US Client.What we offer youoA multifaceted job with a high degree of responsibility and a broad spectrum of opportunitiesoA broad range of professional education and personal development possibilities – FIS is your final career step!oA competitive salary and benefitsoA variety of career development tools, resources and opportunitiesWith a 50-year history rooted in the financial services industry, FIS™ is the world's largest global provider dedicated to financial technology solutions.  We champion clients from banking to capital markets, retail to corporate and everything touched by financial services. Headquartered in Jacksonville, Florida, our 53,000 worldwide employees help serve more than 20,000 clients in over 130 countries. Our technology powers billions of transactions annually that move over $9 trillion around the globe.  FIS is a Fortune 500 company and is a member of Standard & Poor’s 500® Index.FIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the FIS Online Privacy Notice.Privacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}