{
    "Job ID": "69874031",
    "Description": "As an Account Specialist, you will play a pivotal part in HackerRank's mission to 'Accelerate the World's Innovation'.&nbsp;&nbsp;You will be the face and voice of HackerRank for our prospective SMB customers.&nbsp; You'll seek to understand their hiring process and show them how HackerRank can be used to support their hiring goals.&nbsp; You'll also look to improve their existing process by sharing best practices and uncover any additional ways HackerRank can benefit these Trial users and Customers.In addition, you’ll also be responsible for ensuring quick and accurate follow up for all global Marketing Qualified Leads for all segments of business.&nbsp;You will be working on:Manage the sales cycle for our prospective SMB customers who are typically best served by our Self Service products. Conduct prospect qualification calls and demos via zoom.\nMonitor and follow up on all inbound Marketing Qualified Leads within our SMB segment\nMonitor, follow up with, and notify our sales reps of high priority global inbound leads to ensure prompt response times and a positive customer experience\nBecome a Product Expert and guide users through our Free Trial and Self Service product offerings\nEngage Free Trial customers to help ensure they have a successful trial experience\nRespond to customer questions and requests to provide exceptional customer delight\nBecome an expert on technical hiring processes and advise on best practices\nWork with Sales and Support to fulfill customer requests\nWork with product teams to share key feedback and behavioral patterns of Free Trial and Self Service users to prioritize the product roadmapWe are looking for:2 years of customer-facing experience\nBusiness acumen: understanding how a given feature or its implementation generates a given business value\nExcited by technology and enjoys keeping up with the latest trends\nAmbitious and results-oriented individual\nExcellent written and oral communication skillsNice to have:Knowledge of Salesforce and SalesLoft, or other similar CRM and sales cadence tools\nUnderstanding of technical recruiting process**Multiple shifts are available as this team operates 24/7Benefits &amp; Perks:We have a full package of competitive benefits and perks which include:One-time home office set up stipend\nMonthly Remote Work Enablement Stipend\nProfessional Development Reimbursement\nWellbeing Benefits (Headspace, Ginger, Carrot, Cleo, etc)\nUnlimited paid time off, paid leave for new parents, and flexible work hours\nInsurance for all employees (term life, personal accident, medical) along with medical insurance for their dependents\nCOVID 19 insurance to employees and dependents\nEmployee stock options, flexible work hours, and time offAbout HackerRank:#LI-RemoteJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Sales Outsourcing",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}