{"Job ID": "69873990", "Description": "Senior Officer-(2300016872)Job:OperationsPrimary Location:Asia-India-ChennaiSchedule:Full-timeEmployee Status:PermanentPosting Date:15/Sep/2023, 8:20:05 AMUnposting Date:OngoingThe Role ResponsibilitiesStrategyUnderstands the strategies and priorities of the organization.\nAble to execute given actions that will contribute towards achieving business strategies.BusinessAbility to decide based on the available information in hand to recommend decisions.\nUnderstanding the data points how it matches / breaches the rules.\nAnalysing transactions to bring out trends and patterns.\nIdentifying the key information required from other sources.\nCo-relate all the inputs, analysis and summarize the findings.\nAble to analyse the trends and patterns in the unit (Volume, capacity, performances and errors).ProcessesIdentify and eliminate process waste (excessive movement and transportation, wait time, defects, underutilized people / resources and non-value added processing steps).\nTo conduct process review to eliminate the non-value added processing steps.\nReview the process e2e and update in the share point for any further opportunity / defects in the process.\nAssess process health through key metrics.\nTo perform periodical KCSA checks to ensure on process adherence.\nAnalyses and remedies inefficiencies in processes.\nEnsure updated DOI’s and end to end system / process manual on a regular basis.\nAdvises on multiple processes and trains staff.\nInstil in team the sense of urgency for change.\nMakes decisions on area of control and can identify issues that need to be escalated.People and TalentUnderstands human emotions and how it can affect performance at work.\nAble to lead, motivate and develop a bigger team.\nFully committed to team engagement.\nPeople effectiveness and Management skills which would inspire, motivate and engage team members to achieve higher performance.\nSuccessfully develops and retains talented individuals.\nAble to delegate effectively within the team ensuring development of subordinates.\nAbility to personally relate to each member of the team and be able to objectively evaluate performance - courageous to differentiate great performance from just good performance.\nAble to establish a culture for rewarding good performance and for taking effective action on poor performance.\nFacilitates clear expectations and processes for teamwork, team roles and team talk.Risk ManagementAnalyses, interprets and monitors operations risk and suggests mitigation techniques to reduce such risk.\nCheck inherent risk of account opening and process in the operating environment and demonstrate support for the internal program through behaviour, presentations and discussions.\nAble to identify early warning signals and to initiate remedial action.\nAble to anticipate and detect fraud and take preventive measures keeping the global fraud environment in mind.\nEstablish prevention and detection internal controls with an end-to-end perspective (from transaction to customer), which address potential risks of inefficiency, ineffectiveness, fraud, abuse or mismanagement.\nUse of internal / external audit findings to further improve service excellence.\nPromote and enable a culture of audit readiness at all times in order to ensure no failed audits.\nInstructs others in the area of operations risk assessment and monitoring.\nTo maintain independence in the conduct of KCSA i.e. not selecting and reviewing sample of self-performed transactions.GovernanceAbility to decide based on the available information in hand to recommend decisions.\nUnderstanding the data points how it matches / breaches the rules.\nAnalysing transactions to bring out trends and patterns.\nIdentifying the key information required from other sources.\nCo-relate all the inputs, analysis and summarize the findings.\nAble to analyse the trends and patterns in the unit (Volume, capacity, performances and errors).Regulatory and Business ConductInstils a strong internal and external customer mindset in the team by setting service quality standards.\nTakes ownership of team goals in addition to their own.Key StakeholdersAble to put forth areas of concern and assistance required from Countries for improvement in operations.\nUnderstands concerns and needs of the stakeholders.\nAsses ones work and processes by their impact on stakeholder's concerns.\nBeing able to give confidence to stakeholders that their interests are protected.\nIn the event of any unforeseen incidents, proactively manage flow of information to stake holders and reassure with concrete steps that all in control.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}