{"Job ID": "69872867", "Description": "You’re ready to gain the skills and experience needed to grow within your role and advance your career — and we have the perfect software engineering opportunity for you.Job summaryAs a Software Engineer I at JPMorgan Chase, in the AI/ML & DATA PLATFORMS Team which is aligned CTO  Enterprise Technology Team  you are part of an agile team that works to enhance, design, and deliver the software components of the firm’s state-of-the-art technology products in a secure, stable, and scalable way. As an emerging member of a software engineering team, you execute software solutions through the design, development, and technical troubleshooting of multiple components within a technical product, application, or system, while gaining the skills and experience needed to grow within your role.Job responsibilitiesDevelop, test and deliver the software to automate manual operational work and ensure application performance and resiliency\nApply Core Engineering principles and standards to provide various technical solutions that may include evaluation of various vendor products.\nKey contributor to SRE and functional development teams throughout the life cycle to help create software for reliability and scale, ensuring minimal refactoring or changes\nLeading and be responsible for the craftsmanship, security, availability, resilience and scalability of solutions\nEmbrace automation over manual effort.\nSupport LOBs(Line of Businesses) in troubleshooting incidents, participate in blameless post-mortems and ensure permanent closure of the incidents.Required qualifications, capabilities, and skillsBachelor's/Master’s degree in Engineering, Computer Science, or Information Technology or equivalent experience.\n 7+ years of experience in software application development or operations using any of these programming languages: Java, Scala, Python. Experience working in financial industry is preferred.\n1+ years of experience working with Amazon Web Services (AWS) including entitlement and IAM policy. AWS Certifications add more value.\n3+ years of development experience using any 2 programming languages- Java/Python/C/C++\n1+ years of experience with DevOps automation tools (AWS CloudFormation, Terraform) in developing, deploying and monitoring in building large distributed 1+ years of experience and parallel systems using container technology including Docker, Kubernetes, AWS EKS, AWS Fargate\nStrong on critical thinking, great communication and team work skill is essential to this role.\nLead by influence, mentor junior SRE engineers, ability to navigate to different teams .and business to find solutions to complex problems.Preferred qualifications, capabilities, and skillsThe person must have fluency in any 2 development languages –Python,Java,C/C++,Scala\nMust be hands on familiar with Cloud technology – AWS/Google Cloud/Azure,Kubernetes etc.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, Pakistan", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}