{
    "Job ID": "69873415",
    "Description": "Are you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun. About the team In today’s highly competitive private equity market, firms must not only deliver superior returns, but also respond to more stringent reporting requirements and increasing demands for information – both from within and outside their organization. Throughout the industry there is mounting pressure on organizations to do more, requiring a clear technology strategy that not only addresses the demands of today, but also enables the growth and performance of tomorrow. What you will be doing This position works with sales and pre-sales to: identify the appropriate managed services solution; provide presentations and technical details around solution; respond to RFI's and RFP's around the managed services provided; assist with pricing solutions; and, assist with contract negotiations around SLA's, discounts and other related managed services items.What you bring: Knowledge / Experience6 to 10+ years hands-on experience and currently playing Java Technical Full stack developer Role\nAbility to effectively collaborate and communicate with others, Ability to multi-task, prioritize tasks and quickly adjust in a rapidly changing environment.\nConsiderable knowledge of change and release management principles, procedures, and techniques.\nMust be customer focused, well organized, self-motivated and self-directed.\nDemonstrated technical aptitude and ability to think and solve problems creativelySkillsEssential SkillsExperience in developing Java applications J2EE (Spring Boot, Microservices) , Hibernate, Event Based programming.\nNeed to have experience on application Servers Tomcat / JBOSS / Weblogic\nFamiliarity with all facets of SDLC ranging from inception to deployment using DevOps\nNeed to have experience in REST Web Services\nWorking experience in Micro-Services/ Mocha\nWorking knowledge of CI tools like Jenkins, Docker would be desirable.\nExperience working in Unix environment and proven knowledge of scripting languages.\nSelf-starter with good interpersonal skills.\nAbility to learn and use new technologies.\nSound knowledge of Design PatternsDesirable SkillsFamiliar with scripting languages likes Python\nWorking experience on configuration management tools like GIT Bitbucket, Artifactory etc. desirable.\nTools knowledge like Sonar QubeQualificationsBachelor’s degree in Computer Science or equivalent experience.CompetenciesFluent in English\nExcellent communicator – ability to discuss technical and commercial solutions to internal and external parties and adapt depending on the technical or business focus of the discussion\nAttention to detail – track record of authoring high quality documentation.\nOrganized approach – manage and adapt priorities according to client and internal requirements.\nSelf-starter but team mindset - work autonomously and as part of a global team\nMust be able to perform under pressure.What we offer you A multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nA broad range of professional education and personal development possibilities – FIS is your final career step!\nA competitive salary and benefits           \nA variety of career development tools, resources and opportunitiesPrivacy StatementFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.Sourcing ModelRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.#pridepassJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}