{"Job ID": "69875610", "Description": "OPENTEXT - THE INFORMATION COMPANY\n\nAs the Information Company, our mission at OpenText is to create software solutions and deliver services that redefine the future of digital. Be part of a winning team that leads the way in Enterprise Information Management. The OpportunityReporting into the Renewals function, as the Manager, you will be responsible for overseeing the Renewal Support Specialist team which performs back-office functions and is typically non-customer facing and responsible for performing general and specific tasks related to the effective execution and support of the end-to-end renewal sales cycle processes.  This role requires exceptional leadership abilities, strong attention to detail, and a deep understanding of the renewal processes.The team is responsible (at the non-exempt level), to capture, entry, and the organization of customer information, updating renewal sales opportunity & quote data, maintaining records and documentation, researching information, and coordinating work via pre-defined processes.The manager role will interface with internal stakeholders, partners, and end customers to communicate status or resolve issues arising during or after the renewal sales cycle. The manager and the team will provide knowledge expertise to the company's operations team to optimize, simplify, and standardize the use of customer and renewal data for decision making.You are great at Manage and mentor a team of Renewal Support Specialists, providing guidance and support to ensure their success.\n\nSet clear performance objectives, conduct regular performance evaluations, and implement training and development plans for team members.\n\nFoster a collaborative and positive work environment, promoting teamwork and effective communication within the department.\n\nInvestigate and resolve escalated quoting, upsell and renewal booking issues,\n\nSolve escalated ISV cases\n\nLog SMAX (IT Help) tickets where there are complications,\n\nProvide testing support for IT releases,\n\nEnsure that both transactional and aggregated data are timely, accurate, organized, and accessible.\n\nEnsure recorded transactions and customer information is appropriately secure and that data retrieval and reporting capabilities meet the needs of internal renewals, operational support, delivery, and audit teams and in accordance with local legal compliance and company policy requirements.\n\nAssisting with complex renewal Quote Generation where issues arise and support the Renewal Account Representatives leadership team as and when required.What it takes10-14 years of Industry experience post qualification. Preferably a graduate in Business Administration or equivalent degree.\n\nProven experience of 5+years in order administration or order management, preferably in a managerial capacity.\n\nStrong knowledge of order processing systems and tools.\n\nExcellent leadership and team management skills, with the ability to motivate and develop a high-performing team.\n\nExceptional attention to detail and accuracy.\n\nStrong analytical and problem-solving abilities.\n\nExcellent communication and interpersonal skills.\n\nProficiency in MS Office Suite and experience with order management software.OpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at 1-800-499-6544.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}