{
    "Job ID": "69873383",
    "Description": "Roles & Responsibilities:Managed the entire Payroll Processing from providing Payroll input to validation of salary register including statutory deductions like PF, PT, ESIC, Income Tax etc.\nResponsible to validate Salary JV and share it with Finance as well as reconcile the salary payable & statutory payments on a regular basis.\nManage New registration of Professional Tax (RC / EC) basis new branch rollouts.\nResponsible to keep a track, monitor and ensure state wise minimum wages are paid to all type of employees (On-roll / Off-roll)\nMonthly statutory payments of Provident Fund, ESIC, Profession Tax, and Income Tax are done on or before due date.\nManage PF Transfer, Advance and Death Claims working closely with EPFO & PF consultant.\nMonthly Quarterly, Half Yearly & Annual returns to be made under various acts (Minimum Wages Act, Payment of Wages Act, Maternity Benefit Act, Payment of Bonus Act, Gratuity Act, POSH Act., CLRA, National & Festival Holidays etc.)\nEnsure to display all the latest Abstracts & Notices in the notice board across Pan India branches.\nManage and ensure to close the Branch Notices issued by various Government Authorities / Labour inspectors under different Acts with the support of compliance partner.\nOne point contact for all queries related to compliance and handle internal as well as external compliance audits.\nManage Annual statutory actuarial activities of Gratuity, Bonus, Leave Encashment etc.Job Specifications:\nEducation: Full time Graduation + MBA (Preferred)\nAn ideal candidate will possess the following:\n\n1. 6+ years of experience in laws like establishment act, CLRA, PF, contract act and Gratuity etc.\n\n2. Excellent communications skills and exemplary writing ability\n\n3. Proven track record of Liasoning with government agencies, legal contracting, managing employee grievances, escalations etc.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Pune, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Recruitment Agency",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}