{
    "Job ID": "69872693",
    "Description": "PakWheels is looking for a passionate Video Content Creator Intern to join its dynamic team.  Responsibilities:Produce content for YouTube and other social media platforms.\nMake promotional videos/ads for performance marketing.\nManipulate and edit footage in a way that is invisible to the audience.\nImprove content by adding music, sound, footage or graphics.\nEnsure all published content meets quality standards.\nCollaborate with staff to brainstorm content topics.\nContinuously discover and implement new production technologies and industry best practices to maximize efficiency.\nPost Videos on social media Platforms with appropriate titles, descriptions, thumbnails and SEO to get maximum reach.Requirements:Bachelor's degree in Film & Television\nProficient at consumer-grade cameras, sound and other video production equipment. \nProficient at Adobe Premiere Pro, After Effects and Photoshop.(or equivalent)\nDemonstrable video production ability with a strong portfolio.\nInterest in the Cars and Automobile industry is a must. \nDemonstrating excellent communication skills, Ability to communicate effectively, both verbally and in writing.\nAbility to multi-task and handle a diverse workloadPakWheels.com was formed in 2003 and has become Pakistan’s #1 Automotive Portal with 40+ Million users, more than 500,000+ registered car and motorcycle enthusiasts. Since its inception, PakWheels.com has helped millions of Pakistanis buy & sell automobiles, read automotive reviews and news, check automotive prices and find solutions to all of their automotive needs \nToday, PakWheels.com is the first name that comes to mind if anyone is looking for a solution to their automotive needs.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Lahore, Pakistan",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}