{
    "Job ID": "69872996",
    "Description": "Visa is a world leader in digital payments, facilitating more than 215 billion payments transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive.When you join Visa, you join a culture of purpose and belonging – where your growth is priority, your identity is embraced, and the work you do matters. We believe that economies that include everyone everywhere, uplift everyone everywhere. Your work will have a direct impact on billions of people around the world – helping unlock financial access to enable the future of money movement.Join Visa: A Network Working for Everyone.Job Summary:This position will build, operate and maintain the IT systems and infrastructure necessary to enable a highly connected and collaborative workforce that helps power Visa’s business. You will help define success for the central and critical tool for the ongoing support and operation of services that Visa provides. This position will report to the Manager of End User Operations and Application Support.Essential Functions:Develop, test, and debug new and existing functionality that meets specific requirements.\n\nTroubleshoot any errors found in the ServiceNow configuration.\n\nIdentify requirement gaps to maintain a high degree of quality in the solution built and provide configuration options to identify respective pros and cons.\n\nDesign and implement software that is simple, intuitive and easy to use that will allow customers to extend and customize the functionality to meet their specific business needs.\n\nWork with internal customers and business analysts for requirement clarifications and solution designing.\n\nWrite technical design and build documentation for all aspects of a technical infrastructure.\n\nResearch information from existing systems, analyze program and time requirements.\n\nPrepare time estimates and justifications for assigned tasks and provides recommendations to project managers.\n\nParticipate in project meetings/daily scrums and communicate development status.\n\nSupport ServiceNow Platforms through Monitoring, Troubleshooting, Root-cause analysis, and Implementing Bug-Fixes.This is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.Basic Qualifications\n2+ years of relevant work experience and a Bachelors degree, OR 5+ years of relevant work experience\n\nPreferred Qualifications:\n3 or more years of work experience with a Bachelor’s Degree or more than 2 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD)\nIn-depth configuration and development experience across all core ServiceNow models. (Incident Management, Problem Management, Change Management, Knowledge Management, AHA, GRC, CMDB, HR Service Management, Agent Workspace, Agent Chat, Walk-up Experience, Advance Work Assignment, Catalog Request and Service Portal).\nIn-depth experience with JavaScript, AJAX, XML, JSON, CSS, REST, SOAP and HTML.\nKnowledge working with AngularJS, NodeJS and Glide Stack APIs.\nGood to have knowledge on Java, C# and Gen AI.\nKnowledge of APIs, Web Services and Standard Relational Database concepts required.\nKnowledge and experience working with ServiceNow Security features, administering Users, Roles, Groups, ACLs.\nStrong understanding of ServiceNow Best Practices.\nStrong analytical skills with the ability to extensively analyze business processes and workflows.\nAdvanced ServiceNow technical skill - UI Policies, UI Macros, UI Pages, Client Scripts, Script Includes, Business Rules, Mid Server Configuration & Architecture, Import Sets, Transform Maps and Update sets.\nGood to have CSA (Certified Service Now Admin), CIS (Certified Implementation Specialist) or CAD (Certified Application Developer).\nEffective communication with customers, system administrators, team members and management and use sound judgment when considering enterprise impacts of technical decisions.\nGood communication skills to work effectively with team members, support personnel, management and customers in geographically dispersed locations and ability to work as part of a team as well as independently.Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}