{
    "Job ID": "69872620",
    "Description": "Pourquoi travailler chez Accor ?Nous sommes bien plus qu’un leader mondial. Nous vous accueillons comme vous êtes et vous pouvez trouver le métier et la marque qui correspond à votre personnalité.Nous vous accompagnons dans votre évolution et votre apprentissage au quotidien, nous nous assurons que votre travail apporte du sens à votre vie. Ainsi, durant votre expérience avec nous, vous pouvez explorer les possibilités illimitées du Groupe Accor.En rejoignant Accor, vous écrivez chaque chapitre de votre histoire et ensemble nous pouvons imaginer l’Hôtellerie de demain. Découvrez la vie qui vous attend chez Accor, visitez https://careers.accor.com/Faites ce que vous aimez, prenez soin du monde qui vous entoure, oser challenger le status quo ! #BELIMITLESSVotre rôle : En tant que membre de l’équipe Talent & Culture, vous êtes un(e) interlocuteur(trice) privilégié(e) des collaborateurs, les informant de toutes les questions relatives aux dispositions légales et conventionnelles en vigueur. Vous apportez conseil et support aux managers.\nVous rédigez les documents contractuels, êtes garant(e) de la mise en conformité avec la législation sociale (médecine du travail, titres de séjour, affichages obligatoires…) et assurez une veille réglementaire sur votre périmètre.\nVous consolidez tous les éléments de paie, du suivi administratif des absences aux éléments variables de paie et les contrôlez.\nCréatif(e) et innovant(e), vous développez une communication ambitieuse et différenciante à la fois collective et individuelle, au service d’une meilleure expérience RH des collaborateurs.Votre expérience et vos compétences incluent :Vous disposez au moins d’au moins 2 années en ressources humaines. L’expérience en hôtellerie de luxe est un atout considérable.\nVous maîtrisez idéalement l’outil de paie HR Access\nRigueur, autonomie, sens de l’organisation alliés à d’excellentes capacités d’écoute seront vos atouts.Notre Engagement Diversité & Inclusion :Nous sommes une entreprise inclusive et notre ambition est d’attirer, de recruter, et de promouvoir la diversité des talents.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Rabat, Morocco",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}