{
    "Job ID": "69873021",
    "Description": "Why Patients Need YouWe're looking to bring medicines to the world faster and we are not willing to compromise on excellence and integrity.  Adhering to local and global regulations is essential and the ever-changing regulatory environment requires forward thinking and attention to detail.  Your dedication and expertise will help expand and accelerate patient access to Pfizer medicines and vaccines.What You Will AchieveYou will help us in preparation, publication, tracking and quality control of our submissions to the regulators in compliance with document management standards. You will be responsible for activities related to enterprise-wide regulatory management systems, including systems coordination, training others, developing and implementing plans, and providing input to systems designs.As an associate, your focus on the job will contribute in achieving project tasks and goals. Through your domain knowledge and commitment, you will create a collaborative team environment for your colleagues.It is your dedication that will make Pfizer ready to achieve new milestones and help patients across the globe.How You Will Achieve ItPartnering with internal and external partners, the incumbent confirms the appropriate components required to support a CMC/Regional change in collaboration with the CMC/Regional Strategist and/or RCM Product Manager, confirms and/or establishes CMC/Regional content provision timelines and subsequently project manages their delivery to the appropriate colleagues. In parallel the incumbent assumes responsibility to assure product compliance through timely and accurate maintenance of CMC/Regional product information in both CMC/DE change management systems and regulatory planning and document management systems.CMC change management/Regional planning and compilation can take place over days, weeks or months from trigger to completion and will involve coordination with others regarding components and standards required for multiple Boards of Health. Multiple CMC/Regional change types at different stages may be managed in parallel, related to product, dossier type or country assignments/requirements.Provide operational support within Regulatory Change Management (RCM) team to execute designated tasks associated with CMC/Regional colleagues\nPackage coordination activities for assigned products and/or at required CMC change management Process as appropriate\nAccountable for delivering tasks with quality and timeliness as per applicable policy, SOP/Work Instructions, guidelines, or service level agreement\nAdhere to the appropriate use of technical tools, through use of working practices and QC/QA regimes, such that regulatory and internal compliance is preserved\nEscalate, inform, and/or resolve any issues that may impact timeline, quality, or compliance of submissions\nHas Fundamental knowledge and skills of regulatory CMC submissions and ensure regulatory or business requirements are fulfilled\nCommit to completing required on-the-job training courses to ensure training compliance is preserved\nPromotes the use of Document Management systems and standard document publishing processes, partnering with supplier groups as necessary to produce timely delivery of submission ready components\nExecute regional specific CMC tasks to support on-time project delivery\nAble to operate at pace with agile decision-making skills. Uses evidence and applies judgment to balance pace, rigor and risk.\nCommand necessary knowledge and skills for on-time delivery of CMC submissions ensuring business requirements are fulfilled.\nAccountable for delivering category aligned submissions with quality and timeliness as per applicable policy, SOP/Work Instructions, guidelines, or service level agreementQualificationsMust-HaveBachelor's Degree in pharmacy, Biotechnology or Science background\nDemonstrated 0-2 years of experience\nRelevant experience in electronic submissions build within the Pharmaceutical Industry\nDemonstrated coordination of activities in a highly regulated environment\nDemonstrated experience working in a challenging customer service environment\nKnowledge of the drug development process\nIn-depth understanding of systems and electronic technologies used to support submission and planning activities, as well as demonstrated experiences in process development and new technology implementation\nGood knowledge of English, spoken and writtenNice-to-HaveExperience in project management\nMaster’s Degree in Pharmacy, Biotechnology or Science backgroundPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}