{
    "Job ID": "69873318",
    "Description": "Basic Function:Oversees the Front Desk operations and acts as the manager on duty in the hotel when senior managers are not available.  Directs staff that performs the following duties and will also perform these duties on own:  welcomes and registers hotel guests, explaining the accommodations and establishing credit or method of payment.  Checks guest out of the hotel, preparing and explaining the bill.  Responds to a wide variety of guest requests by accurately assessing the guest needs and requests and then adding personal recommendations and touches to achieve maximum customer satisfaction while complying with all Four Seasons’ policies.Role and Responsibilities:Manages the staff at the Front Desk.  Interviews, trains and schedules the staff.  Conducts Performance Evaluations and disciplines staff when needed.\nCoordinates arrivals, departures and billing requirements with Sales and Catering Department. Block rooms for arrivals and ensures any discrepancies are resolved. Reviews daily arrivals to ensure proper handling of Special Attention Guests, Return Guests, and Groups.\nAssures that all financial and credit procedures are followed.  Follows up on credit problems with Front Office Manager and/or Credit Manager. Reviews all paid-outs, rebates, Petty Cash disbursements and Direct Billings. Checks cashiers’ work at end of shift to ensure all transactions are reconciled with proper approvals and endorsements.\nTakes action in all matters related to the safety, security, satisfaction and well-being of hotel guests and employees when senior managers are not available. Responds swiftly and effectively in any hotel emergency or safety situation.\nResolves customer complaints from all areas of the hotel, handling all guest interactions with the highest level of hospitality and professionalism, accommodating special requests whenever possible; assists customers in all inquiries in connection with hotel services, hours of operations, key hotel personnel, in-house events, directions, etc. Responds to all guest requests in an accurate and timely manner. Interaction with guest will be in person and by phone.\nChecks guest in and out in an efficient and friendly manner, using guest name whenever possible.  Assures that guest is assigned type of room requested and the correct rate is charged. Arranges for luggage to be delivered to guest room.  Issues correct keys to the guest. Checks out guest at end of stay.  Ascertains guest satisfaction, collects keys, posts late charges and presents bill to guest.  Settles bill accurately through credit card or cash transaction.\nUtilizes a variety of computer systems to check guests in and out, run daily reports and select and block rooms for arriving guests.\nComplies with Four Seasons’ Category One and Category Two Work Rules and Standards of Conduct as set forth in EmPact.\nWorks harmoniously and professionally with co-workers and supervisors.\nAccepts reservations, changes and cancellations in the absence of Reservations Department Staff.  Can answer guest calls and direct them appropriately in the absence of a Communications Operator.\nConsistently driving the team to achieve high guest experience scores in social media platform such as Medallia, Trip Advisor etc.\nIs completely aware of the hotels upsell program and constantly drives towards achieving the companies upsell goal.\nActively handles profile management and guides staff accordingly.\nActively monitors chat response and mobile application to ensure timely response.\nInterviews, trains and schedules the staff, as well as conducts performance evaluations and disciplines staff when needed.\nResolves guest concerns and interacts with the highest level of hospitality and professionalism, accommodating special requests whenever possible.\nReview daily arrivals and departure to ensure proper handling of VIP and return guests, groups etc. and escort them to or from their rooms respectively\nCoordinating with respective supporting departments especially Housekeeping to ensure all guest requests are met.\nPersonally managing and making personal contact with all VIP, suite guests and frequent return guests\nAssures that all financial and credit procedures are followed; coordinates arrivals, departures and billing requirements with Sales and Catering Departments.\nResolves customer complaints from all areas of the hotel\nCommunicate closely with the night manager and other assistant managers to ensure follow up on special guests, issues/glitches, requests etc\nAdheres to the hotel's code of conduct and grooming & hygiene standards\nActively conducts briefings and meetings.\nAssists with responsibilities and duties in the absence of or due to heavy volume in the areas of the Concierge, Bell Staff, Business Center, and lobby coverage.\nProvides basic trouble-shooting support for in-room services such as Internet, TV movies, games, and Web service.\nWorks closely with Bell Staff to ensure smooth handling of guest luggage, deliveries andspecial requests.Education:                                             Bachelor’s degree                                                              Experience:                                           At least five years related working experience in luxury Hotels                              Skills and Abilities:                               Good Communications skills and Computer skills proficiency in PMS - Opera       No. of employees supervised:          Up to 5 directly, 15 indirectly on any particular shift.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}