{"Job ID": "69872697", "Description": "Charterhouse is working with a leading player in the Aviation industry, operating on a global scale. With a strong commitment to innovation and excellence, the company is dedicated to providing exceptional travel experiences for its passengers. Our client’s Information Services Department is at the forefront of technological advancements, driving the integration of IT solutions to enhance operational efficiency and customer satisfaction.\nAbout the role\nIn this pivotal role, the Head of IT will spearhead the alignment of IT strategies with the company's overarching business objectives. Collaborating closely with C-level executives and department heads, responsibilities will include translating business needs into tangible IT products and services, ensuring their seamless delivery in a cost-effective and timely manner.\nWhile leading a cross-functional team of Business and System analysts, Solution Architects, Software Engineers, and Application and Business support personnel, it will be essential to foster a culture of innovation and driving the adoption of cutting-edge technologies to maintain our competitive edge in the industry.\nAbout you\nTo be considered for the role, the successful candidate will bring a wealth of experience, with a minimum of 8-12 years of relevant experience, complemented by a University Degree or higher, ideally a Master's degree in Engineering or MBA. Expertise in Information Technology, Computer Science, or a related field is essential. A deep understanding of the airline industry coupled with awareness of emerging technologies will be instrumental in shaping the company's IT strategy.\nPossessing certifications such as PMP and SAFe, the ideal candidate should exhibit strong core competencies including customer focus, effective communication, strategic thinking, and business acumen. The client is looking to hire someone who would showcase leadership skills while inspiring and developing the team, driving service improvements and making informed build vs. buy decisions.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Recruitment Agency", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}