{
    "Job ID": "69874165",
    "Description": "MissionAs a Staff Spark Technical Solutions Engineer, you will provide a deep dive technical and consulting related solutions for the challenging Spark/ML/AI/Delta/Streaming/Lakehouse reported issues by our customers and resolve any challenges involving the Databricks unified analytics platform with your highly comprehensive technical and customer communication skills. You will assist our customers in their Databricks journey and provide them with the guidance, knowledge, and expertise that they need to realize value and achieve their strategic objectives using our products.OutcomesPerforming initial level analysis and troubleshooting issues in Spark using Spark UI metrics, DAG, Event Logs for various customer reported job slowness issues.\nTroubleshoot, resolve and suggest deep code-level analysis of Spark to address customer issues related to Spark core internals, Spark SQL, Structured Streaming, Delta, Lakehouse and other databricks runtime features.\nAssist the customers in setting up reproducible spark problems with solutions in the areas of Spark SQL, Delta, Memory Management, Performance tuning, Streaming, Data Science, Data Integration areas in Spark.\nContribute in the development of tools/automation initiatives.\nParticipate in the Designated Solutions Engineer program and drive one or two of strategic customer’s day to day Spark and Cloud issues.\nProvide best practices guidance around Spark runtime performance and usage of Spark core libraries and APIs for custom-built solutions developed by Databricks customers.\nProvide front line support on the third party integrations with Databricks environment.\nPlan and coordinate with Account Executives, Customer Success Engineers and Resident Solution Architects for coordinating the customer issues and best practices guidelines.\nParticipate in screen sharing meetings, answering slack channel conversations with our internal stakeholders and customers, helping in driving the major spark issues at an individual contributor level.\nReview the Engineering JIRA tickets and proactively intimate the support leadership team for following up on the action items.\nManage the assigned spark cases on a daily basis and adhere to committed SLA's.\nBuild an internal wiki, knowledge base with technical documentation, manuals for the support team and for the customers. Participate in the creation and maintenance of company documentation and knowledge base articles.\nAchieving above and beyond expectations of the support organization KPIs.\nCoordinate with Engineering and Backline Support teams to provide assistance in identifying, reporting product defects.\nBe a true proponent of customer advocacy.\nParticipate in weekend and weekday on-call rotation and run escalations during databricks runtime outages, incident situations, ability to multitask and plan day 2 day activities and provide escalated level of support for critical customer operational issues, etc.\nStrengthen your AWS/Azure and Databricks platform expertise through continuous learning and internal training programs.&nbsp;Competencies7+&nbsp; years of experience in designing, building, testing, and maintaining Python/Java/Scala based applications in typical project delivery and consulting environments.\n3+ years of hands-on experience in developing any two or more of the Big Data, Hadoop, Spark,Machine Learning, Artificial Intelligence, Streaming, Kafka, Data Science, ElasticSearch related industry use cases at the production scale. Spark experience is mandatory.\nHands on experience in the performance tuning/troubleshooting of Hive and Spark based applications at production scale.\nProven and real time experience in JVM and Memory Management techniques such as Garbage collections, Heap/Thread Dump Analysis is preferred.\nWorking knowledge in Data Lakes and preferably on the SCD types use cases at production scale.\nWorking and hands-on experience with any SQL-based databases, Data Warehousing/ETL technologies like Informatica, DataStage, Oracle, Teradata, SQL Server, MySQL is preferred.\nLinux/Unix administration skills is a plus\nHands-on experience with AWS or Azure or GCP is preferred\nExcellent written and oral communication skills\nDemonstrated analytical and problem-solving skills, particularly those that apply to a “Distributed Big Data Computing” environment.BenefitsBenefits allowance\nEmployee's Provident Fund\nEquity awards\nGym reimbursement\nAnnual personal development fund\nWork headphones reimbursement\nBusiness travel insuranceAbout DatabricksDatabricks is the data and AI company. Thousands of organizations worldwide — including Comcast, Condé Nast, Nationwide and H&amp;M — rely on Databricks' open and unified platform for data engineering, machine learning and analytics. Databricks is venture-backed and headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world's toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.&nbsp;Our Commitment to Diversity and InclusionAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.&nbsp;About DatabricksDatabricks is the data and AI company. More than 9,000 organizations worldwide — including Comcast, Condé Nast, and over 50% of the Fortune 500 — rely on the Databricks Lakehouse Platform to unify their data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world’s toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.&nbsp;Our Commitment to Diversity and InclusionAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.&nbsp;ComplianceIf access to export-controlled technology or source code is required for performance of job duties, it is within Employer's discretion whether to apply for a U.S. government license for such positions, and Employer may decline to proceed with an applicant on this basis alone.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}