{
    "Job ID": "69873403",
    "Description": "Analyst, Global Trade ClassificationsDell Technologies customers rely on our products and services to drive progress. So we take the service we provide extremely seriously. Service Delivery is all about making sure our technical solutions help clients fulfil their priorities, challenges and initiatives. As trusted advisors, we build in-depth knowledge of what each client wants to achieve. Then we make sure the services delivered by Dell Technologies deliver on all our promises. We also work closely with Sales and Global Services colleagues to develop strategic account growth plans, and to identify and pursue sales opportunities.Global import-export in the world of ground-breaking technology is a complicated business. It takes real attention to detail to comply with all U.S. and regional import and export regulations. Our Import-Export team within Materials and Procurement provides trade compliance support for end-to-end order management and delivery processes. We’re experts in what we do, from assessing global trade risk and providing mitigation strategies, to delivering strategic and tactical support in developing international supply chains, to implementing strategies to reduce import expenses and auditing all documentation.Join us to do the best work of your career and make a profound social impact as an Analyst, Global Trade Classifications on our Import/Export Team in Bangalore, India.What you’ll achieve\nThe Global Trade Classifications, Senior Analyst will play a key role in helping ensure that Dell Technologies' products and services are properly classified in accordance with existing import and export regulations. You will play a crucial role in facilitating the global shipment of Dell's products and services by being involved in new product introduction process to assign proper export and import classifications as well as assisting to resolve problems related to trade attributes.You will:Reviews all new products and technologies to determine export capability and license requirements.\nProvides import and export product classifications, adhering to US and regional regulations.\nSubmits appropriate import/export license requests and ensures strict adherence to license requirements.\nEnsures accurate country of origin are provided in international transactions and trade programs.\nMaintains all classification records per established local recordkeeping regulations.Take the first step towards your dream career.\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\nEssential Requirements1-3 Years of experience of export and import (ECCN and HS) classification particularly around category 3,4 and 5 of the ECCN and Chapter 84 of HS system.\nUnderstanding of export - import regulations and ability to ensure compliance\nHigh level attention to detail for accurate classification and documentation\nStrong, data-gathering and analytical skills\nAbility to effectively communicate with internal and external stakeholdersDesirable RequirementsBachelor's degree in international Trade or similar experience.\nData analysis and reporting skillsWho we areWe believe that each of us has the power to make an impact. That’s why we put our team members at the center of everything we do. If you’re looking for an opportunity to grow your career with some of the best minds and most advanced tech in the industry, we’re looking for you.\nDell Technologies is a unique family of businesses that helps individuals and organizations transform how they work, live and play. Join us to build a future that works for everyone because Progress Takes All of Us.\nApplication closing date: 6th Oct 2023\nDell Technologies is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. Read the full Equal Employment Opportunity Policy here.Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}