{
    "Job ID": "69874157",
    "Description": "Arcadis is the world's leading company delivering sustainable design, engineering, and consultancy solutions for natural and built assets.We are more than 36,000 people, in over 70 countries, dedicated to improving quality of life. Everyone has an important role to play. With the power of many curious minds, together we can solve the world’s most complex challenges and deliver more impact together.Role DescriptionThis role is part of Arcadis’ Global Excellence Centre (GEC) and will join our 3,000+ talented individuals working in India, Romania, and Philippines, in partnership with Arcadis’ offices globally.  The GEC brings key capabilities and capacity to support our clients seamlessly around the world.  For those in GEC there are options to be dedicated to one country; developing deep knowledge and strong relationships, as well as opportunities to be part of teams working truly globally as a centre of excellence, offering diversity and variety. Arcadians are by nature, globally minded and culturally aware, and Arcadis strongly believes in flexibility which enables change over time as your career progresses. The GEC model is well embedded in Arcadis, and the strong relationships that exist between our global offices are truly unique. Role AccountabilitiesDelivery of risk management services to clients in compliance with client governance, processes and objectives.\nFacilitation of workshops in a client environment, using advanced methods for risk, value and lessons learnt processes.\nUndertaking day-to-day risk management activities including identification, prioritisation, register management, action planning and monitoring.\nProduction of periodic risk reporting including profiled risk expenditure, impacted risk / drawdown and risk exposure changes.\nDeveloping and undertaking advanced Quantitative Risk Analysis including Cost, Schedule and integrated Cost and Schedule analyses, to enable robust forecasting and tracking of risk exposure.\nUse knowledge and experience to ensure identification and management of all significant risks to achievement of project objectives.\nDevelopment and implementation of project risk management plans.\nDelivery of discrete risk interventions and embedded risk management services.\nDemonstrating the delivery of value and reduction of risk exposure through active mitigation of threats and maximisation of opportunities.\nAct as an ambassador for risk management, coaching others in the requirements, processes and benefits of risk management.Qualifications & ExperienceDegree educated with 3+ years risk management experience, including evidence of delivery of major programmes\nWorking towards relevant professional certification, such as APM Risk Certificate, IRM Certificate\nExperience in the construction or infrastructure sectors.\nExperience in the application of Quantitative Risk Analysis (QRA) techniques and tools, for example: @Risk and Primavera Risk Analysis (previously Pertmaster), including the analysis of complex logic-linked cost-loaded schedules. \nExperience using Enterprise Risk Management tools, for example, Active Risk Manager (ARM), Predict!.\nExperience in the delivery of risk throughout the project lifecycle including support of investment decisions and delivery/implementation phases. \nUnderstanding of construction contracts and the relationship between risk management and controls/management functions including: project management, change control, planning & scheduling, cost & commercial management and reporting.\nEvidence of previous experience in definition and delivery of risk management plans within projects. \nStrong communication, interpersonal and facilitation skills.\nCollaborative working style and consulting behaviours.\nA logical approach and ability to think through complex issues to co-ordinate multi-faceted aspects of projects\nSelf-motivated and proactive, with the ability to work independently.Why Arcadis?We can only achieve our goals when everyone is empowered to be their best. We believe everyone's contribution matters. It’s why we are pioneering a skills-based approach, where you can harness your unique experience and expertise to carve your career path and maximize the impact we can make together. You’ll do meaningful work, and no matter what role, you’ll be helping to deliver sustainable solutions for a more prosperous planet. Make your mark, on your career, your colleagues, your clients, your life and the world around you.Together, we can create a lasting legacy.Our Commitment to Equality, Diversity, Inclusion & BelongingWe want you to be able to bring your best self to work every day, which is why we take equality and inclusion seriously and hold ourselves to account for our actions. Our ambition is to be an employer of choice and provide a great place to work for all our people.Join Arcadis. Create a legacy.#JoinArcadis#CreateALegacy Job Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "Bengaluru, India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Employer (Private Sector)",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}