{"Job ID": "69874158", "Description": "When you’re one of us, you get to run with the best. For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services. Epsilon’s best-in-class identity gives brands a clear, privacy-safe view of their customers, which they can use across our suite of digital media, messaging and loyalty solutions. We process 400+ billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. Thanks to the work of every employee, Epsilon India is now Great Place to Work-Certified™. Epsilon has also been consistently recognized as industry-leading by Forrester, Adweek and the MRC. Positioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit epsilon.com/apac or our LinkedIn page.About BUAt the heart of everything we do is data and this team. Our premium data assets empower the team to drive desirable outcomes for leading brands across industries. Armed with high volumes of transactional data, digital expertise and unmatched data quality, the team plays a key role in improving all our product offerings. Our data artisans are keen on embracing the latest in technology and trends, so there’s always room to grow and something new to learn here.Why we are looking for you?Seeking a highly motivated and well-rounded Senior Oracle DBA with a strong development background to be part of a fast-paced production support and full-lifecycle implementation team.What will you enjoy in this role?Candidate is expected to be familiar with database architecture, logical and physical design, automation, documentation, installs, shell scripting, PL/SQL programming, backup & recovery concepts, and database performance and tuning. Candidate must have good analytical, verbal, and written skills.What will you do?Full life cycle support of client's database(s). Database system utilizes RAC and non-RAC for OLTP and warehouse, Active DataGuard for DR, partitioning on 12c and 19c on premises and cloud environment.\nResponsible for database backups, design, development, testing, and performance tuning.\nWill work with developers to design and build new structures to support application enhancements and promote database changes throughout the Dev, UAT and Prod databases.\nResponsible for quarterly patch applications (PSU) and periodic database upgrades with minimal downtime in database environment.\nRequired to participate in 24x7 on-call rotation and be available to perform periodic after-hours support.\nProactively think toward automation of repeated tasks.6+ years of related experience with implementation and administration of database systems.\nBachelor Degree or equivalent experience required.\nAble to administer, manage and tune high-transaction Standalone/RAC production server environment(s) on premises and cloud environments.\nAble to understand and meet needs of end users.\nAble to work with multiple project in a dynamic, fast paced and often changing environment.\nStrong design, development, administration skills.\nStrong knowledge on managing Automatic storage management.\nStrong analytical and troubleshooting skills for complex database performance issues using AWR/ASH/ADDM/TKPROF/SQLT/10046 tracing/OSWatcher/CHM etc.\nStrong knowledge of database upgrade/migrations.\nStrong knowledge in using Backup and recovery tools(RMAN/EXPDP/IMPDP)\nStrong knowledge of Oracle DataGuard Physical Standby configuration, build and support including DataGuard Broker and replication.\nKnowledge on database programming and query troubleshooting.\nKnowledge on Oracle Enterprise Manager.\nExperience in managing Database in AWS cloud environment.\nExperience in Oracle Exadata\nExperience in writing Shell scripts.\nHave good written/oral communication and soft skills.\nOracle certification can be plus.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Bengaluru, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}