{
    "Job ID": "69873026",
    "Description": "Job Purpose:Full Stack Lead to produce scalable software solutions with over 8 years of experience.Job Background/context:The position is based in India and will require the candidate to work as a full-stack lead for On-boarding platform\nThis role will report to the Project Manager in Pune.\nProject entails designing and implementing pre-approved UI, constructing the API, connecting the two, and setting up the server infrastructure. This includes all associated areas such as database and architecture design.\nCandidate will be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment.\nCandidate will work in a team setting and work closely with team members\nCandidate should be highly self-motivated and innovativeKnowledge/Experience:Proven experience as a Full Stack Developer or similar role\nComfortable around both front-end and back-end coding languages, development frameworks and third-party libraries\nHands on experience on Core Java, Spring, Spring boot\nHands on experience with RESTful services using frameworks like Spring, Jersey\nKnowledge on Micro services (Service discovery, API Gateway, config server) will have added advantage\nFamiliarity with databases like Oracle and MongoDB\nStrong knowledge on UI frameworks such as Angular, Angular JS, React (optional)\nFluent in CSS (Foundation or Bootstrap), JavaScript and HTML5, with an understanding of CSS pre-processors including Sass and LESS\nDesirable Skills (Not Necessary):\nUI Unit test frameworks (Jasmine, Karma, Protractor)\nJava Junit testing using Junits, Mockito, TestNG\nExperience on Hibernate, JPA is a plus\nELK\nKnowledge of continuous integration tools like Jenkins/Team city\n\nKnowledge of version control tool such as GIT\nShould have worked in Agile EnvironmentKey Responsibilities:Building Elegant solutions and Architectural solutions\nDevelop and design RESTful services and APIs\nDevelop visually appealing front end website architecture, including translating designer mock-ups and wireframes into front-end code\nDevelop functional databases, applications, and servers to support websites on the back end\nDesign , develop, test and maintain, robust, resilient, scalable, high quality software\nWork closely with distributed teams ,Product Managers, Testers and Architects to execute on the requirements\nStay abreast of developments in web applications and programming languages\nEnsure that non-functional requirements such as security, performance, maintainability, scalability, usability, and reliability are being considered when architecting solutions.\nStay current and provide insight on cutting edge software approaches, architectures, and vendorsQualifications:Bachelor’s degree (in science, computers, information technology or engineering)\nCandidate should be willing to work late in the evening India time on need basis in order to interact with US team and to meet urgent requests by Clients.-------------------------------------------------Job Family Group:-------------------------------------------------Job Family:------------------------------------------------------Time Type:------------------------------------------------------Citi is an equal opportunity and affirmative action employer.Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.View the \"EEO is the Law\" poster. View the EEO is the Law Supplement.View the EEO Policy Statement.View the Pay Transparency PostingJob Details",
    "Skills": [],
    "Preferred": {},
    "Data": {
        "Job Location": "India",
        "Company Industry": "Other Business Support Services",
        "Company Type": "Unspecified",
        "Employment Type": "Unspecified",
        "Monthly Salary Range": "Unspecified",
        "Number of Vacancies": "Unspecified"
    }
}