{"Job ID": "69873609", "Description": "Zscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. With more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances. Zscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.Engineer at Zscaler is a developer responsible for writing frameworks and tools to test products. It is a very unique and challenging role and provides immense opportunity to design and develop wide-reaching tools. It combines the \"building\" aspect of software design engineering with the \"breaking\" aspect of software test engineering. You'll be writing code that automatically verifies the quality of the product. That means that you potentially write more code than the developers.Basic Qualification:Minimum 7 years of working on systems, or/and distributed systems with a focus on networking/firewall technologies, and cloud infrastructure\nKnowledge of AWS or similar cloud computing platforms\nKnowledge of virtual environments like OVA, Docker containers, Kubernetes\nKnowledge of build automation framework.\nHands-on experience in Python or similar scripting languages.\nExperience with Open source tools and technologies, code repos.\nStrong Unix/Linux OS experience\nGood to have an understanding of TCP/IP protocol stack, HTTP, TLS, PKI and other related\nprotocols and products (DNS, DHCP, VPN, HA, routing and switching)\nGood to have Understanding of security technologies like firewall, IPS, Authentication,VPN\nDemonstrates reasonable expertise in software development and development automation\nWorking experience with REST APIs.\nOutstanding written and verbal communication skills.\nSelf-motivated, a strong team player.\nExcellent communication, collaboration, reporting, analytical and problem\nA BS/MS degree in computer science or related field.#LI-MS6Why Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team. \nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com. Zscaler is proud to be an equal opportunity and affirmative action employer. We celebrate diversity and are committed to creating an inclusive environment for all of our employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status or any other characteristics protected by federal, state, or local laws.Job Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Hyderabad, India", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}