{"Job ID": "69875737", "Description": "Join the UAE’s largest bank and one of the world’s largest and safest financial institutions. Our focus is to create value for our employees, customers, shareholders and communities to grow through differentiation, agility and innovation. We are looking for top talent and your success is our success. Accelerate your growth as you help us reach our goals and advance your career. Be ready to make your mark a top company, in an exciting & dynamic industry. JOB PURPOSE:This role is primarily responsible for attending and resolving customer queries with high degree of efficiency thereby enhancing customer’s experience with FAB.  Deliver timely service to internal and external customers in adherence to the policies and procedures.KEY ACCOUNTABILITIES:Policies, Systems, Processes & ProceduresEnsure complete adherence to the policies and procedures laid down by FAB without any compromise to controls set as per departments SOP’s.\nReview SOPs as per the Audit and RMU requirement for all PBO-Clients Services Unit and products\nMonitor process related controls to ensure protection to the bank from all identified risks.\nEnsure conformance to internal procedures / policies / guidelines and regulations as applicable.Continuous ImprovementEncourage/educate customers to avail various banking avenues to improve overall customer experience.\nInstitutionalizing best practices, establishing service quality standards and improving service deliverables to customers.ReportingPrepare unit level statistics data with respect to customer emails & telephone calls in connection with operational issues and services related to queries of PCG customers.\nGenerate periodic reports for effective decision making.Job Specific AccountabilitiesSupport Relationship Management Teams by providing operational services to their clients in liaison with other internal departments.\nEnsure timely endeavour to enhance the client experience by servicing clients and providing them with operational & administrative support.\nAdhere & ensure conformance to all internal procedures, policies and other regulatory guidelines as applicable.\nEnsure best in class service to Internal and external customers to avoid any escalations and provide 24X7 services to VVIP clients.\nMaintain confidentiality of customer Sensitive information at all times, ensure safe custody of documents & customer records.\nParticipate actively in the various initiatives from the unit and pan bank projects as delegated.Job ContextSpecific AccountabilityEnsure timely service to clients and arrange to provide appropriate service either directly or in liaison with other internal departments or branches.\nPossess good knowledge on the trade finance  products.\nHandle customer request fulfilment task for trade transactions by liaising with the relevant internal teams.\nClient’s trade query handling and business support in managing trade related activities.\nAdhere to the established processes in line with the product papers and obtain necessary internal approvals through emails and workflow systems.\nValidate customer instructions for its conformity with banks requirements for seamless processing.\nEnsure complete adherence to Service Level Agreements with clients in order to manage client expectations. Review SLA’s at agreed frequency to ensure smooth operations and scheduled delivery of services.\nMaintain timely and effective communications with clients & other internal stake holders.\nProcess customer transactions related to trade & cash management functions, servicing PCG clients.\nHandle account statement and other requests of customers in accordance with instructions held.\nAttend queries received from other banks and internal customer to take necessary action.\nPerform daily and periodic reconciliations as per standard operating procedures. Provide periodic feedback on process improvement measures in order to have an efficient and risk free client services.\nEnsure archival and retrieval of documents as per department’s guidelines.\nContribute in any other additional activity / responsibility based on need.Minimum QualificationBachelor’s Degree / Higher DiplomaMinimum ExperienceMinimum 2 years of related work experience in banking industry specifically in trade finance functionsJob Details", "Skills": [], "Preferred": {}, "Data": {"Job Location": "Abu Dhabi, United Arab Emirates", "Company Industry": "Other Business Support Services", "Company Type": "Unspecified", "Employment Type": "Unspecified", "Monthly Salary Range": "Unspecified", "Number of Vacancies": "Unspecified", "Job Role": "Unspecified"}}